[
{
    "post_author": "Kitty_Meow_Meow_",
    "post_id": "1dtyawo",
    "post_score": "1",
    "post_time": "Wednesday, July 3, 2024 at 1:15:02 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Looking for good tools for sorting files.",
    "media": [],
    "post_content": "Howdy y'all, I recently downloaded all of my Twitter bookmarks and since this is year's worth of bookmarks it has resulted in around 4000 files. I would like to sort all these files into separate folders but dragging and dropping each file or small bundle of files is rather tedious and time consuming. So I am in search of tools that can help speed up this process. my first idea of something that might be helpful would be a program that uses keybinds to move files into folders. but any tool that can make this go faster would be very helpful.\nThank yall so much and have a good one",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        }
    ]
},
{
    "post_author": "Bern_Down_the_DNC",
    "post_id": "1dspldr",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 1:22:36 PM GMT+3",
    "flair_text": "Scripts/Software",
    "post_title": "Trying to figure out an efficient way to sync data off an iphone 11 to Windows 10 PC, but the pictures are all in different folders named with random characters.",
    "media": [],
    "post_content": "All the photos on the iphone are separated into randomly named folders. I would like to be able to use some sort of software to organize the photos into a list by date and then drag all photos in certain date range off of the iphone onto the PC at once.\nHow would you all recommend doing this?\nThank you.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "Latte_THE_HaMb",
            "score": "1",
            "content": "I use PhotoSync with its companion program you can run on the computer and it'll pull and backup all photos found on the phone, you can use it to do regular backups on a schedule or just use it when you need to.",
            "replies": []
        }
    ]
},
{
    "post_author": "Namtiee",
    "post_id": "1dtaals",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 4:52:01 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Dataset of telegram @’s",
    "media": [],
    "post_content": "Is there a dataset of all telegram names registered? Or maybe a way to make that dataset?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "CreatorGalvin",
            "score": "3",
            "content": "For what? To sell to scammers? Also, I'm pretty sure your request violates several local privacy protections - including GDPR in the EU - which is a huuuuge no-no.",
            "replies": [
                {
                    "author": "Comprehensive-Ad3549",
                    "score": "0",
                    "content": "I wanted to use it for checking name availability. Also I wouldn't even ask I it wasn't for the fact that you can search for any user, so technically you could bruteforce it if it wasn't for the flooding limitations.",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "Square-Ball",
    "post_id": "1dpecax",
    "post_score": "1632",
    "post_time": "Thursday, June 27, 2024 at 3:41:04 AM GMT+3",
    "flair_text": "",
    "post_title": "Paramount kills several legacy websites - including Comedy Central, clips and full episodes of Colbert and Daily Show gone.",
    "media": [
        "https://external-preview.redd.it/paramount-kills-several-legacy-websites-including-comedy-v0-jKNd8FJ0nCsT0sLbiQRfGYUAEVIXv8YmajwkmQtuL1g.jpg?width=640&crop=smart&auto=webp&s=fcc34faf32eda857824f0cfd92f5a46b10f6f767"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "LowerFinding9602",
            "score": "495",
            "content": "They also nuked a ton of old MTV from back in the day when they played music.",
            "replies": [
                {
                    "author": "Lout324",
                    "score": "125",
                    "content": "1989?",
                    "replies": [
                        {
                            "author": "agnisumant",
                            "score": "94",
                            "content": "Since Bruce Springsteen, Madonna; Way before Nirvana; There was U2 and Blondie, And music still on MTV",
                            "replies": [
                                {
                                    "author": "Lout324",
                                    "score": "46",
                                    "content": "We can't rewind. We've gone too far.",
                                    "replies": []
                                },
                                {
                                    "author": "Jack_LeRogue",
                                    "score": "7",
                                    "content": "I just recently learned that the Bowling for Soup version is apparently a cover. The original version was released two months before the Bowling for Soup version. I don’t know why that feels so weird to me.",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "waywardspooky",
            "score": "187",
            "content": "",
            "replies": [
                {
                    "author": "Billyboii",
                    "score": "124",
                    "content": "",
                    "replies": []
                }
            ]
        },
        {
            "author": "Deadmanx132489",
            "score": "196",
            "content": "Super pissed about this. It wasnt bad enough that MTV nuked theirs and for so long I still can't find shows like 'Room Raiders' and other because they protected their assets to death.",
            "replies": [
                {
                    "author": "Buzstringer",
                    "score": "15",
                    "content": "And Celebrity Deathmatch, actual art in motion.",
                    "replies": []
                }
            ]
        },
        {
            "author": "rp847",
            "score": "207",
            "content": "Munchma Quchi, erased from existence. Fuck you Paramount.",
            "replies": [
                {
                    "author": "BigBeefnCheddarr",
                    "score": "77",
                    "content": "I have every episode of the daily show and the report. Someone will need to dm me instructions but I could make a torrent. I may even have the original torrent somewhere but it's not guaranteed",
                    "replies": []
                }
            ]
        },
        {
            "author": "markth_wi",
            "score": "24",
            "content": "between not having these available, and uploading them to youtube or something why wouldn't Paramount just embrace all that content on Vimeo or some other site that would be happy to have that traffic , hell it could even generate this weird thing called \"revenue\".",
            "replies": []
        }
    ]
},
{
    "post_author": "KandyVenom",
    "post_id": "1dty7lw",
    "post_score": "4",
    "post_time": "Wednesday, July 3, 2024 at 1:10:50 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "SSD with 20k hours and almost 2 Petabytes of total writes.",
    "media": [
        "https://preview.redd.it/ssd-with-20k-hours-and-almost-2-petabytes-of-total-writes-v0-nae5571wi6ad1.jpeg?width=640&crop=smart&auto=webp&s=20ec7afdc6a585704e08ce2531e20dd0fbb2c75f",
        "https://i.redd.it/nae5571wi6ad1.jpeg"
    ],
    "post_content": "Just bought a secondhand 2TB Crucial MX500 SSD off ebay for 70 bucks. Plan is to put it in my ps4 pro. However, after running a check, it looks to have been used and abused. Is it worth installing or should I buy new?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "PkHolm",
            "score": "1",
            "content": "Something wrong with that SMART. I do not think you can trust it. Unused spare block count = 0. Lifetime remaining = 102% And look to temperatures.. And wrong reddit mate.",
            "replies": [
                {
                    "author": "Green-Scratch-1230",
                    "score": "1",
                    "content": "MX500 and BX500 are notorious for having incorrect smart values. it should be on M3CR046 or later firmware , or your about to have a bad time, not just with smart errors , but plenty of problems.",
                    "replies": [
                        {
                            "author": "OpacusVenatori",
                            "score": "1",
                            "content": "The MX500 family has like 3 different firmware versions; so not necessarily 46 or later.",
                            "replies": [
                                {
                                    "author": "Green-Scratch-1230",
                                    "score": "1",
                                    "content": "i was speaking specifically to his version, its on 33",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "Far_Marsupial6303",
            "score": "1",
            "content": "Rule #9",
            "replies": []
        }
    ]
},
{
    "post_author": "noideawhatimdoing444",
    "post_id": "1dta1s6",
    "post_score": "33",
    "post_time": "Tuesday, July 2, 2024 at 4:39:49 AM GMT+3",
    "flair_text": "Hoarder-Setups",
    "post_title": "Finally where I wanna be",
    "media": [
        "https://preview.redd.it/finally-where-i-wanna-be-v0-u04ssi3bf0ad1.jpg?width=640&crop=smart&auto=webp&s=88a6290767222704634a34c9ce8f36364f3bdf3c",
        "https://preview.redd.it/finally-where-i-wanna-be-v0-kmtws61bf0ad1.jpg?width=640&crop=smart&auto=webp&s=1f4949a9886945e5ea3b2f6ba9a7007f51e19184",
        "https://preview.redd.it/finally-where-i-wanna-be-v0-8eq0725bf0ad1.jpg?width=640&crop=smart&auto=webp&s=a44a06103c322e4f6c85c5381e77fb13f05058f8"
    ],
    "post_content": "Ignore my terrible cable management🤣🤣 i ran out of sata cable and fucks to give. My server is finally set up and running just how i want it.\n5-500gb ssd's running as a pre-production pool. I let my system download about 60 movies/shows at a time and it gets dumped onto there.\nI have 6 14tb hard drives mirroring with a total usable space of 40.5tb with 250gb ssd working as a cache drive\nOn the software side i have truenas scale managing it all. Outside of that im running a headless windows machine that runs kometa as an automated search engine that feeds into radarr/sonarr. My library automatically downloads and catagorizes new pieces of content.\nBig shout out to hulu, peacock, and hbo max for giving it to me without any lube. Without them pissing me off with these high prices, i would have never built this beautiful machine.\nMy next steps will be updating the hardware. Im lacking when it comes down to my memory. Only running 16gb ddr3 non-ecc ram. My processor isnt where it should be. Im severly limiting the speed on my hard drive disks since theyre tied into a pcie 2.0 x1 port. Im happy i get 6 sata connectors right off the board but i have 12 drives in this case. Lots of stuff going on so these upgrades gotta wait but this was a really fun project for the time being. Only decent thing here besides the drives is the 3060 12gb\nI5-3450 3.1ghz, P8z77-v lx",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "Hamilton950B",
            "score": "2",
            "content": "",
            "replies": [
                {
                    "author": "noideawhatimdoing444",
                    "score": "2",
                    "content": "",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "Elevated_Dongers",
    "post_id": "1ds555a",
    "post_score": "18",
    "post_time": "Sunday, June 30, 2024 at 7:18:30 PM GMT+3",
    "flair_text": "Backup",
    "post_title": "Backing up 500gb desktop folder without corrupting files",
    "media": [],
    "post_content": "I have probably 400gb of pictures and videos on my desktop that I'd like to backup to another HDD before I perform a fresh install of windows, another 100gb in music and such. After searching, I concluded on veeam but it is not quite what I want I don't think. Seems that is just for \"images\" and I want basically a copy and paste of my files to the other drive. I read that windows copy/paste isn't exactly the best for this. I had tried veeam, but something broke and caused tons of issues with my PC. I eventually had to reflash my bios just to get it to boot after the image creation failed. Not sure how that happened.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "DavWanna",
            "score": "32",
            "content": "That's not what a backup is, but FreeFileSync will do the job just fine.",
            "replies": [
                {
                    "author": "Elevated_Dongers",
                    "score": "4",
                    "content": "going this route, thanks for the suggestion",
                    "replies": []
                },
                {
                    "author": "ZekerPixels",
                    "score": "2",
                    "content": "Don't forget to turn on VerifyCopiedFiles in the xml, then your done with running it a single time.",
                    "replies": []
                },
                {
                    "author": "snatch1e",
                    "score": "1",
                    "content": "+1 FreeFileSync or Robocopy will do what OP wants.",
                    "replies": []
                }
            ]
        },
        {
            "author": "maximumkush",
            "score": "15",
            "content": "Teracopy or Freefilesync",
            "replies": [
                {
                    "author": "Far_Marsupial6303",
                    "score": "14",
                    "content": "+1 to Teracopy. No matter what you use, the key to a successful copy is to verify that the process is 100% accurate. You do this by running a CRC (Cyclic Redundancy Check) and generate a HASH, which is an alphanumeric value of the files, both original and copy. You do this in Teracopy by setting Verify on. The second most important this is to always have more than one backup. Ideally at least two sets, with one set offsite physical or cloud in case of a local catastrophe.",
                    "replies": []
                }
            ]
        },
        {
            "author": "chancamble",
            "score": "8",
            "content": "Just use robocopy.",
            "replies": []
        },
        {
            "author": "Frequent_Trouble_",
            "score": "6",
            "content": "Just zip them and copy them over. ‘sha256sum’ the files on both sides if you really want to be sure they were copied successfully.",
            "replies": []
        },
        {
            "author": "dr100",
            "score": "11",
            "content": "Some hundreds GBs locally it's a nothingburger. If you \"want basically a copy and paste of my files to the other drive\" just do that, or use whatever file manager you like (yes, including the regular Explorer). If you \"tried veeam, but something broke and caused tons of issues with my PC. I eventually had to reflash my bios just to get it to boot after the image creation failed. Not sure how that happened\" you absolutely have other BIG issues unrelated to making backups or copying files from here to there.",
            "replies": []
        },
        {
            "author": "ThickSourGod",
            "score": "4",
            "content": "Windows copy/paste is fine. It's a bit slower than some other options, but it'll get the job done.",
            "replies": []
        },
        {
            "author": "CrystalFeeler",
            "score": "3",
            "content": "teracopy or syncovery",
            "replies": []
        },
        {
            "author": "Felatio-DelToro",
            "score": "3",
            "content": "If file \"creation/modified dates\" attributes are important to you keep an eye out what app you end up using. FreeFileSync is amazing but afaik it wont keep the dates.",
            "replies": []
        },
        {
            "author": "yuusharo",
            "score": "2",
            "content": "Rclone, rsync, or teracopy (if using Windows) would be a good bet. Anything that checks the hash of the file on both the source and destination paths would work here.",
            "replies": []
        },
        {
            "author": "ShadowLitOwl",
            "score": "1",
            "content": "If you have secondary pc, setup Syncthing on both and have it as one way sync from main to backup. That way it doesn’t mirror and acts more like a file backup.",
            "replies": []
        },
        {
            "author": "mpopgun",
            "score": "1",
            "content": "Unstoppable copier... it's old, but free and works well.",
            "replies": []
        },
        {
            "author": "OriginalPlayerHater",
            "score": "1",
            "content": "I have a program called fastcopy that seems to do a good job of copy, verify and sync functions. I like it because it integrates with context menu so I can right click copy normal or right click copy with fast copy supposedly its also faster but idk about all that",
            "replies": []
        },
        {
            "author": "Celcius_87",
            "score": "1",
            "content": "I would just use windows explorer to copy and paste the files",
            "replies": []
        },
        {
            "author": "UrgentSiesta",
            "score": "1",
            "content": "I'm a fan of BackBlaze. Never had a failure to restore over literally hundreds of computers. I've seen too many sob stories of physical backup drives gone bad, and nobody realizes it until the Primary drive goes bad, too.",
            "replies": []
        },
        {
            "author": "AresxRoyal",
            "score": "1",
            "content": "I would use fastcopy for that. You can use different copy or move methods and verify.",
            "replies": []
        },
        {
            "author": "Large_Medium_8984",
            "score": "1",
            "content": "Wait, you're telling me just plain ol' copy paste doesn't work? I moved 680k photos last week and they all appeared just fine. Ran through CloneSpy and the Check showed 1:1 files in both locations.",
            "replies": []
        },
        {
            "author": "fumblesmcdrum",
            "score": "-4",
            "content": "What's your comfort level? If you have a spare PC laying around you can install TrueNAS Scale on it, create a 2-drive mirrored pool, and add it as an SMB share on your network. Drag and drop your files onto that network directory and TrueNAS will monitor and protect against corruption.",
            "replies": []
        }
    ]
},
{
    "post_author": "munsterrr",
    "post_id": "1dty0y4",
    "post_score": "1",
    "post_time": "Wednesday, July 3, 2024 at 1:02:42 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Keychain Options",
    "media": [],
    "post_content": "Before anyone says anything about USB to NVME (990 Pro with Sabrent).\n.\nI am looking for something for quick work. I had a SanDisk Extreme Pro but lost it (thanks kids).\n.\nAny recommendations?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        }
    ]
},
{
    "post_author": "anakinfredo",
    "post_id": "jgtzum",
    "post_score": "4210",
    "post_time": "Friday, October 23, 2020 at 10:30:04 PM GMT+3",
    "flair_text": "Discussion",
    "post_title": "youtube-dl repo had been DMCA'd",
    "media": [
        "https://external-preview.redd.it/gx8PYlb4fhWZDfbeSEtCFRYFcFKw-2NMVf7Qk1u2I9w.jpg?width=640&crop=smart&auto=webp&s=8f846a87b57c1db54fea37f7d1ee1aeaa34e33d7"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "slowday_",
            "score": "550",
            "content": "Source downloadable from Pypi: https://pypi.org/project/youtube_dl/#files",
            "replies": [
                {
                    "author": "souldust",
                    "score": "97",
                    "content": "is the September 19th the latest version?",
                    "replies": [
                        {
                            "author": "slowday_",
                            "score": "89",
                            "content": "Looks like the last release was 2020-09-20, which is the version I've got on openSUSE ...so ...? https://web.archive.org/web/20201017155456if_/https://github.com/ytdl-org/youtube-dl/releases",
                            "replies": [
                                {
                                    "author": "Compsky",
                                    "score": "65",
                                    "content": "Looks like the last release was 2020-09-20 Yes. There were only 10 very minor commits to the master branch up to yesterday: adding support to di.se, video.ibm.com, and several very minor fixes.",
                                    "replies": []
                                },
                                {
                                    "author": "eddieHaskellHands",
                                    "score": "1",
                                    "content": "from this one you can also pull the actual releases and the hashes. i have them as well on my private repo...such a futile attempt to police the internet by the RIAA.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "5thvoice",
                            "score": "18",
                            "content": "According to the main website, the most recent official build is from the 20th, so probably yes.",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "mister_gone",
            "score": "229",
            "content": "How can the DCMA remove 3rd party software for potential use? That's outrageous.",
            "replies": []
        },
        {
            "author": "Lord_Bling",
            "score": "1102",
            "content": "See, this is why we can't have nice things.",
            "replies": []
        },
        {
            "author": "x1-unix",
            "score": "673",
            "content": "Okay, following their logic - now they should take down all Chromium and Firefox forks because they could be used to listen that tracks.",
            "replies": []
        },
        {
            "author": "q5sys",
            "score": "348",
            "content": "I wonder if the RIAA will go after jdownloader2 and all the other ways you can download copyrighted material from websites... or if they're just going for the obvious target. Are they going to go after CURL and WGET as well?",
            "replies": [
                {
                    "author": "Atemu12",
                    "score": "192",
                    "content": "And screen recorders as those are equally effective measures to circumvent Youtube's \"DRM\".",
                    "replies": []
                }
            ]
        },
        {
            "author": "ThereWolves",
            "score": "91",
            "content": "This is incredibly sad. youtube-dl isn't a sleazy way to get free music; it's an important tool for fair use audio / videos in projects. I hope that the devs have a solid backup plan. I'd love to know if they are planning to host the code on a different website. I know that the source code is out there, but I hope this project can continue without interference on a stable code hosting website. Even if this doesn't stop development of the code, not being able to host the code on Github must have some consequences in terms of community, visibility and availability of the project.",
            "replies": []
        },
        {
            "author": "Zipdox",
            "score": "81",
            "content": "Good thing I have a recent clone",
            "replies": []
        },
        {
            "author": "vemundveien",
            "score": "522",
            "content": "Copyright law and its consequences have been a disaster for the human race.",
            "replies": []
        },
        {
            "author": "pakadum",
            "score": "212",
            "content": "Apparently the sole purpose of yourube-dl is to pirate their f#%%*ing music videos. Check out this nonsense from their email “The clear purpose of this source code is to (i) circumvent the technological protection measures used by authorized streaming services such as YouTube, and (ii) reproduce and distribute music videos and sound recordings owned by our member companies without authorization for such use. We note that the source code is described on GitHub as “a command-line program to download videos from YouTube.com and a few more sites.”",
            "replies": [
                {
                    "author": "anakinfredo",
                    "score": "118",
                    "content": "I think it's more because youtube-dl had a link or example that downloaded something that was copyrighted - not really the best example to use...",
                    "replies": []
                }
            ]
        },
        {
            "author": "nicholasserra",
            "score": "132",
            "content": "The most fucked up part here, is that folks who are technical enough to use youtube-dl likely wouldn't waste their time downloading \"popular\" music from YouTube, considering the many easier and higher quality alternatives.",
            "replies": []
        },
        {
            "author": "HTWingNut",
            "score": "102",
            "content": "First Twitch, now this? It's time to revolt. Seriously. I am all for protecting rights, but it's beyond ridiculous. Does this mean they can strike down Blu-ray burner manufacturers or hard drive manufacturers or NAS makers because they offer tools to store potentially copyrighted material? That's where it's heading. We will have DRM on anything that can store something digital.",
            "replies": []
        },
        {
            "author": "MrSpecialR",
            "score": "99",
            "content": "If someone is tech savvy enough to use youtube-dl I bet at least 90% of those same people same people have uBlock/PiHole/Blokada set up. The more they try to squish \"potential piracy\" the stronger it becomes while simultaneously being worse for the legit users of said thing. DRM is the worst thing that happened in media.",
            "replies": []
        },
        {
            "author": "hoistthefabric",
            "score": "91",
            "content": "Basically what these copyright control freaks are telling people is that you have to follow their rules while they don't have to follow any rules. Anyone who supports copyright laws or wants to write more copyright laws is a literal psychopath. RIAA has DMCA'd the entire repo of youtube-dl and all of its forks and their \"argument\" for this is that youtube-dl can be used to \"illegally download\" songs because it has \"anti-privacy code\" and they're citing YouTube's \"license\" to \"prove\" it. In other words, these control freaks are telling you to become mute because according to them you're not allowed to sing copyrighted songs unless you pay them. They're also telling you to become deaf because you're not allowed to listen to anything until you've paid for it.",
            "replies": []
        },
        {
            "author": "oh-bee",
            "score": "75",
            "content": "Apparently this was their excuse: https://github.com/rbrito/pkg-youtube-dl/blob/master/youtube_dl/extractor/youtube.py#L604",
            "replies": []
        }
    ]
},
{
    "post_author": "AdamLynch",
    "post_id": "krx449",
    "post_score": "34325",
    "post_time": "Thursday, January 7, 2021 at 12:02:01 AM GMT+3",
    "flair_text": "Discussion",
    "post_title": "MEGATHREAD: Archiving the Capitol Hill Riots",
    "media": [
        "https://www.reddit.com/r/DataHoarder/comments/krx449/megathread_archiving_the_capitol_hill_riots/gie22jq?utm_source=share&utm_medium=web2x&context=3",
        "https://www.reddit.com/user/kenkoda/",
        "https://www.reddit.com/user/Deifer/",
        "https://www.reddit.com/user/tweedge/",
        "https://docs.google.com/spreadsheets/d/1YdYWj-LQ5mAg3je0bogfrm5IjXjviyiX0yUu4M7ZSD8/edit",
        "https://www.reddit.com/r/DataHoarder/comments/krx449/megathread_archiving_the_capitol_hill_riots/giefaxc?utm_source=share&utm_medium=web2x&context=3",
        "https://mirrors.deadops.de/capitol2021.zip",
        "https://www.reddit.com/user/benediktkr/",
        "https://www.reddit.com/user/SneakyPieBrown/",
        "https://www.reddit.com/user/nuzzles_u_uwu/",
        "https://mega.nz/folder/30MlkQib#RDOaGzmtFEHkxSYBaJSzVA",
        "https://tips.fbi.gov/digitalmedia/aad18481a3e8f02",
        "https://www.reddit.com/user/firstgrow/",
        "https://mega.nz/megadrop/fgve0WRa880",
        "https://capitol-hill-riots.s3.us-east-1.wasabisys.com/directory.html",
        "https://twitter.com/bellingcat/status/1346989282167119872?s=19",
        "http://legalize.ga/",
        "https://lilprincess.tk/storage/torrents/Trump%20protest%20Jan%2006%202021/",
        "https://www.reddit.com/r/DataHoarder/comments/krx449/megathread_archiving_the_capitol_hill_riots/giejufu?utm_medium=android_app&utm_source=share&context=3",
        "https://mirrors.deadops.de/capitol2021"
    ],
    "post_content": "FINAL UPDATE as of January 31st 5:35PM EST:\nThank you to everyone who shared content. The content being submitted now from what I'm seeing is duplicates of older content. I will thus no longer be updating this archive. The MEGA will remain untouched, so use that as you please, but that will likely die one day as there is a bandwidth/transfer limit. I will be uploading the content to Internet Archive, as well as other sources, but until then the torrent magnet that I will be seeding for a little while is listed below - my bandwidth isn't the best so please do seed if you can:\nMagnet:\nmagnet:?xt=urn:btih:c8fc9979cc35f7062cd8715aaaff4da475d2fadc&dn=Trump%20protest%20Jan%2006%202021&tr=udp%3a%2f%2ftracker.torrent.eu.org%3a451%2fannounce&tr=udp%3a%2f%2fpublic.popcorn-tracker.org%3a6969%2fannounce&tr=http%3a%2f%2f104.28.1.30%3a8080%2fannounce&tr=http%3a%2f%2f104.28.16.69%2fannounce&tr=http%3a%2f%2f107.150.14.110%3a6969%2fannounce&tr=http%3a%2f%2f109.121.134.121%3a1337%2fannounce&tr=http%3a%2f%2f114.55.113.60%3a6969%2fannounce&tr=http%3a%2f%2f125.227.35.196%3a6969%2fannounce&tr=http%3a%2f%2f128.199.70.66%3a5944%2fannounce&tr=http%3a%2f%2f157.7.202.64%3a8080%2fannounce&tr=http%3a%2f%2f158.69.146.212%3a7777%2fannounce&tr=http%3a%2f%2f173.254.204.71%3a1096%2fannounce&tr=http%3a%2f%2f178.175.143.27%2fannounce&tr=http%3a%2f%2f178.33.73.26%3a2710%2fannounce&tr=http%3a%2f%2f182.176.139.129%3a6969%2fannounce&tr=http%3a%2f%2f185.5.97.139%3a8089%2fannounce&tr=http%3a%2f%2f188.165.253.109%3a1337%2fannounce&tr=http%3a%2f%2f194.106.216.222%2fannounce&tr=http%3a%2f%2f195.123.209.37%3a1337%2fannounce&tr=http%3a%2f%2f210.244.71.25%3a6969%2fannounce&tr=http%3a%2f%2f210.244.71.26%3a6969%2fannounce&tr=http%3a%2f%2f213.159.215.198%3a6970%2fannounce&tr=http%3a%2f%2f213.163.67.56%3a1337%2fannounce&tr=http%3a%2f%2f37.19.5.139%3a6969%2fannounce&tr=http%3a%2f%2f37.19.5.155%3a6881%2fannounce&tr=http%3a%2f%2f46.4.109.148%3a6969%2fannounce&tr=http%3a%2f%2f5.79.249.77%3a6969%2fannounce&tr=http%3a%2f%2f5.79.83.193%3a2710%2fannounce&tr=http%3a%2f%2f51.254.244.161%3a6969%2fannounce&tr=http%3a%2f%2f59.36.96.77%3a6969%2fannounce&tr=http%3a%2f%2f74.82.52.209%3a6969%2fannounce&tr=http%3a%2f%2f80.246.243.18%3a6969%2fannounce&tr=http%3a%2f%2f81.200.2.231%2fannounce&tr=http%3a%2f%2f85.17.19.180%2fannounce&tr=http%3a%2f%2f87.248.186.252%3a8080%2fannounce&tr=http%3a%2f%2f87.253.152.137%2fannounce&tr=http%3a%2f%2f91.216.110.47%2fannounce&tr=http%3a%2f%2f91.217.91.21%3a3218%2fannounce&tr=http%3a%2f%2f91.218.230.81%3a6969%2fannounce&tr=http%3a%2f%2f93.92.64.5%2fannounce&tr=http%3a%2f%2fatrack.pow7.com%2fannounce&tr=http%3a%2f%2fbt.henbt.com%3a2710%2fannounce&tr=http%3a%2f%2fbt.pusacg.org%3a8080%2fannounce&tr=http%3a%2f%2fbt2.careland.com.cn%3a6969%2fannounce&tr=http%3a%2f%2fexplodie.org%3a6969%2fannounce&tr=http%3a%2f%2fmgtracker.org%3a2710%2fannounce&tr=http%3a%2f%2fmgtracker.org%3a6969%2fannounce&tr=http%3a%2f%2fopen.acgtracker.com%3a1096%2fannounce&tr=http%3a%2f%2fopen.lolicon.eu%3a7777%2fannounce&tr=http%3a%2f%2fopen.touki.ru%2fannounce.php&tr=http%3a%2f%2fp4p.arenabg.ch%3a1337%2fannounce&tr=http%3a%2f%2fp4p.arenabg.com%3a1337%2fannounce&tr=http%3a%2f%2fpow7.com%3a80%2fannounce&tr=http%3a%2f%2fretracker.gorcomnet.ru%2fannounce&tr=http%3a%2f%2fretracker.krs-ix.ru%2fannounce&tr=http%3a%2f%2fretracker.krs-ix.ru%3a80%2fannounce&tr=http%3a%2f%2fsecure.pow7.com%2fannounce&tr=http%3a%2f%2ft1.pow7.com%2fannounce&tr=http%3a%2f%2ft2.pow7.com%2fannounce&tr=http%3a%2f%2fthetracker.org%3a80%2fannounce&tr=http%3a%2f%2ftorrent.gresille.org%2fannounce&tr=http%3a%2f%2ftorrentsmd.com%3a8080%2fannounce&tr=http%3a%2f%2ftracker.aletorrenty.pl%3a2710%2fannounce&tr=http%3a%2f%2ftracker.baravik.org%3a6970%2fannounce&tr=http%3a%2f%2ftracker.bittor.pw%3a1337%2fannounce&tr=http%3a%2f%2ftracker.bittorrent.am%2fannounce&tr=http%3a%2f%2ftracker.calculate.ru%3a6969%2fannounce&tr=http%3a%2f%2ftracker.dler.org%3a6969%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.com%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.com%3a80%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.nl%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.nl%3a80%2fannounce&tr=http%3a%2f%2ftracker.edoardocolombo.eu%3a6969%2fannounce&tr=http%3a%2f%2ftracker.ex.ua%2fannounce&tr=http%3a%2f%2ftracker.ex.ua%3a80%2fannounce&tr=http%3a%2f%2ftracker.filetracker.pl%3a8089%2fannounce&tr=http%3a%2f%2ftracker.flashtorrents.org%3a6969%2fannounce&tr=http%3a%2f%2ftracker.grepler.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker.internetwarriors.net%3a1337%2fannounce&tr=http%3a%2f%2ftracker.kicks-ass.net%2fannounce&tr=http%3a%2f%2ftracker.kicks-ass.net%3a80%2fannounce&tr=http%3a%2f%2ftracker.kuroy.me%3a5944%2fannounce&tr=http%3a%2f%2ftracker.mg64.net%3a6881%2fannounce&tr=http%3a%2f%2ftracker.opentrackr.org%3a1337%2fannounce&tr=http%3a%2f%2ftracker.skyts.net%3a6969%2fannounce&tr=http%3a%2f%2ftracker.tfile.me%2fannounce&tr=http%3a%2f%2ftracker.tiny-vps.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker.tvunderground.org.ru%3a3218%2fannounce&tr=http%3a%2f%2ftracker.yoshi210.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker1.wasabii.com.tw%3a6969%2fannounce&tr=http%3a%2f%2ftracker2.itzmx.com%3a6961%2fannounce&tr=http%3a%2f%2ftracker2.wasabii.com.tw%3a6969%2fannounce&tr=http%3a%2f%2fwww.wareztorrent.com%2fannounce&tr=http%3a%2f%2fwww.wareztorrent.com%3a80%2fannounce&tr=https%3a%2f%2f104.28.17.69%2fannounce&tr=https%3a%2f%2fwww.wareztorrent.com%2fannounce&tr=udp%3a%2f%2f107.150.14.110%3a6969%2fannounce&tr=udp%3a%2f%2f109.121.134.121%3a1337%2fannounce&tr=udp%3a%2f%2f114.55.113.60%3a6969%2fannounce&tr=udp%3a%2f%2f128.199.70.66%3a5944%2fannounce&tr=udp%3a%2f%2f151.80.120.114%3a2710%2fannounce&tr=udp%3a%2f%2f168.235.67.63%3a6969%2fannounce&tr=udp%3a%2f%2f178.33.73.26%3a2710%2fannounce&tr=udp%3a%2f%2f182.176.139.129%3a6969%2fannounce&tr=udp%3a%2f%2f185.5.97.139%3a8089%2fannounce&tr=udp%3a%2f%2f185.86.149.205%3a1337%2fannounce&tr=udp%3a%2f%2f188.165.253.109%3a1337%2fannounce&tr=udp%3a%2f%2f191.101.229.236%3a1337%2fannounce&tr=udp%3a%2f%2f194.106.216.222%3a80%2fannounce&tr=udp%3a%2f%2f195.123.209.37%3a1337%2fannounce&tr=udp%3a%2f%2f195.123.209.40%3a80%2fannounce&tr=udp%3a%2f%2f208.67.16.113%3a8000%2fannounce&tr=udp%3a%2f%2f213.163.67.56%3a1337%2fannounce&tr=udp%3a%2f%2f37.19.5.155%3a2710%2fannounce&tr=udp%3a%2f%2f46.4.109.148%3a6969%2fannounce&tr=udp%3a%2f%2f5.79.249.77%3a6969%2fannounce&tr=udp%3a%2f%2f5.79.83.193%3a6969%2fannounce&tr=udp%3a%2f%2f51.254.244.161%3a6969%2fannounce&tr=udp%3a%2f%2f62.138.0.158%3a6969%2fannounce&tr=udp%3a%2f%2f62.212.85.66%3a2710%2fannounce&tr=udp%3a%2f%2f74.82.52.209%3a6969%2fannounce&tr=udp%3a%2f%2f85.17.19.180%3a80%2fannounce&tr=udp%3a%2f%2f89.234.156.205%3a80%2fannounce&tr=udp%3a%2f%2f9.rarbg.com%3a2710%2fannounce&tr=udp%3a%2f%2f9.rarbg.me%3a2780%2fannounce&tr=udp%3a%2f%2f9.rarbg.to%3a2730%2fannounce&tr=udp%3a%2f%2f91.218.230.81%3a6969%2fannounce&tr=udp%3a%2f%2f94.23.183.33%3a6969%2fannounce&tr=udp%3a%2f%2fbt.xxx-tracker.com%3a2710%2fannounce&tr=udp%3a%2f%2feddie4.nl%3a6969%2fannounce&tr=udp%3a%2f%2fexplodie.org%3a6969%2fannounce&tr=udp%3a%2f%2fmgtracker.org%3a2710%2fannounce&tr=udp%3a%2f%2fp4p.arenabg.com%3a1337%2fannounce&tr=udp%3a%2f%2fshadowshq.eddie4.nl%3a6969%2fannounce&tr=udp%3a%2f%2fshadowshq.yi.org%3a6969%2fannounce&tr=udp%3a%2f%2ftorrent.gresille.org%3a80%2fannounce&tr=udp%3a%2f%2ftracker.aletorrenty.pl%3a2710%2fannounce&tr=udp%3a%2f%2ftracker.bittor.pw%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.coppersurfer.tk%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.eddie4.nl%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.ex.ua%3a80%2fannounce&tr=udp%3a%2f%2ftracker.filetracker.pl%3a8089%2fannounce&tr=udp%3a%2f%2ftracker.flashtorrents.org%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.grepler.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.ilibr.org%3a80%2fannounce&tr=udp%3a%2f%2ftracker.internetwarriors.net%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.kicks-ass.net%3a80%2fannounce&tr=udp%3a%2f%2ftracker.kuroy.me%3a5944%2fannounce&tr=udp%3a%2f%2ftracker.leechers-paradise.org%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.mg64.net%3a2710%2fannounce&tr=udp%3a%2f%2ftracker.mg64.net%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.opentrackr.org%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.piratepublic.com%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.sktorrent.net%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.skyts.net%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.yoshi210.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker2.indowebster.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker4.piratux.com%3a6969%2fannounce&tr=udp%3a%2f%2fzer0day.ch%3a1337%2fannounce&tr=udp%3a%2f%2fzer0day.to%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.cyberia.is%3a6969%2fannounce&tr=http%3a%2f%2fvps02.net.orel.ru%3a80%2fannounce&tr=https%3a%2f%2ftracker.nanoha.org%3a443%2fannounce&tr=http%3a%2f%2ftracker.files.fm%3a6969%2fannounce&tr=https%3a%2f%2ftracker.nitrix.me%3a443%2fannounce&tr=https%3a%2f%2ftracker.tamersunion.org%3a443%2fannounce&tr=udp%3a%2f%2faaa.army%3a8866%2fannounce&tr=https%3a%2f%2ftracker.imgoingto.icu%3a443%2fannounce&tr=udp%3a%2f%2fblokas.io%3a6969%2fannounce&tr=udp%3a%2f%2fdiscord.heihachi.pw%3a6969%2fannounce&tr=udp%3a%2f%2ffe.dealclub.de%3a6969%2fannounce&tr=udp%3a%2f%2fln.mtahost.co%3a6969%2fannounce&tr=udp%3a%2f%2fvibe.community%3a6969%2fannounce&tr=udp%3a%2f%2ftracker0.ufibox.com%3a6969%2fannounce&tr=udp%3a%2f%2fmail.realliferpg.de%3a6969%2fannounce&tr=udp%3a%2f%2fmovies.zsw.ca%3a6969%2fannounce&tr=udp%3a%2f%2fnagios.tks.sumy.ua%3a80%2fannounce&tr=udp%3a%2f%2f47.ip-51-68-199.eu%3a6969%2fannounce&tr=udp%3a%2f%2fcdn-1.gamecoast.org%3a6969%2fannounce&tr=udp%3a%2f%2faruacfilmes.com.br%3a6969%2fannounce&tr=udp%3a%2f%2fedu.uifr.ru%3a6969%2fannounce&tr=http%3a%2f%2frt.tace.ru%3a80%2fannounce&tr=udp%3a%2f%2fcode2chicken.nl%3a6969%2fannounce&tr=udp%3a%2f%2fus-tracker.publictracker.xyz%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.0x.tf%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.altrosky.nl%3a6969%2fannounce&tr=udp%3a%2f%2ftorrentclub.online%3a54123%2fannounce&tr=http%3a%2f%2f5rt.tace.ru%3a60889%2fannounce&tr=udp%3a%2f%2fapp.icon256.com%3a8000%2fannounce&tr=udp%3a%2f%2ftracker.sigterm.xyz%3a6969%2fannounce&tr=http%3a%2f%2ftracker.loadbt.com%3a6969%2fannounce&tr=http%3a%2f%2fipv4announce.sktorrent.eu%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.openbittorrent.com%3a80%2fannounce&tr=udp%3a%2f%2fwww.torrent.eu.org%3a451%2fannounce&tr=udp%3a%2f%2ftracker.dler.org%3a6969%2fannounce&tr=udp%3a%2f%2fexodus.desync.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker2.dler.org%3a80%2fannounce&tr=udp%3a%2f%2ftracker.shkinev.me%3a6969%2fannounce&tr=udp%3a%2f%2fstorage.groupees.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.v6speed.org%3a6969%2fannounce&tr=udp%3a%2f%2fdaveking.com%3a6969%2fannounce&tr=https%3a%2f%2ftracker.lilithraws.cf%3a443%2fannounce&tr=udp%3a%2f%2ftracker1.bt.moack.co.kr%3a80%2fannounce&tr=udp%3a%2f%2f3rt.tace.ru%3a60889%2fannounce&tr=udp%3a%2f%2fjohnrosen1.com%3a6969%2fannounce&tr=udp%3a%2f%2fretracker.lanta-net.ru%3a2710%2fannounce&tr=udp%3a%2f%2fopentor.org%3a2710%2fannounce&tr=udp%3a%2f%2ft2.leech.ie%3a1337%2fannounce&tr=https%3a%2f%2ftracker.foreverpirates.co%3a443%2fannounce&tr=http%3a%2f%2ftracker.vraphim.com%3a6969%2fannounce&tr=udp%3a%2f%2fopen.stealth.si%3a80%2fannounce&tr=udp%3a%2f%2ftracker.uw0.xyz%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.army%3a6969%2fannounce&tr=udp%3a%2f%2fmts.tvbit.co%3a6969%2fannounce&tr=https%3a%2f%2ftracker.coalition.space%3a443%2fannounce&tr=http%3a%2f%2ftracker-cdn.moeking.me%3a2095%2fannounce&tr=udp%3a%2f%2fline-net.ru%3a6969%2fannounce&tr=udp%3a%2f%2fperu.subventas.com%3a53%2fannounce&tr=udp%3a%2f%2fbt1.archive.org%3a6969%2fannounce&tr=udp%3a%2f%2fengplus.ru%3a6969%2fannounce&tr=udp%3a%2f%2fvalakas.rollo.dnsabr.com%3a2710%2fannounce&tr=udp%3a%2f%2fbt2.archive.org%3a6969%2fannounce&tr=udp%3a%2f%2fipv4.tracker.harry.lu%3a80%2fannounce&tr=udp%3a%2f%2ft1.leech.ie%3a1337%2fannounce&tr=http%3a%2f%2fbt.okmp3.ru%3a2710%2fannounce&tr=http%3a%2f%2fcloud.nyap2p.com%3a8080%2fannounce&tr=http%3a%2f%2ft.overflow.biz%3a6969%2fannounce&tr=udp%3a%2f%2ft3.leech.ie%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.tiny-vps.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker.bt4g.com%3a2095%2fannounce&tr=http%3a%2f%2ft.nyaatracker.com%3a80%2fannounce&tr=udp%3a%2f%2fudp-tracker.shittyurl.org%3a6969%2fannounce&tr=https%3a%2f%2f1337.abcvg.info%3a443%2fannounce&tr=https%3a%2f%2fw.wwwww.wtf%3a443%2fannounce&tr=udp%3a%2f%2fbt2.3kb.xyz%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.ds.is%3a6969%2fannounce&tr=udp%3a%2f%2fopentracker.i2p.rocks%3a6969%2fannounce&tr=udp%3a%2f%2fcdn-2.gamecoast.org%3a6969%2fannounce&tr=udp%3a%2f%2fretracker.netbynet.ru%3a2710%2fannounce&tr=udp%3a%2f%2fteamspeak.value-wolf.org%3a6969%2fannounce&tr=udp%3a%2f%2fcutiegirl.ru%3a6969%2fannounce&tr=http%3a%2f%2fh4.trakx.nibba.trade%3a80%2fannounce\nHash (for verification of authenticity etc):\nc8fc9979cc35f7062cd8715aaaff4da475d2fadc\nSize:\n1,013.12GiB",
    "comments": [
        {
            "author": "macx333",
            "score": "1",
            "content": "After careful consideration, we are leaving this post up. Yesterday's events were truly insane on many levels, but we are not a political sub. Some may DH for political reasons, and some for sociological reasons. Whatever your reason, we ask everyone to keep it about datahoarding/archiving in here. If you hoarded data, the fbi may be interested in what you have: https://www.reddit.com/r/DataHoarder/comments/ksfel0/did_you_hoard_social_media_yesterday/ Go take politics to r/politics, whatever left/right/center sub, or parler, whichever is your thing. If people could stop reporting comments and posts that they simply disagree with, that would be very much appreciated.",
            "replies": []
        },
        {
            "author": "LFS2y6eSkmsbSX",
            "score": "920",
            "content": "Just now p (6:15 ET) pulled all the twitter links from here and deduped them into something friendly for youtube-dl EDIT Thursday 1/7 @ 9:30AM ET: For anyone look at this dig into the thread, there are a variety of torrent and server links with, presumably, much much more. I'm currently using this magnet link [0] which has 50 peers and is 12.4GB. [0] magnet:?xt=urn:btih:c91aa813f2ad2d982e0d760bfce62deefc9d9b5d&dn=Trump%20protest%20Jan%2006%202021&tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&tr=udp%3A%2F%2Ftracker.opentrackr.org%3A1337 https://twitter.com/bubbaprog/status/1346920198461419520?s=20 https://twitter.com/igorbobic/status/1346911809274478594 https://twitter.com/jihanbit/status/1346909463660396550?s=20 https://mobile.twitter.com/moonddng/status/1346924307692318723 https://twitter.com/misstessowen/status/1346921232655024130?s=20 https://twitter.com/ShaneGoldmacher/status/1346920474652114953?s=20 https://twitter.com/GriffinMalone6/status/1346894635398885376?s=20 https://twitter.com/davenewworld_2/status/1346917023926857736?s=20 https://twitter.com/igorbobic/status/1346911809274478594?s=20 https://twitter.com/BGOnTheScene/status/1346913462090285058?s=20 https://twitter.com/RationalDis/status/1346908229524217860?s=20 https://twitter.com/bresreports/status/1346906836805578755?s=20 https://twitter.com/AndrewFeinberg/status/1346899955097726985?s=20 https://twitter.com/cevansavenger/status/1346920924310867968?s=20 https://twitter.com/StatusCoup/status/1346883907430584322?s=20 https://twitter.com/StatusCoup/status/1346888458921533445?s=20 https://twitter.com/StatusCoup/status/1346889183101640704?s=20 https://twitter.com/benjancewicz/status/1346942411738648576?s=20 https://twitter.com/SCaterinicchio/status/1346925231848509447?s=20 https://twitter.com/GoblinLazer/status/1346923857102385153?s=20 https://twitter.com/michaelsolakiew/status/1346553643517030401?s=20 https://twitter.com/ellievhall/status/1346944103074979843 https://twitter.com/WilliamTurton/status/1346940440935870472 https://twitter.com/KirkWrites79/status/1346936420997292038 https://twitter.com/WhatsTrending/status/1346937663262113799?s=20 https://twitter.com/WhatsTrending/status/1346934524853186560 https://twitter.com/MikeCarterTV/status/1346938605948850176 https://twitter.com/MikeCarterTV/media https://mobile.twitter.com/TaylerUSA/status/1346913859102253056 https://twitter.com/marcusdipaola/status/1346930471528243200 https://twitter.com/poetic_women/status/1346926054779346949 https://twitter.com/VeritasSola/status/1346887833613697026 https://twitter.com/LACaldwellDC/status/1346930771575992321 https://twitter.com/LACaldwellDC/status/1346896530729545732 https://twitter.com/AriCohn/status/1346920070937776132 https://web.archive.org/web/20210106200924/https://twitter.com/ElijahSchaffer/status /1346905425543917573?s=19 https://twitter.com/pdmcleod/status/1346940888761688064 https://twitter.com/Journo_Christal/status/1346945835368501249?s=19 https://twitter.com/JLeeQuinn/status/1346937855801663489?s=20 https://twitter.com/JLeeQuinn/status/1346933494119755776?s=20 https://twitter.com/JLeeQuinn/status/1346931482221305858?s=20 https://twitter.com/JLeeQuinn/status/1346930698645602312?s=20 https://twitter.com/JLeeQuinn/status/1346928974144933888?s=20 https://twitter.com/JLeeQuinn/status/1346945128145903617?s=20 https://twitter.com/DulwichUltra/status/1346944165846929409?s=20 https://twitter.com/Amy%5C_Siskind/status/1346942418784960514?s=20 https://twitter.com/BGOnTheScene/status/1346904244008456193 https://twitter.com/Rebexem/status/1346924689101213696 https://twitter.com/elijahschaffer/status/1346901420147167232?s=21 https://twitter.com/bgonthescene/status/1346916083752710150?s=21 https://twitter.com/bgonthescene/status/1346899257694019585?s=21 https://twitter.com/cevansavenger/status/1346920924310867968 https://twitter.com/thehermitcoffee/status/1346927257437171713?s=20 https://twitter.com/youranoncentral/status/1346941191015727106?s=21 https://twitter.com/samwineburg/status/1346934956203810816?s=20 https://twitter.com/SSchrock2461/status/1346927123840327681?s=20 https://twitter.com/TheTNHoller/status/1346920538191654912 https://twitter.com/NickKnudsenUS/status/1346940597123248128?s=19 https://twitter.com/mattlaslo/status/1346898208312713223?s=21 https://twitter.com/marcusdipaola/status/1346908702108839938?s=20 https://twitter.com/samwineburg/status/1346934956203810816 https://twitter.com/queertyyr/status/1346915269470466049 https://twitter.com/i/status/1346928882595885058 https://twitter.com/i/status/1346881968819105792 https://twitter.com/i/status/1346888087348129795 https://twitter.com/i/status/1346898208312713223 https://twitter.com/i/status/1346906345895768072 https://twitter.com/i/status/1346911760754692104 https://twitter.com/ellievhall/status/1346940576533536773?s=21 https://twitter.com/pdmcleod/status/1346942367543091200?s=20 https://twitter.com/KenDuffyNews/status/1346939132946378758?s=19 https://twitter.com/MichaelCoudrey/status/1346908159827390470 https://twitter.com/poetic_women/status/1346926054779346949?s=20 https://twitter.com/georgegray98/status/1346926467616272391?s=20 https://twitter.com/WilliamTurton/status/1346940440935870472?s=19 https://twitter.com/NiagaraPat/status/1346943473610616833 https://twitter.com/EgSophie/status/1346924912687149058?s=19 https://twitter.com/kr3at/status/1346942950933229568 https://twitter.com/KwikWarren/status/1346923866342514688?s=20 https://twitter.com/Dadlife85/status/1346927689219723266?s=20 https://twitter.com/shomaristone/status/1346941715895250949?s=20 https://twitter.com/Locksneedfartin/status/1346923798080139265?s=20 https://twitter.com/Julio_Rosas11/status/1346939312647118849 https://twitter.com/ellievhall/status/1346940576533536773 https://twitter.com/WilliamTurton/status/1346942080220864513 https://twitter.com/AltWASONPS/status/1346935569302085633 https://twitter.com/AltWASONPS/status/1346942903424323588 https://twitter.com/AltWASONPS/status/1346943046626119680 https://twitter.com/KevOnStage/status/1346937897060945920 https://twitter.com/ByJohnLMicek/status/1346933137989885956 https://twitter.com/LouiseMensch/status/1346931882135576579 https://twitter.com/mitchellscomet/status/1346923199255162883 https://twitter.com/DrEricDing/status/1346944475478814720?s=19 https://twitter.com/niftyishh/status/1346925048678862848 https://twitter.com/altwasonps/status/1346935569302085633?s=21 https://twitter.com/osinttechnical/status/1346947691411083266?s=21 https://twitter.com/AsylumRow/status/1346948049931804675?s=20 https://twitter.com/CharCubed/status/1346943237882314752?s=20 https://twitter.com/shomaristone/status/1346941715895250949 https://twitter.com/MysterySolvent/status/1346948784484278273?s=20 https://twitter.com/thebrentwolff/status/1346940122638340096?s=21 https://twitter.com/bradmossesq/status/1346948604737572869?s=21 https://twitter.com/currydagger/status/1346941070299586565?s=21 https://twitter.com/whack_a_commie/status/1346930868623990792?s=19 https://twitter.com/BGOnTheScene/status/1346904244008456193?s=09 https://twitter.com/BGOnTheScene/status/1346916083752710150?s=09 https://twitter.com/BGOnTheScene/status/1346926043584749571?s=09 https://twitter.com/BGOnTheScene/status/1346931119363665923?s=09 https://twitter.com/therecount/status/1346948187052003329?s=21 https://twitter.com/cevansavenger/status/1346920924310867968?s=21 https://twitter.com/BkwHookem/status/1346949897640005632?s=09 https://twitter.com/feinconfections/status/1346940279769612295 https://twitter.com/AprilDRyan/status/1346922912117383170?s=20 https://twitter.com/KevOnStage/status/1346937897060945920?s=20 https://twitter.com/kevrector/status/1346921054527053829 https://twitter.com/TaylorProudBoy/status/1346934718282006528?s=20 https://twitter.com/SLevelt/status/1346940015734099971 https://twitter.com/kirkwrites79/status/1346936420997292038?s=21 https://twitter.com/kevonstage/status/1346937897060945920?s=21 https://twitter.com/DrEricDing/status/1346944475478814720 https://twitter.com/bxbyleyy_/status/1346926137402912778",
            "replies": [
                {
                    "author": "AdamLynch",
                    "score": "458",
                    "content": "Now you're the GOAT.",
                    "replies": [
                        {
                            "author": "hairyforehead",
                            "score": "216",
                            "content": "The FBI is accepting tips and digital media depicting rioting and violence in the U.S. Capitol Building and surrounding area in Washington, DC, on January 6, 2021. If you have witnessed unlawful violent actions, we urge you to submit any information, photos, or videos that could be relevant at fbi.gov/USCapitol Please use this form to submit any images, videos, or other multimedia files you have related to possible violations of federal law committed. Our goal is to preserve the public’s constitutional right to protest by protecting everyone from violence and other criminal activity.",
                            "replies": [
                                {
                                    "author": "blackfogg",
                                    "score": "176",
                                    "content": "Dude, the FBI has been all over this thread for hours, 100% We are basically doing their job. And if it's not to catch those guys, it's to make sure that Reddit doesn't go rouge as detective again lol",
                                    "replies": []
                                },
                                {
                                    "author": "Plumhawk",
                                    "score": "39",
                                    "content": "The FBI is accepting tips I've never tipped the FBI before. What's standard? 15%? 20% if service is good?",
                                    "replies": []
                                },
                                {
                                    "author": "Centralredditfan",
                                    "score": "15",
                                    "content": "Please upload this to the FBI as well: https://twitter.com/MrTAchilles/status/1346996921282531328 I'm currently overseas, so I don't know if they accept submissions.",
                                    "replies": []
                                },
                                {
                                    "author": "[deleted]",
                                    "score": "8",
                                    "content": "I’m uploading to FBI now, for good measure. They only take four files per submission limited to 1024MB. Taking a while...",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Abject_Objective6139",
                            "score": "7",
                            "content": "Hi Adam, you’re amazing. Thank you for doing this. I don’t know if you’ve seen the FBI’s post so I’m sharing here (taken from the BBC news website) The FBI has put out an appeal seeking help in \"identifying individuals who are actively instigating violence in Washington DC\". It is asking for \"tips and digital media\" relating to the violence that broke out at the US Capitol building and the surrounding area on Wednesday. Members of the public who \"witnessed unlawful violent actions\" are urged to submit information to fbi.gov/USCapitol or call 1-800-CALL-FBI (1-‪800-225-5324).",
                            "replies": []
                        },
                        {
                            "author": "zegzo",
                            "score": "2",
                            "content": "Hiw do u setup 100tb offline? Is it a computer not hooked up to internet? How is it different than having external storage? Ty!",
                            "replies": []
                        },
                        {
                            "author": "GloriousDawn",
                            "score": "2",
                            "content": "Thank you for coordinating the archival effort around these events. Just wanted to inform you that i launched the download about 10 hrs ago and just found out it failed because MEGA deleted the files. This is the warning message i got (rough translation): This folder or file has been reported for objectionable content like child exploitation, violent extremism or bestiality. The account has been terminated and full information including owner's IP have been forwarded to authorities. I'll be downloading from another source you added in the meantime but i thought you should know.",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "theholyraptor",
            "score": "282",
            "content": "OP, leave the torrent up and just stop sharing it on your end. That way we can all keep seeding it and sharing it with new people without destroying your bandwidth. Edit: assuming some others have already gotten full downloads of it. It seems the IntelligenceX ftp server got trolled and filled with tons of nsfl content. Edit 7: u/RedBlaze4 made a torrent with the IntelligenceX ftp Removed the magnet link. https://twitter.com/_IntelligenceX/status/1346967229187952644?s=20 as of 08/01/2021 00:00 UTC Edit 6: u/firstgrow is hosting direct downloads as well Edit 5: u/nuzzles_u_uwu Is hosting as well Edit 4: u/tweedge made a direct download link on s3 Edit 3: u/kenkoda posted a torrent. Edit 2: u/Deifer got one up. Link",
            "replies": []
        },
        {
            "author": "sourbureaucrat",
            "score": "138",
            "content": "You guys are like the Ham Radio operators! Gearing up in times of crisis.",
            "replies": []
        },
        {
            "author": "Occams_Razor42",
            "score": "644",
            "content": "https://twitter.com/bubbaprog/status/1346920198461419520?s=20 Cops taking selfies with rioters? Better save it",
            "replies": [
                {
                    "author": "yetrident",
                    "score": "232",
                    "content": "Chasing a cop: https://twitter.com/igorbobic/status/1346911809274478594",
                    "replies": []
                }
            ]
        },
        {
            "author": "randofando2727",
            "score": "514",
            "content": "Video of Cops just letting the protesters through the barricades at the beginning of the storming: https://twitter.com/jihanbit/status/1346909463660396550?s=20",
            "replies": []
        },
        {
            "author": "Firstgrow",
            "score": "45",
            "content": "I hosted this on my personal server(1gbps) to make it easier. http://expired.domain/ I will leave it up for atleast 72 hours depending on the traffic. Edit- 14.2TB. The traffic is way down down and it has been three days. Do the math- I sent that 12gb pack to 1183 separate people. I got my monies worth this month. For those curious, it was hosted on a 2011 macmini from my home 1gbps connection. It has been taken down to make access to my emby server. Shameless plug- if you would like to buy me a beer BTC- 3N27dmi3NSVkwCPxy7ia9qm7zwgAR1EL8R Thanks u/b0nk3r00 for the gold!",
            "replies": []
        },
        {
            "author": "Occams_Razor42",
            "score": "87",
            "content": "People breaking down windows of capitol building https://twitter.com/SCaterinicchio/status/1346925231848509447?s=20",
            "replies": []
        }
    ]
},
{
    "post_author": "DotRom",
    "post_id": "1dslgbh",
    "post_score": "68",
    "post_time": "Monday, July 1, 2024 at 8:41:33 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "How to get over data lost",
    "media": [],
    "post_content": "Not the usual guy on this page, been away from gaming for quite some time only to know Xbox deleted all the game DVR clips I had on my account recently.\nAlthough I don't watch them often I do remember a few clips have treasured memory.\nI feel bit of light headed and anger that I didn't get to backup my vids in time. How do you guys get over losses like this.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "Important_Mention737",
            "score": "47",
            "content": "I’d say just give it time, it’s gone now and nothing you can do. It’s a shitty feeling. I was barely able to save all my clips the exact day they were planning on doing the deletion. I understand why they would delete all the data but it’s still annoying and frustrating having to transfer it all or just have people lose it all like you did. Sorry man",
            "replies": [
                {
                    "author": "DotRom",
                    "score": "16",
                    "content": "The pain still fresh to me, I have a few saved here and there but never the full catalogue. I was look to watch a few clips today and to discovered they have removed all of them. I feel pretty upset over it. I can't believe the pain so intense, I taken some panadol and lied down atm. 😭",
                    "replies": []
                },
                {
                    "author": "thinvanilla",
                    "score": "3",
                    "content": "What was the deletion? I thought Xbox recordings/screen captures automatically upload to OneDrive?",
                    "replies": [
                        {
                            "author": "Important_Mention737",
                            "score": "5",
                            "content": "No you had to upload them to OneDrive yourself",
                            "replies": []
                        },
                        {
                            "author": "DotRom",
                            "score": "1",
                            "content": "",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "KuraDKuruta",
                    "score": "1",
                    "content": "",
                    "replies": []
                }
            ]
        },
        {
            "author": "Vast-Program7060",
            "score": "45",
            "content": "This type of event makes you become a datahoarder. Welcome to the sub/family. Sorry about your loss.",
            "replies": []
        },
        {
            "author": "DavWanna",
            "score": "51",
            "content": "How do you guys get over losses like this. *loss After the first time you make sure it won't happen again.",
            "replies": []
        },
        {
            "author": "send_fooodz",
            "score": "13",
            "content": "I lost 5 years of photos from when I first moved out and really tried to make it as an adult as myself. Some of the most memorable years (good and bad). Hard drives crashed after my roommate borrowed my monitor and something must have surged. I actually still have the hard drive in case technology advances where I could get it restored for cheap!",
            "replies": []
        },
        {
            "author": "Irverter",
            "score": "9",
            "content": "Lie down. Cry a lot. Start hoarding again. Make backups of everything.",
            "replies": []
        },
        {
            "author": "PurpleQuoll",
            "score": "6",
            "content": "Frustration for a bit and then I just let it wash over me. The past is the past, I have walked over that bridge and blown it up, sunglasses on with a small explosion behind me. Nothing can be done now, so keep trudging forwards.",
            "replies": []
        },
        {
            "author": "ObjectiveVolume8161",
            "score": "6",
            "content": "You get over it by being smart and having backups",
            "replies": []
        },
        {
            "author": "downsouth316",
            "score": "5",
            "content": "It’s hard. You mentally have to block out then improve your data hoarding skills so nothing like that ever happens again.",
            "replies": []
        }
    ]
},
{
    "post_author": "Supremeboye",
    "post_id": "1dtway1",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 11:47:47 PM GMT+3",
    "flair_text": "Hoarder-Setups",
    "post_title": "which  HHD  has the longest lifespan? ",
    "media": [],
    "post_content": "I know 4TB, 8tb and 16tb are most reliable. is there bigger size that tested to have similar reliability? thanks",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "plexguy",
            "score": "2",
            "content": "The most problematic ones I ever had were 3TB Seagates. I assume you are looking at enterprise grade drives over consumer grade drives. That said I have found the Seagates and WD to all be so close that you can buy on price. Backblaze is a good source but isn\"t the final word as it isn't totally scientific. Not saying it is bad or flawed just that there are variables to consider when looking at the numbers. But fortunately now there aren't lemon drives and warranties are good and companies are stable enough to know they will be around should you need it. Prices are historically good also. I have mostly 14 and 16 TB drives as they tend to be the most cost effective with backup time not being terrible. I haven't seen any real issue with shorter life with higher capacity. Also was concerned with the helium drives leaking or becoming an issue as they aged but so far that hasn't happened.",
            "replies": []
        },
        {
            "author": "Hopeful-Candidate890",
            "score": "3",
            "content": "Backblaze is what everyone looks to https://www.backblaze.com/cloud-storage/resources/hard-drive-test-data",
            "replies": [
                {
                    "author": "stormcomponents",
                    "score": "1",
                    "content": "Beat me to it.",
                    "replies": []
                },
                {
                    "author": "Far_Marsupial6303",
                    "score": "1",
                    "content": "Not everyone. Others and I recognize it's limited statistical data for limited drive models in their custom pods, in their custom racks, running in their optimized environment, monitored by their custom software and considered failed according to the specific parameters. Bottom line, nothing like most home consumers setups and usage.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Far_Marsupial6303",
            "score": "1",
            "content": "That was probably the infamous ST3000DM001, long discontinued. It was the last truly bad drive over a decade ago. You're correct that there's no truly good, better, best drives today!",
            "replies": []
        }
    ]
},
{
    "post_author": "bigcowboymeatstick69",
    "post_id": "1ds4vdj",
    "post_score": "18",
    "post_time": "Sunday, June 30, 2024 at 7:05:39 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Mp3tag-like app for non-mpeg videos?",
    "media": [],
    "post_content": "Mp3tag works great for mpeg file formats, but I have a ton of videos in .avi format. Anyone know an app that does automatic tag and filename editing like mp3tag? TIA!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "sturmen",
            "score": "13",
            "content": "I’d suggest looking into whether the AVI container even accommodates the sort of metadata that MPEG formats do. It might simply not be part of the AVI specification. If you’re concerned about tagging, I’d suggest remuxing them to Matroska and tagging those with MKVToolNix.",
            "replies": []
        },
        {
            "author": "AcornWhat",
            "score": "6",
            "content": "Looks like a no-go with AVI. it's an old and basic format whose limitations are largely why newer formats have so many options for metadata and multiple streams.",
            "replies": []
        },
        {
            "author": "bmaasth",
            "score": "4",
            "content": "Here's FFMPEG's list of metadata keys for the AVI container, which compared to MP4's is rather paltry. That said, after a little looking around it seems that a lot of places recommend AVI Meta Edit. It's a personal preference, but I've been migrating all of mine to MP4 and then can add/edit the metadata at will. This does, however, open a whole new can of worms (e.g.: codec, time to convert, and in my case, heat output from running the CPU at full bore for hours on end.) TLDR: An answer (AVI Media Edit) and a lot more to ponder.",
            "replies": []
        },
        {
            "author": "GreenAndBlueG",
            "score": "4",
            "content": "As some users already said, AVI is pretty old and pretty basic. I'd personally recommend remuxing those files into Matroska files which in your case they should have the .mkv extension. Then you can use something like MKVToolNix (specifically mkvpropedit or the built-in GUI wrapper) to edit the metadata For remuxing (copying the audio and video streams without reencoding them) you can use an FFmpeg command like this ffmpeg -i input.avi -c copy output.mkv (Yours may need to be tweaked a little) Also, I believe but don't quote on that MKVToolNix's mkvmerge (or, again, the GUI wrapper) can read non-Matroska files as well You could also use FFmpeg's -metadata option if you wanted to. You can set arbitrary fields but try to use a supported one if possible Edit: typo",
            "replies": []
        },
        {
            "author": "FFM",
            "score": "1",
            "content": "this worked for me when AVI was a thing, abandonware as mp4 is a much more suited container for video/audio/metadata https://www.videohelp.com/software/abcAVI-Tag-Editor",
            "replies": []
        }
    ]
},
{
    "post_author": "Pasta-hobo",
    "post_id": "1dt9lyz",
    "post_score": "146",
    "post_time": "Tuesday, July 2, 2024 at 4:17:41 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Free/open software I should keep emergency copies of?",
    "media": [],
    "post_content": "I'm making bug-out kits that include personal data archives. What's some software that's good to have backup installations of in the event that we lose access to the open Internet?\nI mean things like VLC, Linux installers, program editors, stuff like that.\nThis is a small, highly portable archive, so let's try keep it under 128 GB.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "marshogas",
            "score": "87",
            "content": "Look at your file extensions. Make a list. Something open source to open pdf, xls, doc, mp3, mp4, ..., and similar files. Maybe one program and a backup program. Lots of choice on some of them and limited choices on others. Edit: As some have suggested, adding that you should think about programs to read files and programs to edit files.",
            "replies": [
                {
                    "author": "Ruben_NL",
                    "score": "38",
                    "content": "Libre Office+VLC can handle all of those, if you want to keep the program count low.",
                    "replies": [
                        {
                            "author": "coverin0",
                            "score": "48",
                            "content": "I would also add 7-zip in there. I never realize how many compressed files I use/open until I have a new Windows install. Edit: zip utility comes pre-installed in Linux, so...",
                            "replies": [
                                {
                                    "author": "migm16",
                                    "score": "-17",
                                    "content": "",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "techno156",
                            "score": "14",
                            "content": "ffmpeg is probably a good idea too, either for the ones that won't, if you ever want to make changes in future, like add subtitles, or transcode a copy if they can't handle the format for whatever reason.",
                            "replies": []
                        },
                        {
                            "author": "paulct91",
                            "score": "2",
                            "content": "",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BlossomingPsyche",
            "score": "33",
            "content": "A collection of 'how to' ebooks would be really good for this project, how to build/work on houses, do general plumbing, electrician manuals, etc... If the world ends knowing how to do all that stuff, or at least being able to teach yourself, would be a huge boon.",
            "replies": []
        },
        {
            "author": "JamesRitchey",
            "score": "90",
            "content": "I would say probably all 21 DVD ISOs of Debian stable, so that you would have an operating system, and a wide selection of packages to meet many of your current, and future needs. 21x4.7~=98.7~",
            "replies": [
                {
                    "author": "TheLastValentine",
                    "score": "17",
                    "content": "Can you explain for stupid people like me what this of what you are talking is? Sorry my curiosity just defeats me.",
                    "replies": []
                },
                {
                    "author": "SMF67",
                    "score": "36",
                    "content": "This is *the\" answer. You'll get a full software distribution that will actually run (unlike saving random binaries or source and hoping it works on whatever OS you have in the future). And if 21 DVDs take up too much space, you could probably just limit to the first few DVDs and be good. The packages are sorted by popularity and the most popular/important ones are on the first disks. See https://cdimage.debian.org/debian-cd/current/amd64/list-dvd/ Edit: of course, you don't actually have to put it on actual DVDs",
                    "replies": []
                }
            ]
        },
        {
            "author": "hlloyge",
            "score": "42",
            "content": "https://portableapps.com/ You're welcome. Choose what you want. I keep a lot of portable apps in my TOOLS folder, there's something for everyone.",
            "replies": []
        },
        {
            "author": "Tenferenzu",
            "score": "15",
            "content": "Wikitaxi is small (~30 MB) and can read Wikipedia dumps straight from Wikipedia. A copy of Wikipedia with just text is around 16-20GB and extremely helpful if you ever are without internet for a long time.",
            "replies": []
        },
        {
            "author": "Wixely",
            "score": "13",
            "content": "http://collapseos.org/",
            "replies": []
        }
    ]
},
{
    "post_author": "Hayrianil",
    "post_id": "1dtvzn9",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 11:34:02 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Need a hard drive recommendation 10TB or more.",
    "media": [],
    "post_content": "Hi, I am a photographer/videographer. I do not like to delete footage. So, I need a way to store them and edit from the same hard drive. Currently using the WD Elements 6TB but it's almost full. Speed of this drive is enough for me, I never had issues regarding performance. I was thinking to get another WD Elements 16TB but, the thing is I dont' like to have my big hard drives on the table where I might bump into it while it's on. Also, these drives needs an ac adapter to work, if I get a 3rd or 4th one I would literally need a dedicated power cable for those. I know that the best option for me to get a NAS System but I don't have the budget for that right now. So I need an alternative, a hard drive that is 10TB or more, to put inside of my desktop computer that I can edit/store videos.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "binaryriot",
            "score": "3",
            "content": "Well… get an internal disk then? I recommend Ultrastar HGST/WD ones, e.g. \"DC HC 550\". Also I would recommend you do have some basic backup concept too. Just stuffing all your data on a single large drive easily leads to catastrophic data loss. So get at least 2 drives. One for the primary copy, and one for the backup. E.g. you can get one internal one for the \"hot\" storage and one external one for the \"cold\" storage mirror. This is not ideal (look up the 3-2-1 concept for that), but if you're on a budget that's better than nothing.",
            "replies": [
                {
                    "author": "Hayrianil",
                    "score": "1",
                    "content": "Thank you. I am looking at the ultrastars right now. I have a question, I never used NAS so I don't know what kind of drives I need for it. Let's say that I got couple Ultrastars, can I use them in a NAS when I get one?",
                    "replies": []
                }
            ]
        },
        {
            "author": "Far_Marsupial6303",
            "score": "1",
            "content": "All 3.5\" drives require the additional 12V power supply. 2.5\" HDD externals can run off USB 3.0+ only, but they max out at 6TB, currently only available from WD and are premium priced over the 5TB. Instead of a NAS, you can get a multi drive DAS (Direct Attached Storage) enclosure. The 4 bay Mediasonic Probox USB 3.0 is ~$100 USD. More outside the U.S., where it may be sold under the Fantom name.",
            "replies": []
        },
        {
            "author": "CircuitDaemon",
            "score": "1",
            "content": "What you're trying to do is a recipe for disaster and a terrible practice. I get that your budget might not be there yet but I doubt you need all those files available all the time. You either get smaller drives that you can afford and keep the older stuff stored somewhere where you won't bump into it or just save for a NAS. You need to understand that in order to pursue your profession, you need the right tools as well. What you do isn't exactly something that can be later replicated if lost. You can't imagine the amount of photographers/videographers I've had to deal with that lost somebody's wedding or other important event because they didn't want to buy the right storage for their needs. You're not only risking your business but also risking the memories of your customers.",
            "replies": [
                {
                    "author": "Hayrianil",
                    "score": "1",
                    "content": "Thanks for the suggestions. I totally agree with you. I didn't specify but I was asking for my personal stuff at my house. I have a totally separate storage for my customers at my office.",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "diamondsw",
    "post_id": "r35v29",
    "post_score": "4016",
    "post_time": "Saturday, November 27, 2021 at 8:01:15 AM GMT+3",
    "flair_text": "Free-Post Friday!",
    "post_title": "Kids, you up?",
    "media": [
        "https://preview.redd.it/hwxxuor4kw181.png?width=640&crop=smart&auto=webp&s=ab8e06252d67caa7b5d0b347c0d418ec643e477f",
        "https://i.redd.it/hwxxuor4kw181.png"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "dingo596",
            "score": "65",
            "content": "Bold of you to assume I have the money for off site backups, if I could get double the storage I wouldn't be using if for backup. And that I have an Internet connection that would allow me to off site my data before the end of the year.",
            "replies": [
                {
                    "author": "diamondsw",
                    "score": "19",
                    "content": "I feel your pain! But I've felt the pain of dataloss as well. You just do what you can; at least have local backups, and test them from time-to-time.",
                    "replies": []
                },
                {
                    "author": "Sabinn037",
                    "score": "11",
                    "content": "AWS Glacier. Literal pennies. The downside is it could take a week from submitting your request to retrieve your data, to AWS queuing it up for you to restore from. Still, for my home nas it's totally worth it. I should state I'm only backing up my memories (pic and clips).",
                    "replies": [
                        {
                            "author": "Elegant-Remote6667",
                            "score": "7",
                            "content": "Isn’t the restore fee a fortune?",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Elegant-Remote6667",
                    "score": "6",
                    "content": "Um - compression works wonders. Zstd and lzma compress my files by 10 fold sometimes 20 fold. If you have a lot of image files it will help a lot less but you can certainly make offsite work for most important stuff",
                    "replies": []
                }
            ]
        },
        {
            "author": "waywardspooky",
            "score": "156",
            "content": "but what do you do when your setup is literally over 100tb of stuff? how much does it cost to keep an offsite backup exceeding 100tb, closer to 200tb?",
            "replies": [
                {
                    "author": "PrintShinji",
                    "score": "178",
                    "content": "Might be a curse in this sub, but literally be willing to lose stuff. I wanna keep all of my pics, videos, and documents. That's about 500GB. All my Linux isos? Eh if I lose that it's a shame but whatever.",
                    "replies": []
                },
                {
                    "author": "actual_wookiee_AMA",
                    "score": "21",
                    "content": "Do you need to back up everything? You probably have lots of data that can be easily reacquired if lost. You don't need more than one copy of Lord of the Rings or all the seasons of the Office",
                    "replies": []
                },
                {
                    "author": "diamondsw",
                    "score": "49",
                    "content": "For now most people seem to be abusing Google Drive, simply because it's the only affordable option. I've already made plans for post-Google, and have a second Synology I'm going to stash at a friend's house (after performing the initial sync locally, of course). Not cheap at all, but better than what any cloud service would cost (even things like B2 or Glacier are expensive at such volume).",
                    "replies": []
                }
            ]
        },
        {
            "author": "secretsnackbar",
            "score": "17",
            "content": "I currently use Google drive, Dropbox, MEGA, and OneDrive, although I totally forgot about OneDrive for like the last 5 years until today. I'm kind of anti-MS (and Google [sorta] ), so I bought a couple of external HDs now, a 2TB and a 5TB, but I haven't built up (yet) a good habit of using them on a schedule.",
            "replies": []
        },
        {
            "author": "sayhitoyourcat",
            "score": "13",
            "content": "While a RAID isn't a backup, it's still important as everyone knows I'm sure. But you know what's even better if speed/cost isn't an issue for a mirror? A mirrored sync from one drive to another. It's not dependent on hardware or software RAID (even worse situation if a hardware RAID requires specific hardware), you can have the drives physically connected on different hosts or ports or chassis, whatever, the drives can be separated if necessary. For windows, robocopy can check for changes to sync out of hundreds of thousands of files within seconds, so it doesn't even take that long and can simply be scheduled. There's a tool called \"Easy Robocopy\" to help build the command. Anyway, just my two cents and really only reasonable for file archiving; obviously not production servers running services, hosting databases, etc.",
            "replies": []
        },
        {
            "author": "secretsnackbar",
            "score": "33",
            "content": "I really like how only number 6 of the original list has gained any traction here. All those other things are meaningless nonsense that kids DON'T need to hear, apparently.",
            "replies": [
                {
                    "author": "diamondsw",
                    "score": "10",
                    "content": "Touché. ;)",
                    "replies": []
                }
            ]
        },
        {
            "author": "[deleted]",
            "score": "",
            "content": "Nope. Not more money depending on your raid setup. You just have to decide raid - I am ok with being guarded solely against a disk failure, while having benefit of better read speeds backup - I want to be guarded against disk failure and my own mistakes and software fuck up and software malicious intent The thing is that once you say backup, people start to ramp up requirements there like suddenly the above benefits are not enough, you also must add offiste backups so to be guarded against fire destroying your house, or burglar stealing your shit. Or require entire new backup dedicated machine which guards against some destructive failure of the hardware in the first machine... fuck that. All you need in that NAS is just setting the disks as separate places and make regular backup of one to the other, with some deduplication ideally, so you can store many versions of the data in various points in time, from recent days, weeks, months... Just ask this - What is my plan if I accidentally delete some folder on my NAS. If its not your worry then raid is fine, maybe even unneeded, if its a worry then you might want to add some backup.",
            "replies": [
                {
                    "author": "DeerDance",
                    "score": "22",
                    "content": "Nope. Not more money depending on your raid setup. You just have to decide raid - I am ok with being guarded solely against a disk failure, while having benefit of better read speeds backup - I want to be guarded against disk failure and my own mistakes and software fuck up and software malicious intent The thing is that once you say backup, people start to ramp up requirements there like suddenly the above benefits are not enough, you also must add offiste backups so to be guarded against fire destroying your house, or burglar stealing your shit. Or require entire new backup dedicated machine which guards against some destructive failure of the hardware in the first machine... fuck that. All you need in that NAS is just setting the disks as separate places and make regular backup of one to the other, with some deduplication ideally, so you can store many versions of the data in various points in time, from recent days, weeks, months... Just ask this - What is my plan if I accidentally delete some folder on my NAS. If its not your worry then raid is fine, maybe even unneeded, if its a worry then you might want to add some backup.",
                    "replies": []
                },
                {
                    "author": "diamondsw",
                    "score": "20",
                    "content": "Sadly yes - you always need to have backups. Even if you think \"oh, I can replace this\", factor against that your time and the general sense of loss you'd have if you looked one day and that drive/volume/etc was just gone.",
                    "replies": []
                }
            ]
        },
        {
            "author": "secretsnackbar",
            "score": "9",
            "content": "2021.11.26: argggghh I've been struggling like a mofo with backups after I lost like a year-ish of extensive, daily notes because I had to factory reset my phone before (astonishingly) I had an appropriate cloud storage system set up for them. I'm kind of a data-hoarder, too, so I feel extra noob-ish (noob-esque?). I should switch to writing my notes by hand, on paper, I guess",
            "replies": [
                {
                    "author": "diamondsw",
                    "score": "18",
                    "content": "All it takes is an instance or two of dataloss to become a DataHoarder. I know that's what did it for me.",
                    "replies": []
                }
            ]
        },
        {
            "author": "jaytea86",
            "score": "5",
            "content": "Verify backup?",
            "replies": [
                {
                    "author": "diamondsw",
                    "score": "6",
                    "content": "You need to do occasional restores - either a few files as a test or a whole dataset if you have the room - and make sure a) you know how to restore and b) the restore works, and the data is intact. There are plenty of ways a backup can silently fail (software bugs, bitrot, etc) and you don't want to make dataloss worse by finding out your backup was bad.",
                    "replies": []
                }
            ]
        },
        {
            "author": "[deleted]",
            "score": "5",
            "content": "this sub: make sure you have an expensive and tedious 3-2-1 backup solution! also this sub: uses low quality shucked drives from cheap external enclosures whenever and wherever possible",
            "replies": []
        }
    ]
},
{
    "post_author": "beardbreed",
    "post_id": "1dslmmr",
    "post_score": "39",
    "post_time": "Monday, July 1, 2024 at 8:53:17 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Am I missing something? ",
    "media": [
        "https://preview.redd.it/am-i-missing-something-v0-3bctnj7mju9d1.jpg?width=640&crop=smart&auto=webp&s=891115e7b9da90bbab806b55a01f791ba8fdfd21",
        "https://preview.redd.it/am-i-missing-something-v0-fwp31j3mju9d1.png?width=614&format=png&auto=webp&s=104736da8be64862d086a76df602456a081d853a",
        "https://preview.redd.it/am-i-missing-something-v0-79a2abxlju9d1.png?width=614&format=png&auto=webp&s=c7a030a5bd75c6ae66760d48052ddc3b89aada5e",
        "https://x.alibaba.com/160ocn?ck=pdp"
    ],
    "post_content": "My jbod can hold 3.5 inch HDDs but they're loose? I have seagate 2tb drives (attached photo) And this jbod ( https://x.alibaba.com/160ocn?ck=pdp )\nDo I need a caddy or tray? There was no case on the back of the hdd, I can see the ribbon...",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "bhiga",
            "score": "20",
            "content": "No, I have those Orico JBODs (NSx00-U3, NS800-U3) and the drives stick out because you have to grab and physically pull them out - there's no eject button/lever mechanism. You also can't add/remove drives without the unit resetting, so keep that in mind. The drives WILL fall out or at least disconnect by force of their own weight if the unit is sufficiently tipped or jarred even if the magnetic cover is attached and because that'll reset the whole unit there's significant chance of data loss/corruption. If there's any chance of tipping or getting bumped, move it somewhere safer or tape or strap the front cover into place.",
            "replies": [
                {
                    "author": "Jaybonaut",
                    "score": "8",
                    "content": "",
                    "replies": []
                }
            ]
        },
        {
            "author": "TripsOverWords",
            "score": "17",
            "content": "3.5\" drives can have a height anywhere between 19.9-26.1mm. https://www.techtarget.com/searchstorage/definition/HDD-form-factor-hard-disk-drive-form-factor#:~:text=The%203.5%2Dinch%20desktop%20HDD,and%20dual%2Dplatter%209.5%20mm. If there's no way to mount the drive (like a drive caddy), you might be able to add something like a shimm to prevent it from tipping? If you have a 3d printer, you could probably make your own caddy. I don't know if there's a caddy for this JBOD, not familiar with it.",
            "replies": []
        },
        {
            "author": "LordSprint",
            "score": "7",
            "content": "Smaller capacity drives now use the same super high density platters that you find in their ultra large, say, 22Tb drives.. meaning a 2Tb drive only needs a single platter, meaning the entire drive is slimmer, (less material/cost) than say 10 years ago when a 2Tb drive would take up that entire height availability because it had 3, 4 or 5 platters to achieve the same storage density. Hope that makes sense.",
            "replies": []
        }
    ]
},
{
    "post_author": "DollopOfCrazy",
    "post_id": "1dt8dxz",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 3:16:46 AM GMT+3",
    "flair_text": "Hoarder-Setups",
    "post_title": "External HD vs new laptop",
    "media": [],
    "post_content": "Hey crew! I want to un-sync some of the decade worth of photos in my phone to free up storage, but my ten year old MacBook has fewer gigs than my new iPhone. My question:\n(1) is it possible to buy an external HD and back up my iTunes to the external (the laptop itself doesn’t have near enough storage so I cannot first back it up to the laptop and then move it to the external).\nOr is it more worthwhile to (2) buy a new laptop and just do it the normal way. This is mor expensive by about $900 but maybe just easier and more sustainable (I’ve read some older posts on hesitation to use externals here).",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "TEK1_AU",
            "score": "3",
            "content": "Yes you absolutely can do this. You just need to create a symbolic link (via Terminal on your MacBook) pointing to the external drive. Something like this: ln -s /Volumes/ExternalHarddiskName/iPhone\\ backup ~/Library/Application\\ Support/MobileSync/Backup",
            "replies": []
        },
        {
            "author": "cr0ft",
            "score": "2",
            "content": "Externals, internals; the reluctance is towards using any single drive for storage, because single drives fail, and when your single drive fails, your stored material goes poof. If you want to actually store stuff with some safety, you want a NAS; storage with multiple drives that share the load, so to speak, and if any one fails, the others retain the data until you can replace the broken drive. Alternatively, you can of course use a single drive but then also pay for an online service where you can take backups of everything continously. Because without backups your data is just moments away from being lost permanently at all times. Of course, replacing a laptop has benefits that extend beyond storage capacity. Like speed, reliability, more features, better spec. Your call.",
            "replies": []
        }
    ]
},
{
    "post_author": "zeekaran",
    "post_id": "1dtvbeu",
    "post_score": "7",
    "post_time": "Tuesday, July 2, 2024 at 11:05:59 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Two Qs: Best format to save websites for offline reading? Tool to mass convert URLs to file type in previous question?",
    "media": [],
    "post_content": "I have a bunch of well organized bookmarks. As I was recently going through these, I noticed some are gone forever, some can only be accessed through the web archive, and some are behind a paywall.\nFuck that, I want my articles readable in 2100.\nIs PDF the best format to export a web page to? If not, what is?\nIs there a tool I can feed a big list of URLs to that will give me those pages as whatever file type is the answer to question #1?\nI haven't looked, but, I am assuming any browser (Firefox, Chrome) will easily let me export all my bookmarks into an easy to parse list of URLs, thus making #2 easy to do.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "pastafusilli",
            "score": "1",
            "content": "!RemindMe 7 days",
            "replies": [
                {
                    "author": "RemindMeBot",
                    "score": "1",
                    "content": "I will be messaging you in 7 days on 2024-07-09 21:52:31 UTC to remind you of this link CLICK THIS LINK to send a PM to also be reminded and to reduce spam. Parent commenter can delete this message to hide from others. Info Custom Your Reminders Feedback",
                    "replies": []
                }
            ]
        },
        {
            "author": "nothingveryobvious",
            "score": "1",
            "content": "It’s been a while since I explored this topic (I gave up on it), but the ones I knew about were: Wallabag ArchiveBox Shiori wayback",
            "replies": []
        },
        {
            "author": "JamesRitchey",
            "score": "1",
            "content": "Not sure about your first two questions, but in regards to making the list of bookmarks, Firefox supports exporting bookmarks as a JSON file, but you'll need to do further processing of some sort on that file to extract just the URLs. I wrote a PHP function which does this using preg_match_all. You can use any tool which supports regex processing of text. Just make it look for the \"uri\" labelled entries. I'd suggest using a command-line based tool though, because the bookmark file doesn't break data across lines, which can make some graphical programs freeze up, when displaying large files. Installation / Use: // Install git clone https://github.com/jamesdanielmarrsritchey/ritchey_extract_bookmark_urls_i1.git // Export your bookmarks from Firefox // This tool is just a function. You need a script to run the function. A default script is included called \"example.php\". Update 'example.php' to read your bookmarks file, and do anything else you want. Default behavior is just to display the list. // Run the script (this will display the URLs, one per line). php /ritchey_extract_bookmark_urls_i1/example.php // Run the script, and pipe list to file php /ritchey_extract_bookmark_urls_i1/example.php > bookmarks.txt Example Output: user1@machine1:~/Temporary/ritchey_extract_bookmark_urls_i1_v1$ php example.php https://www.wikipedia.org/ https://www.google.ca/ https://www.mozilla.org/en-CA/firefox/new/",
            "replies": []
        }
    ]
},
{
    "post_author": "Fret_Less",
    "post_id": "1dsddkh",
    "post_score": "45",
    "post_time": "Monday, July 1, 2024 at 1:27:25 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Non-Bulk rename utility for windows",
    "media": [],
    "post_content": "I have a whole bunch of files I need to rename. They are not in any particular format so bulk rename does not help here. I'm looking for a way to have all the files listed and the ability to type in the new file name and rename them that way. I can rename them manually and type but I can get to them faster without clicking to edit for each file if that makes any sense. Currently, I'm using .bat files which is doable.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "xAtNight",
            "score": "49",
            "content": "Set windows explorer to list, mark the first file, press f2, rename, press enter, press the down arrow, press f2, repeat until done?",
            "replies": [
                {
                    "author": "alfonzoo",
                    "score": "69",
                    "content": "press enter, press the down arrow, press f2 if you press TAB it does that automagically",
                    "replies": []
                },
                {
                    "author": "Deadline_Zero",
                    "score": "8",
                    "content": "Fascinating...I really need to find an extremely thorough guide to windows hotkeys. Always crazy when I come across a new convenience I should have been using for years.",
                    "replies": []
                }
            ]
        },
        {
            "author": "dalbyman",
            "score": "16",
            "content": "Press f2, type new name, press tab, type new name, tab...",
            "replies": []
        },
        {
            "author": "WikiBox",
            "score": "12",
            "content": "If you have Excel or LibreOffice Calc you can create a file listing, import it into a spreadsheat, then massage it to create commands to rename the files, and export out to a batch file. This allows you to use string functions and other tools to generate the new filenames. That way you may not need to write all the new names, but can build or truncate from the old. You can move names around to group and use similar rename patterns or bulk edits to multiple files, perhaps based on folder names. Use search and replace or remove strings.",
            "replies": [
                {
                    "author": "Fret_Less",
                    "score": "3",
                    "content": "That is a good suggestion! Currently, I did a dir listing, awked the output to print each row twice next to each other, and added the copy commands - excel will make creating the .bat file much faster. Thank you.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Droidem",
            "score": "4",
            "content": "I use ReNamer from den4b.",
            "replies": []
        },
        {
            "author": "nfojones",
            "score": "4",
            "content": "Oscar's File Renamer -- been using this for ages. This is exactly what you want. Ignore all the rest. I had to ask Reddit the name of this app again after finally forgetting what it was between uses only to finally remember it in the process. It is simple af -- and its exactly what you're looking for/describing.",
            "replies": []
        },
        {
            "author": "GHOSTOFKOH",
            "score": "6",
            "content": "Bulk Rename Utility is very powerful. you say they aren't in any particular order, but what are you really going to get that stock explorer and BRU can't accomplish? you can do all sorts of renaming schemes, and apply auto recusive/boolean logic to the schemes, as well as wildcard and regex. i'm confused as to why you think BRU isn't your solution. perhaps you just don't understand the fundamentals?",
            "replies": []
        }
    ]
},
{
    "post_author": "_G0D_M0DE_",
    "post_id": "v8danc",
    "post_score": "25619",
    "post_time": "Thursday, June 9, 2022 at 12:54:50 PM GMT+3",
    "flair_text": "News",
    "post_title": "Justin Roiland, co-creator of Rick and Morty, discovers that Dropbox uses content scanners through the deletion of all his data stored on their servers",
    "media": [
        "https://preview.redd.it/justin-roiland-co-creator-of-rick-and-morty-discovers-that-v0-rcptzt7uhk491.png?auto=webp&s=b4f4af4e5edee228c49d5200b7ed8e592a1ca218",
        "https://i.redd.it/rcptzt7uhk491.png"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "FZERO96",
            "score": "1440",
            "content": "This already happened to me back in 2016. I was saving my phone data and apps as .apk files there. Some .apk files were found to be violating their tos and lead to the deletion of my dropbox account.",
            "replies": [
                {
                    "author": "why_rob_y",
                    "score": "866",
                    "content": "If Dropbox has the ability to detect individual files that violate their rules, why don't they delete those individual files instead of the whole account?",
                    "replies": [
                        {
                            "author": "[deleted]",
                            "score": "",
                            "content": "Are these only free accounts people are talking about, including what Justin Roiland mentioned? Then yeah, that's a little different, but I was thinking they meant paid.",
                            "replies": [
                                {
                                    "author": "why_rob_y",
                                    "score": "215",
                                    "content": "Are these only free accounts people are talking about, including what Justin Roiland mentioned? Then yeah, that's a little different, but I was thinking they meant paid.",
                                    "replies": []
                                },
                                {
                                    "author": "somewhereinthestars",
                                    "score": "34",
                                    "content": "I feel like Roiland's account was probably a paid one.",
                                    "replies": []
                                },
                                {
                                    "author": "FZERO96",
                                    "score": "59",
                                    "content": "The point is, the data wasn't shared, just uploaded.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Sw429",
                            "score": "6",
                            "content": "I guess they figure the user is more likely to upload other violating content.",
                            "replies": []
                        },
                        {
                            "author": "sapphiron7",
                            "score": "2",
                            "content": "What is most worrying to me is the face that Dropbox knows what the file is in the first place.",
                            "replies": [
                                {
                                    "author": "Dremlar",
                                    "score": "3",
                                    "content": "All major online file storage systems are scanning your files. Dropbox, Google Drive/Photos, iCloud, OneDrive, etc. At least some if not all are using AI and other tools to determine content violation from images to other illegal content. If you don't want a company scanning your data, the only option is to store it on computers you own. There is no large scale solution in the US (and I believe EU - but not 100% sure) that doesn't do this.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "FunnyPhrases",
                            "score": "1",
                            "content": "They actually do. At least that was my experience. Sounds kinda dumbass to do the latter.",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "Noobgamer0111",
            "score": "472",
            "content": "Original tweet: https://twitter.com/JustinRoiland/status/1534670496402268160",
            "replies": [
                {
                    "author": "odraencoded",
                    "score": "491",
                    "content": "@Dropbox is this for real? i have my entire business based in Dropbox. if you’re willing to wipe someone’s account and not explain, looks like google drive is back on the menu My sides!",
                    "replies": []
                }
            ]
        },
        {
            "author": "sa547ph",
            "score": "758",
            "content": "Some filehosts literally allow third-party copyright bots to scan and flag content of just about anyone. I'm reminded of the time some Counterstrike game mod author found his files flagged and removed from Mediafire, followed by a cease-and-desist email, by a copyright bot which thought one of the files belonged to, get this, a porn movie studio.",
            "replies": []
        },
        {
            "author": "MOHdennisNL",
            "score": "2010",
            "content": "And this is why I still do not trust AI, Cloud, Third Party solutions... And thus, I became a Datahoarder",
            "replies": [
                {
                    "author": "AdvertisingNo3914",
                    "score": "684",
                    "content": "This is why I encrypt everything that goes to cloud. Can't trust AI scanning my data and deleting because of arbirtrary reasons the AI or developers set.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Ryan_G01",
            "score": "347",
            "content": "If you're going to be using Dropbox at least use it with Cryptomator, it encrypts your files on the local machine before uploading to Dropbox. Open source and free as well.",
            "replies": [
                {
                    "author": "Digitizer4096",
                    "score": "138",
                    "content": "This is the only safe way, encrypting the files on local machine before uploading. The before part is very important.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Galebourn",
            "score": "502",
            "content": "RIP and Morty",
            "replies": []
        },
        {
            "author": "B1llGatez",
            "score": "171",
            "content": "When will people learn not use cloud services for critical or sensitive data.",
            "replies": [
                {
                    "author": "Buzzard",
                    "score": "70",
                    "content": "When will people learn not use cloud services for critical or sensitive data Wait, isn't that exactly what they are for? People don't pay $400 AUD a year for a place to store their memes...",
                    "replies": []
                }
            ]
        },
        {
            "author": "_G0D_M0DE_",
            "score": "104",
            "content": "Dropbox's \"Privacy Policy\" https://help.dropbox.com/accounts-billing/security/privacy-policy-faq",
            "replies": [
                {
                    "author": "Liam2349",
                    "score": "54",
                    "content": "I read some of that and it is pretty weak lol. Fuck paying for that shit.",
                    "replies": []
                }
            ]
        },
        {
            "author": "jlipschitz",
            "score": "79",
            "content": "The cloud is my 2nd backup copy. 3-2-1 will always save you in the end.",
            "replies": []
        },
        {
            "author": "etaco2",
            "score": "60",
            "content": "Obviously this issue will be fixed for this celebrity since it is making news. But for anyone else this happens to they are pretty much fucked. Cloud backups are great but always keep local copies as well.",
            "replies": [
                {
                    "author": "zfsbest",
                    "score": "50",
                    "content": "You really think Dropbox is going to fix this mess? I have a doubt. I hope this makes it into an episode, where Rick breaks the 4th wall and basically says \" Yeah Dropbox, f--k those guys \"",
                    "replies": []
                }
            ]
        },
        {
            "author": "mikeputerbaugh",
            "score": "55",
            "content": "Aw jeez Rick",
            "replies": []
        },
        {
            "author": "foamed",
            "score": "59",
            "content": "The Dropbox client for PC and phone app haven't been secure or privacy friendly in over a decade, but most likely never. Have people completely forgotten that Condoleezza Rice joined Dropbox's board of directors in 2014? Sources: https://www.reddit.com/r/politics/comments/23rhrl/protests_continue_against_dropbox_after/ https://www.theverge.com/2014/4/11/5605734/dropbox-ceo-defends-adding-condoleezza-rice-to-board https://www.wired.com/2014/04/dropbox-rice-controversy/ https://www.msnbc.com/msnbc/tech-giant-pressed-ditch-condi-rice-msna306461 She also: Helped start the war in Iraq. Was involved in the creation of the Bush administration's torture program. On the record supporting the Patriot act. Was part of the administration, that created, wrote, and legalized the Patriot act. On the record supporting warrantless wiretaps. On the record supporting anonymous bulk data collection. Was on the Board of Directors at Chevron. You shouldn't trust Dropbox with your data.",
            "replies": []
        }
    ]
},
{
    "post_author": "cdeveringham",
    "post_id": "k9atkn",
    "post_score": "3999",
    "post_time": "Tuesday, December 8, 2020 at 10:17:22 PM GMT+3",
    "flair_text": "",
    "post_title": "Problem has been solved, 87 TB Array! No more Panik",
    "media": [
        "https://i.redd.it/cglu6w2jj0461.png",
        "https://preview.redd.it/cglu6w2jj0461.png?auto=webp&s=eed0975b036df73d42825844aaa95abc53c33e8e"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "jnew1213",
            "score": "214",
            "content": "I am thinking your 86.6TB is 10 x 12TB drives in RAID 6. Am I close?",
            "replies": [
                {
                    "author": "cdeveringham",
                    "score": "202",
                    "content": "Very close, but it's 8x 16 TB drives in a RAID 6.",
                    "replies": [
                        {
                            "author": "alashow",
                            "score": "63",
                            "content": "How much did you spend on that setup?",
                            "replies": [
                                {
                                    "author": "cdeveringham",
                                    "score": "74",
                                    "content": "5 grand total. But I'm including a plex pass subscription and 2 500GB NVME drives in that toal.",
                                    "replies": []
                                },
                                {
                                    "author": "suckyourmompls",
                                    "score": "12",
                                    "content": "A good bad question for another time never",
                                    "replies": []
                                },
                                {
                                    "author": "thebottlekids",
                                    "score": "3",
                                    "content": "I'm guessing at least $3.50",
                                    "replies": []
                                },
                                {
                                    "author": "3p1cBm4n9669",
                                    "score": "3",
                                    "content": "Yes",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "[deleted]",
                            "score": "25",
                            "content": "Very close, but it's 8x 16 TB drives in a RAID 6. SOOOoo.... I'm going to repeat the story of a sad sad raid 6 failure. Pretty much due to stupidity, compounded by stupidity, and then finally nailed-in-the-coffin due to stupidity. But it's stupid. Raid 6, 1 hot spare, 1 cold spare. Drive fails, System rebuild. All is grand- but what, it's beeping! So asshole engineer who knows too much rips the SAS cable out of the rebuilding array. Hot spare fried, now down to N, so no more failures. Things have trouble getting off the ground, so 2nd engineer keeps rebooting the system. Sometimes it comes up, sometimes it doesnt. Still beeping. So they rip the sas cable out again. At this point they come find me, who put it together. Don't mention ANY of the previous events. All I see is corrupted raid data so I manually cycle a build stealing another drive from another system (this is important)... which eventually I found out is where they backed up the data to. Raid isn't backup. Stupidity can't be fixed. Hope you have a spare :) OK , I'm out.",
                            "replies": [
                                {
                                    "author": "Beats-By-Schrute",
                                    "score": "3",
                                    "content": "Yeah, that's the issue I have. Anything I set up, I need to duplicate offsite. Even if not RAID. But it's still expensive.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "jnew1213",
                            "score": "5",
                            "content": "Ah! Very cool! I have the previously described 10 x 12TB, RAID 6.",
                            "replies": []
                        },
                        {
                            "author": "Treyzania",
                            "score": "1",
                            "content": "now wait until all the helium leaks out...",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "root-node",
            "score": "555",
            "content": "I give it 6 months and it will be full again :)",
            "replies": [
                {
                    "author": "iamnotaseal",
                    "score": "308",
                    "content": "I just expanded from 21.8 to 43.6TB and I'm now like 'wow, so much room for activities....got to find more ISOs!'",
                    "replies": []
                }
            ]
        },
        {
            "author": "judokalinker",
            "score": "154",
            "content": "All that red gives me anxiety",
            "replies": [
                {
                    "author": "cdeveringham",
                    "score": "80",
                    "content": "I am making all that red go away now :)",
                    "replies": []
                }
            ]
        },
        {
            "author": "solarstryder",
            "score": "60",
            "content": "Let me see If I can indulge you in some panik. Drives",
            "replies": [
                {
                    "author": "mauxey",
                    "score": "34",
                    "content": "why is rack drive 4 labeled as L instead",
                    "replies": []
                }
            ]
        },
        {
            "author": "anthro28",
            "score": "80",
            "content": "No panik, only drives.",
            "replies": []
        }
    ]
},
{
    "post_author": "88rcg",
    "post_id": "1dt842k",
    "post_score": "1",
    "post_time": "Tuesday, July 2, 2024 at 3:03:35 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Max HDD's expansion with PSU",
    "media": [
        "https://preview.redd.it/max-hdds-expansion-with-psu-v0-e2uzw1wqxz9d1.png?width=514&format=png&auto=webp&s=6feace11eeb5477de52c388780254fb9c5d964f3",
        "https://assets.corsair.com/image/upload/corsairmedia/sys_master/productcontent/AX_Series_Manual.pdf"
    ],
    "post_content": "I have a corsair ax860 power supply (https://assets.corsair.com/image/upload/corsairmedia/sys_master/productcontent/AX_Series_Manual.pdf)\nand I currently have 15 HDD's in my storage server with an EPYC 7551p CPU (180w capability) with a tesla P4 (75 watts) and 256gb ddr4 2666 ecc ram with two HBA cards for up to 16 HDD expansion plus the 8 ports from my motherboards mini-sas and have 2 2TB m.2 nvmes.\nFrom what I can tell the HDD's specs say they'll be upwards of 10watts under load per drive. (Various seagate EXOS drives mostly).\nI'd like to max out my case which can hold 24 drives. The Corsair AX860 comes with 3 cables which support 4 sata drives, for a total of 12. I then use a sata extender cable to add the other 4 power ports. I'd like to add more to fully max out my case but I'm wondering if it's safe to buy another extension cable or rather if I can buy a pcie 6 pin to sata cable that I see available for sale on various stores like amazon/aliexpress etc. I suspect it's safe to buy a 6 pin to x number of sata ports. I suspect 5-6 ports I should get on an extension cable per 6 pin pcie line but figured I'd ask here as I don't quite understand the power loads.\nAliexpress has anywhere from 4 to 10 sata ports per cable that you can buy. I'm wondering though based on my PSU what can I safely support and are the 6 pin pcie to sata extension cables safe to use?\nCorsair AX860 power table",
    "comments": []
},
{
    "post_author": "leniwsek",
    "post_id": "1dtuv1o",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 10:46:38 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "My external SSD Samsung T7 Shield 1TB slowed down, Macbook Pro M2 ",
    "media": [],
    "post_content": "I wonder what could be the issue and how to solve it, is it corrupted? Is the TBW reaching limit? I have over 450 GB free.. what could be the issue? Should I reformat it?\nTransferring 130 GB takes 10 minutes while on my second same drive it takes like 2 minutes. I'm having that drive 1 year old.. should I be afraid?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "IronCraftMan",
            "score": "2",
            "content": "It sounds like you're exceeding the SLC cache, which runs at high speed, and overflowing onto the regular flash which writes much slower. Could also be the fact that you've written to all the cells and it thus needs to erase each cell before it can write, but the performance degradation of that process isn't actually all that bad (compared to SLC exhaustion). Mac Use DriveDx to get SMART stats of your drive. It doesn't always work for external SSDs, though.",
            "replies": [
                {
                    "author": "leniwsek",
                    "score": "2",
                    "content": "and what does it exactly mean? Is my drive damaged? I'm really new to this still so any tips or explanation is absolutely welcome!",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "erik530195",
    "post_id": "lfbdny",
    "post_score": "3973",
    "post_time": "Monday, February 8, 2021 at 4:05:28 PM GMT+3",
    "flair_text": "",
    "post_title": "Thought you all might find this interesting",
    "media": [],
    "post_content": "",
    "comments": [
        {
            "author": "[deleted]",
            "score": "",
            "content": "For a cheap, quick , efficient solution, I suggest a scan stand. This is a folding cardboard jig that allows you to use a cell phone to take good pictures of your books. For the software I suggest a open source product called scan tailor, which will help align and clean up the smudges and creases in the documents scans and prep them for OCR. I've used both to digitize dozens of books photos and papers.",
            "replies": [
                {
                    "author": "[deleted]",
                    "score": "133",
                    "content": "For a cheap, quick , efficient solution, I suggest a scan stand. This is a folding cardboard jig that allows you to use a cell phone to take good pictures of your books. For the software I suggest a open source product called scan tailor, which will help align and clean up the smudges and creases in the documents scans and prep them for OCR. I've used both to digitize dozens of books photos and papers.",
                    "replies": [
                        {
                            "author": "[deleted]",
                            "score": "58",
                            "content": "That sounds fantastic. Did a quick search and discovered Scan Jig which looks very promising!",
                            "replies": [
                                {
                                    "author": "[deleted]",
                                    "score": "35",
                                    "content": "Matthias Wandel's DIY version",
                                    "replies": []
                                },
                                {
                                    "author": "[deleted]",
                                    "score": "2",
                                    "content": "Scan jig will work as well many others that you can find online. I prefer the scan stand as it folds to specifically fit in a file cabinet, is inexpensive – around $20 - and extremely sturdy. But I have seen many other solutions.",
                                    "replies": []
                                },
                                {
                                    "author": "LillyXcX",
                                    "score": "1",
                                    "content": "Found this cheaper alternative https://www.amazon.com/dp/B00XM7LKZM/ref=cm_sw_r_cp_apa_fabc_V2Y7GBK7QN3EREXE2M60 It's literally a cardboard box lol",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "shrine",
            "score": "459",
            "content": "Even THOSE motherfuckers don't have an automatic page-turner.",
            "replies": [
                {
                    "author": "[deleted]",
                    "score": "36",
                    "content": "So 20 years ago I worked for a company that did \"document digitization\". They paid me $15/hr (at the time that was great, as I was still in high school) to basically monitor an auto-feed scanner. I would occasionally have to make minor adjustments to quality/contrast, etc, but once I got the hang of it my job was basically to move a stack of paper onto a machine once every 20-30 minutes. I was working full time from 3pm-11pm and going to school from 7am-3pm. But because I had so little to do at work, my grades actually went up, as I used all the time to study/do homework.",
                    "replies": []
                },
                {
                    "author": "ConnorBetts_",
                    "score": "17",
                    "content": "They posted this on Twitter the other day and looks like they do it to preserve the books as much as possible. They also answered a lot of questions. It’s a pretty cool thread. Source: https://twitter.com/internetarchive/status/1358090982189719552?s=21",
                    "replies": []
                }
            ]
        },
        {
            "author": "[deleted]",
            "score": "65",
            "content": "If they could only improve it by using mechanical engineering to replace the page flipping hand person.",
            "replies": [
                {
                    "author": "Xeenic",
                    "score": "39",
                    "content": "I would totally get pages stuck together and not flip the page in time resulting in a nasty crease or worse",
                    "replies": []
                }
            ]
        },
        {
            "author": "zhiryst",
            "score": "31",
            "content": "I used to support a library, we had a Book Eye scanner that is most of this, just without the glass. Here's the thing though, the Book Eye's scanning software accommodates for the distortion and automatically flattened the image, so to me, the glass isn't really that necessary. https://www.imageaccess.com/book-scanners",
            "replies": []
        }
    ]
},
{
    "post_author": "bigcowboymeatstick69",
    "post_id": "1ds4vdj",
    "post_score": "18",
    "post_time": "Sunday, June 30, 2024 at 7:05:39 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Mp3tag-like app for non-mpeg videos?",
    "media": [],
    "post_content": "Mp3tag works great for mpeg file formats, but I have a ton of videos in .avi format. Anyone know an app that does automatic tag and filename editing like mp3tag? TIA!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "sturmen",
            "score": "13",
            "content": "I’d suggest looking into whether the AVI container even accommodates the sort of metadata that MPEG formats do. It might simply not be part of the AVI specification. If you’re concerned about tagging, I’d suggest remuxing them to Matroska and tagging those with MKVToolNix.",
            "replies": []
        },
        {
            "author": "AcornWhat",
            "score": "6",
            "content": "Looks like a no-go with AVI. it's an old and basic format whose limitations are largely why newer formats have so many options for metadata and multiple streams.",
            "replies": []
        },
        {
            "author": "bmaasth",
            "score": "4",
            "content": "Here's FFMPEG's list of metadata keys for the AVI container, which compared to MP4's is rather paltry. That said, after a little looking around it seems that a lot of places recommend AVI Meta Edit. It's a personal preference, but I've been migrating all of mine to MP4 and then can add/edit the metadata at will. This does, however, open a whole new can of worms (e.g.: codec, time to convert, and in my case, heat output from running the CPU at full bore for hours on end.) TLDR: An answer (AVI Media Edit) and a lot more to ponder.",
            "replies": []
        },
        {
            "author": "GreenAndBlueG",
            "score": "4",
            "content": "As some users already said, AVI is pretty old and pretty basic. I'd personally recommend remuxing those files into Matroska files which in your case they should have the .mkv extension. Then you can use something like MKVToolNix (specifically mkvpropedit or the built-in GUI wrapper) to edit the metadata For remuxing (copying the audio and video streams without reencoding them) you can use an FFmpeg command like this ffmpeg -i input.avi -c copy output.mkv (Yours may need to be tweaked a little) Also, I believe but don't quote on that MKVToolNix's mkvmerge (or, again, the GUI wrapper) can read non-Matroska files as well You could also use FFmpeg's -metadata option if you wanted to. You can set arbitrary fields but try to use a supported one if possible Edit: typo",
            "replies": []
        },
        {
            "author": "FFM",
            "score": "1",
            "content": "this worked for me when AVI was a thing, abandonware as mp4 is a much more suited container for video/audio/metadata https://www.videohelp.com/software/abcAVI-Tag-Editor",
            "replies": []
        }
    ]
},
{
    "post_author": "dekekun",
    "post_id": "1dt7s4n",
    "post_score": "4",
    "post_time": "Tuesday, July 2, 2024 at 2:48:14 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Onboard SATA vs SATA PCIe card",
    "media": [],
    "post_content": "I've had a linux based NAS/fileserver running on PC hardware for around 15 years now, upgrading it along the way, and have always during that time been of the view that SATA cards are untrustworthy, and wherever possible onboard SATA should be preferred.\nI'm at the point where I want to start scrounging for parts for the next upgrade and have found that almost all motherboards except the very top of the line models no longer have enough SATA ports to feed my drive addiction.\nSo curious what the prevailing opinion is these days - are PCIe sata cards reliable enough these days, or should I suck it up and buy a z790 board to get enough onboard SATA?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "SoneEv",
            "score": "18",
            "content": "Get a LSI HBA card. They are cheap, widely available used, Enterprise grade. Get one already set in IT mode, some mini-SAS to SATA cables",
            "replies": []
        },
        {
            "author": "bobj33",
            "score": "9",
            "content": "PCIE SATA cards are flaky crap. As the other people said buy a used LSI SAS HBA PCIE card.",
            "replies": []
        },
        {
            "author": "Y0tsuya",
            "score": "8",
            "content": "The answer is always a LSI HBA.",
            "replies": []
        },
        {
            "author": "silasmoeckel",
            "score": "4",
            "content": "pcie sata boards tend to be dumpster fires. sas hba's are dirt cheap and support 1k drives via also cheap expanders.",
            "replies": []
        },
        {
            "author": "DR650SE",
            "score": "4",
            "content": "I've been using a PCIE SATA card and so far no complaints. My desktop has 19 drives in it, so needed more slots. https://www.reddit.com/r/pcmasterrace/s/XcSzMRnHjn",
            "replies": []
        },
        {
            "author": "cdf_sir",
            "score": "4",
            "content": "LSI HBA is always the recommended one, but those cards consumes a lot of idle power, about aaditional 12watts for the card alone. While the cheap sata cards are basically consume next to nothing. (probably less than 2watts). Reliability is going to be questionable but some of my asmedia SATA cards works great even at days worth of resilvering drives.",
            "replies": [
                {
                    "author": "HonestPaper9640",
                    "score": "1",
                    "content": "I use 3 asmedia cards for the same reason, no problems and they let me make use of all the 1x slots on my board while leaving the other slots for GPUs. The LSI cards are a nice option, and for awhile the availability of newer HBA chipsets with anything more than 2 ports was terrible so they were a pretty solid recommendation in general. But with new 5 port jmicron and better asmedia controllers I don't think they deserve that crown anymore. My favorite is when some one comes on asking specifically for how to setup a low power server and everyone recommends a power sucking LSI card even then.",
                    "replies": []
                }
            ]
        },
        {
            "author": "ratudio",
            "score": "1",
            "content": "The only issue I find with sata pcie card probably the driver support which force me to stick with windows. I personally used sata pcie card and nvme sata. But in the end, I purchased used 36 bays supermicron since desktop mb just can’t handle 30 hdd properly even with dual psu that I installed. There time that some of hdd failed to appear on the window. I believe server mb power the hdd in sequence instead of all at once that I notice with my desktop mb. Also does not require beefy psu to power all hdd",
            "replies": []
        }
    ]
},
{
    "post_author": "kghjk",
    "post_id": "1dttfkv",
    "post_score": "1",
    "post_time": "Tuesday, July 2, 2024 at 9:47:16 PM GMT+3",
    "flair_text": "Scripts/Software",
    "post_title": "Is there a way to remove sloppy (black ink pen) underlining from scanned library book images?",
    "media": [],
    "post_content": "I can't find a way. It would seem like a really easy piece of software for a programmer to write, but googling doesn't turn anything up. Does anyone here know of anything?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "dcabines",
            "score": "2",
            "content": "Try Photoshop",
            "replies": [
                {
                    "author": "kghjk",
                    "score": "0",
                    "content": "How could Photoshop be used to remove it?",
                    "replies": [
                        {
                            "author": "smilesdavis8d",
                            "score": "2",
                            "content": "I agree - Photoshop. It can be used to clean up photos...it can be used to clean up your images. I imagine the AI plugins can probably do it much faster. ...if you want examples of how Photoshop can do magic like that check out r/PhotoshopRequests and you'll see examples of the wizardry that can be done \"cleaning\" photos.",
                            "replies": []
                        },
                        {
                            "author": "K1rkl4nd",
                            "score": "1",
                            "content": "I clean up pdfs be exporting to TIFFs, editing in Photoshop, then having Acrobat recompress back into PDFs.",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "rajmahid",
            "score": "1",
            "content": "Or a PDF editor if your book image is in PDF.",
            "replies": []
        },
        {
            "author": "plunki",
            "score": "1",
            "content": "Example pic?",
            "replies": [
                {
                    "author": "kghjk",
                    "score": "1",
                    "content": "Here's a quick example: https://i.imgur.com/s0kd813.png There are much worse cases.",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "Fret_Less",
    "post_id": "1dsddkh",
    "post_score": "45",
    "post_time": "Monday, July 1, 2024 at 1:27:25 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Non-Bulk rename utility for windows",
    "media": [],
    "post_content": "I have a whole bunch of files I need to rename. They are not in any particular format so bulk rename does not help here. I'm looking for a way to have all the files listed and the ability to type in the new file name and rename them that way. I can rename them manually and type but I can get to them faster without clicking to edit for each file if that makes any sense. Currently, I'm using .bat files which is doable.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "xAtNight",
            "score": "49",
            "content": "Set windows explorer to list, mark the first file, press f2, rename, press enter, press the down arrow, press f2, repeat until done?",
            "replies": [
                {
                    "author": "alfonzoo",
                    "score": "69",
                    "content": "press enter, press the down arrow, press f2 if you press TAB it does that automagically",
                    "replies": [
                        {
                            "author": "xAtNight",
                            "score": "19",
                            "content": "Even better! Didn't know that, thanks.",
                            "replies": []
                        },
                        {
                            "author": "wiseIdiot",
                            "score": "10",
                            "content": "Whoa. That's something I never knew after using Windows all these years.",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "Deadline_Zero",
                    "score": "8",
                    "content": "Fascinating...I really need to find an extremely thorough guide to windows hotkeys. Always crazy when I come across a new convenience I should have been using for years.",
                    "replies": [
                        {
                            "author": "pmjm",
                            "score": "2",
                            "content": "Hotkeys are one of the main reasons Windows Explorer > MacOS Finder. I agree they need to be documented better on both platforms.",
                            "replies": []
                        },
                        {
                            "author": "Murrian",
                            "score": "2",
                            "content": "",
                            "replies": [
                                {
                                    "author": "GHOSTOFKOH",
                                    "score": "7",
                                    "content": "",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "dalbyman",
            "score": "16",
            "content": "Press f2, type new name, press tab, type new name, tab...",
            "replies": []
        },
        {
            "author": "WikiBox",
            "score": "12",
            "content": "If you have Excel or LibreOffice Calc you can create a file listing, import it into a spreadsheat, then massage it to create commands to rename the files, and export out to a batch file. This allows you to use string functions and other tools to generate the new filenames. That way you may not need to write all the new names, but can build or truncate from the old. You can move names around to group and use similar rename patterns or bulk edits to multiple files, perhaps based on folder names. Use search and replace or remove strings.",
            "replies": [
                {
                    "author": "Fret_Less",
                    "score": "3",
                    "content": "That is a good suggestion! Currently, I did a dir listing, awked the output to print each row twice next to each other, and added the copy commands - excel will make creating the .bat file much faster. Thank you.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Droidem",
            "score": "4",
            "content": "I use ReNamer from den4b.",
            "replies": []
        },
        {
            "author": "nfojones",
            "score": "4",
            "content": "Oscar's File Renamer -- been using this for ages. This is exactly what you want. Ignore all the rest. I had to ask Reddit the name of this app again after finally forgetting what it was between uses only to finally remember it in the process. It is simple af -- and its exactly what you're looking for/describing.",
            "replies": []
        },
        {
            "author": "GHOSTOFKOH",
            "score": "6",
            "content": "Bulk Rename Utility is very powerful. you say they aren't in any particular order, but what are you really going to get that stock explorer and BRU can't accomplish? you can do all sorts of renaming schemes, and apply auto recusive/boolean logic to the schemes, as well as wildcard and regex. i'm confused as to why you think BRU isn't your solution. perhaps you just don't understand the fundamentals?",
            "replies": []
        }
    ]
},
{
    "post_author": "ian9921",
    "post_id": "znkww3",
    "post_score": "9418",
    "post_time": "Friday, December 16, 2022 at 9:03:35 PM GMT+3",
    "flair_text": "Free-Post Friday!",
    "post_title": "yall might appreciate this",
    "media": [
        "https://i.redd.it/hzwguhoocc6a1.jpg",
        "https://preview.redd.it/yall-might-appreciate-this-v0-hzwguhoocc6a1.jpg?width=640&crop=smart&auto=webp&s=a1cbca7f44f111bd3a832605870faa8ea009c70c"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "1Autotech",
            "score": "1207",
            "content": "My movie collection is like Netflix but with stuff I want to watch.",
            "replies": [
                {
                    "author": "CletusVanDamnit",
                    "score": "480",
                    "content": "That's almost exactly how I describe what Plex does.",
                    "replies": [
                        {
                            "author": "Oscaruit",
                            "score": "177",
                            "content": "My plex server has 1200 movies on it, but it never has the one I'm looking for. And I swear that it used to be on there but I have to go redownload it again.",
                            "replies": [
                                {
                                    "author": "askariya",
                                    "score": "81",
                                    "content": "Look up Radarr and Sonarr if you haven't heard of em yet. Now I never need to do anything more than add a movie to a Trakt list.",
                                    "replies": []
                                },
                                {
                                    "author": "Wooty_Patooty",
                                    "score": "18",
                                    "content": "This man plexes. Do you have a buddy constantly moving the data from drive to drive as he decides on a new organization system every time you add another drive to the array?",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "[deleted]",
                            "score": "",
                            "content": "What is this “delete” word you speak of. I am unfamiliar with it.",
                            "replies": [
                                {
                                    "author": "LosLocosKickYourAss",
                                    "score": "181",
                                    "content": "What is this “delete” word you speak of. I am unfamiliar with it.",
                                    "replies": []
                                },
                                {
                                    "author": "doubleclick",
                                    "score": "109",
                                    "content": "wise zealous include foolish hurry memory oil fanatical cover pathetic This post was mass deleted and anonymized with Redact",
                                    "replies": []
                                },
                                {
                                    "author": "oasuke",
                                    "score": "5",
                                    "content": "but what if you might be in the mood for it later",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "KevinCarbonara",
                            "score": "39",
                            "content": "It's Spotify for movies but without the ads",
                            "replies": [
                                {
                                    "author": "AshleyUncia",
                                    "score": "89",
                                    "content": "Spotify for movies That's just Netflix. And like Spotify, Netflix does not actually have all things. There's plenty of artists or songs or albums just not on Spotify. The key to having your own local files is you can have anything you want. Netflix stuff, Peacock stuff, BBC stuff, stuff only released on Blu-Ray.",
                                    "replies": []
                                },
                                {
                                    "author": "squareswordfish",
                                    "score": "8",
                                    "content": "Netflix is the Spotify for movies/shows. They both have the content available for you, with Plex you need to get it yourself",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "juicehouse",
                    "score": "36",
                    "content": "By want to watch you mean things I keep telling myself to get around to watching but never do right?",
                    "replies": []
                }
            ]
        },
        {
            "author": "ndsipa-pomu",
            "score": "95",
            "content": "*Cries in Laserdisc*",
            "replies": []
        },
        {
            "author": "oramirite",
            "score": "179",
            "content": "More accurate: Enter the Void has been sitting in my Plex library for years and I've yet to watch it. But boy, do I have it available!!",
            "replies": [
                {
                    "author": "Equivalent-Way3",
                    "score": "39",
                    "content": "Literally me until I watched it last night finally. Weird af. Good movie.",
                    "replies": []
                }
            ]
        },
        {
            "author": "uwantSAMOA",
            "score": "141",
            "content": "How else am I gonna show off the masterpiece that is The Count of Monte Cristo to my next girlfriend?",
            "replies": [
                {
                    "author": "ThrowawayMustangHalp",
                    "score": "72",
                    "content": "LISTEN. No matter which version of that film you're referring to, it goes hard, and if she's not on board, launch her to the moon. The moon, I say!",
                    "replies": []
                }
            ]
        },
        {
            "author": "atreides4242",
            "score": "60",
            "content": "Hey baby wanna come DLNA and chill?",
            "replies": []
        },
        {
            "author": "SmiteIke",
            "score": "157",
            "content": "This is inaccurate. I showed my Mom and she thought it was very cool and she just so happens to also be a woman.",
            "replies": []
        },
        {
            "author": "Brancliff",
            "score": "243",
            "content": "I don't like how the internet makes us out to seem like vegans when a NAS with 2000 movies on it is far more interesting than Netflix shuffling Thinger Strangs episodes in and out whenever they feel like it",
            "replies": [
                {
                    "author": "HardToBeAHumanBeing",
                    "score": "91",
                    "content": "I don't get what vegans have to do with this. But I do love \"Thinger Strangs\" haha. Regardless, I think what we do is objectively \"nerdy\". It involves some fairly technical stuff and a lot of passion and dedication for what most people would consider too much. But it can be nerdy and ALSO cool.",
                    "replies": []
                },
                {
                    "author": "Puptentjoe",
                    "score": "29",
                    "content": "I don’t eat animal products and a datahoarder, the internet hates me! Lol. When in reality people I know love my Plex server. My wife doesnt mind the literal heat that comes off my rack server and neither has any girlfriend in the past 21 years ive had a server. Also they just ask me why I dont eat meat, I tell em and thats that. The internet is a silly place.",
                    "replies": []
                }
            ]
        },
        {
            "author": "TriumphITP",
            "score": "51",
            "content": "I certainly appreciated Enter the Void.",
            "replies": []
        },
        {
            "author": "FuriousGeorge50",
            "score": "40",
            "content": "Show them your Plex and let them choose from your 4k Remux 64TB server",
            "replies": [
                {
                    "author": "TheFeshy",
                    "score": "36",
                    "content": "64TB server Yes... 64 TB server, like a normal hoarder. throws tarp over ceph cluster",
                    "replies": []
                }
            ]
        },
        {
            "author": "savedposts456",
            "score": "25",
            "content": "I mean, that’s the one reason to have Netflix - easy entertainment with a widely known interface for early dates. Once you get to know each other, you can ditch Netflix and let your NAS freak flag fly lol. If she’s down, you know she’s a keeper.",
            "replies": [
                {
                    "author": "bombero_kmn",
                    "score": "27",
                    "content": "When you show her your Jellyfin and she optimizes your transcoding <3",
                    "replies": []
                }
            ]
        },
        {
            "author": "gallito9",
            "score": "26",
            "content": "My PLEX library probably helps me with my relationship lol. My gf is a movie nut. Paid for every streaming service under the sun when we met. Now she only has Prime, because Prime, and is the only user who doesn’t need request approval.",
            "replies": []
        },
        {
            "author": "Daerog",
            "score": "24",
            "content": "Holy goddamn, a wild mention of Enter the Void. What an incredible journey that movie was.",
            "replies": []
        }
    ]
},
{
    "post_author": "-Archivist",
    "post_id": "1479mua",
    "post_score": "3963",
    "post_time": "Monday, June 12, 2023 at 3:04:21 AM GMT+3",
    "flair_text": "Opening 25th",
    "post_title": "API Clusterfuck! ~ We're locked, read this.",
    "media": [
        "https://old.reddit.com/r/DataHoarder/comments/14j2kty/api_clusterfuck_reddit_said_fuck_you_we_dont_care/",
        "https://reddark.untone.uk/",
        "https://www.reddit.com/r/DataHoarder/",
        "https://www.reddit.com/r/ModCoord/",
        "https://old.reddit.com/r/DataHoarder/comments/1479c7b/historic_reddit_archives_ongoing_archival_effort"
    ],
    "post_content": "See reopening post.....\nHi everyone, we'll keep this short, you already know what's going on.\nAs you've almost certainly heard by now Reddit is locking down their API starting July 1st with the introduction of paid usage. These changes are what killed pushshift.io (full reddit archives and searchable api used by mods and many research/academic papers) and what will kill most (if not all) third-party reddit clients. This is obviously a detriment to everyone, and while Reddit will almost certainly go through with these changes regardless, thousands of subreddits are going to be participating in a 2-day (or longer) blackout. You can read more about the blackouts at r/ModCoord. At the very least, the planned blackout seems to have convinced Reddit to give free API access to accessibility clients. Hopefully it can change their minds further.\nr/DataHoarder will be locked for an undetermined amount of time, see this thread for reddit data archives, tools, etc. we will also be using this time to update our sidebar links and do some general maintenance in the hopes that this mess doesn't mean the end for us and the many communities that see this as a killing of the Reddit we have loved over the years.\nNote; during this time no new posts can be made and all comments are black-holed.\n~ The Mod Team, ciao for now.\nTrack the blackout here: https://reddark.untone.uk",
    "comments": []
},
{
    "post_author": "smilesdavis8d",
    "post_id": "1dtssf9",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 9:20:25 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Simplified self hosted cloud drive option",
    "media": [],
    "post_content": "Hello fellow Datahoarders!\nI've been using gdrive with rclone mounts and freefilesync to move and access files.\nI would like to remove gdrive from my setup all together but keep my setup relatively similar *setup explained below*.\nDoes anyone have any suggestions for a simple self hosted cloud drive replacement?\nI've been trying to set up Nextcloud but I'm realizing I probably don't need something with a full feature cloud suite and, not being familiar with linux has been a bit daunting to get it set up and functioning. I've attempted the windows docker desktop aio version (has issues handling external drives) and the Ubuntu manual/snap versions which have led to network and apache issues.\nI've also heard of filebrowser which seems less bloated but figure it's a similar setup situation.\nI would preferably like a setup using windows . Though I'm open to whatever as I'm slowly becoming more familiar with linux.\nRequirements:\nAccessible from any computer (phone would be useful too for photos) - \"any\" meaning Ideally I can access via a browser or something (like gdrive) and upload or download files if needed.\nCan be mounted on any computer as a local drive (Rclone)\nCan use freefilesync (either directly or via rclone/local mounts)\n*My current setup:\nI have a main desktop running Windows with several external drives used for everyday use - It's the general source/first line of any data I create/get/etc.\nI use Rclone to mount a google drive to my different computers and use freefilesync/realtimesync to automate uploading/updating to the gdrive as a backup and so I can free up storage on the main computer.\nThen I have another Windows desktop at another location with a DAS that uses freefilesync to download the folders from gdrive for extra backup.\nI would like to set something up on an unused miniPC that I have with usb3 external DAS to replace the gdrive step in my data flow. This miniPC can be used exclusively for this cloud replacement if needed.\nI do not want to pay for a different cloud service and I am looking for a free/non subscription based setup using my own local hardware.\nAppreciate you reading through this!",
    "comments": []
},
{
    "post_author": "staslandia",
    "post_id": "1dsmdme",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 9:42:09 AM GMT+3",
    "flair_text": "Backup",
    "post_title": "files disappeared ",
    "media": [],
    "post_content": "hi all! I am a photographer who has recently been revisiting old files from 2018-21 to print.\nMY SET UP: I keep files on my desktop and organize/import through Lightroom then I move everything onto an external drive and recently have moved everything onto a raid 1 JBOD tower with a Backblaze continuous backup.\nMY ISSUE: the first time I wanted to print a file it was from 2018 and when I looked through the album it appeared that all my raw files and Lightroom files were there but when I looked for this specific one I cant find it. I looked for it everywhere. I figured this was a flub since this was one of my very first shoots as a pro and maybe I did something on accident. today I was looking for a file from 2021 and same thing - album has what appears to be all raw photos but not this specific one. its super bizarre. There is a chance I deleted it but thats crazy because thats 2 for 2 now and I although my transferring system is a bit clunky and manual, I am super paranoid and usually double check my work before I would randomly delete files\nQUESTION: is there anything else I can do to try to find or recover these files? I have the file names and low res jpgs of them. again theyre pretty old and have been through a couple of transfers now. is there any other reason these files might be missing that isn't because of me? and lastly, what can I keep a look out for that this doesn't happen again?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "Sopel97",
            "score": "3",
            "content": "r/datarecovery most likely overwritten by now though",
            "replies": [
                {
                    "author": "staslandia",
                    "score": "1",
                    "content": "Damn :(",
                    "replies": []
                }
            ]
        },
        {
            "author": "plunki",
            "score": "1",
            "content": "If you have the filenames, everything will find it: https://www.voidtools.com/ Immensely faster and better than windows search. For future, when copying files, use a utility like teracopy that verifies that every copy was completed successfully. (Always copy, never move. You can delete after you are sure the copy worked.) How do you know the specific file you are looking for though? Are there holes in lists of numbered files? Maybe you put it somewhere \"smart\" and then forgot? Hopefully everything finds it.",
            "replies": [
                {
                    "author": "staslandia",
                    "score": "1",
                    "content": "Thank you! Basically I have low res jpegs that I exported and they are there but not in the raw format",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "globogym1",
    "post_id": "1dt7djb",
    "post_score": "16",
    "post_time": "Tuesday, July 2, 2024 at 2:29:17 AM GMT+3",
    "flair_text": "Scripts/Software",
    "post_title": "Need Help With 30,000 Slides",
    "media": [],
    "post_content": "Hey all, longtime listener, first time caller.\nI inherited a collection of about 30,000 35mm slides documenting some very important local history.\nOver the past 5 or so years I’ve gotten scans of most, if not all of them using my Nikon Super Coolscan 4000 with Nikon SF-210 attachment and VueScan.\nRecently I came into possession of another 200 or so slides that fill holes in the original collection of 30,000 slides. I just upgraded to Windows 11, and when I pull up VueScan it no longer detects my scanner. Windows doesn’t see it either.\nI’ve downloaded the most recent drivers for my FireWire card and device manager says the PCIe card is working properly.\nNikon Support told me they no longer support that scanner and therefore no longer have the software available for download.\nDoes anyone here have any advice? I’ve also reached out to Ed Hamerick with VueScan. But I was hoping to hit this from multiple angles to see what works.\nThank you all, I love this community. I’m hopeful someone else can help!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "drahcirm",
            "score": "15",
            "content": "Virtualize an older version of windows on a machine with no network connections, and pass through the scanner from your hypervisor.",
            "replies": [
                {
                    "author": "globogym1",
                    "score": "3",
                    "content": "It’s been probably 10 years since I did anything with VMs. Is there an online guide that you recommend where I could relearn how exactly to do that?",
                    "replies": [
                        {
                            "author": "drahcirm",
                            "score": "2",
                            "content": "This is probably a good place to start, good luck 🤞 https://docs.oracle.com/en/virtualization/virtualbox/6.0/user/user-preface.html",
                            "replies": [
                                {
                                    "author": "globogym1",
                                    "score": "1",
                                    "content": "Thanks, I’ll have a look. Out of sheer curiosity, have you been in this position before and this has worked, or is this a fix based on your knowledge and understanding of how all the various aspects factor together? Either way I appreciate your reply and I’ll do some reading and play with setting up a VM!",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "blacksheepaz",
            "score": "4",
            "content": "Are you a member of the Nikon CoolScan Users group on Facebook? I just joined, and have heard that it is the best discussion group for the technology. It is very active and I think it would be your best bet to troubleshoot.",
            "replies": []
        },
        {
            "author": "DogeshireHathaway",
            "score": "2",
            "content": "VM is the answer. My experience is on unraid but overall it's a simple process to spin up a VM of your chosen version of windows, pass through the relevant devices, and do the work there. Alternatively, downgrade back to your previous setup/version.",
            "replies": []
        },
        {
            "author": "krista",
            "score": "2",
            "content": "look in device manager and see if the firewire card is recognized. i've found w11 hates fw cards.",
            "replies": []
        },
        {
            "author": "OwnRoom2263",
            "score": "2",
            "content": "Try using it on Linux!!",
            "replies": []
        },
        {
            "author": "Student-type",
            "score": "1",
            "content": "Just keep a version of Windows running on decent hardware. A version that works with the hardware interface and software you want to use. Disconnect the internet for safety.",
            "replies": []
        },
        {
            "author": "QSCFE",
            "score": "1",
            "content": "I’ve downloaded the most recent drivers for my FireWire card (...) Nikon Support told me they no longer support that scanner and therefore no longer have the software available for download. then don't install the latest driver but an old version of it, clearly the newest driver dropped this scanner support and windows wouldn't be able to detect it. if that doesn't work then like drahcrim said, install older version of windows on a virtual machine and install an old driver on it. what was the last version of windows the scanner was working on fine before windows 11? windows 10 or windows 7? get iso of that, install it on a VM install the driver on it, plug the scanner and test.",
            "replies": []
        },
        {
            "author": "cajunjoel",
            "score": "1",
            "content": "Having wrangled old hardware onto Windows 10 at work, you have to jump through some real hoops to get the drivers to work. Later versions of Windows require drivers to be signed and Windows won't install them if they aren't. You can turn off that requirement, but it's weird to do and theoretically compromises your system. I'm assuming that your drivers are good but.... Can you see if Device Manager even sees the scanner when it's plugged in and powered on? If you can't see the scanner at all in Windows 11 then a virtual machine, as others have suggested, isn't going to help you. If you CAN see the scanner, then maybe a VM will work. I'd start with Windows 10 and work backwards. The installation of VMWare or VirtualBox is left as an exercise as is the installation of Windows 10 as a guest VM. I don't know how to pass a firewire connection from the host (your bare metal Win11) into the guest (the Win10 VM). USB is very easy, but I assume firewire can be mapped into the VM somehow. You'd install VueScan in Windows 10, of course. I've had to get my own Coolscan V ED working in a Windows 10 VM on a Linux host, but my Coolscan is USB and I jumped through some hoops to get it to work. And I got the original Nikon Scan software to work, which I'm a bit proud of. :) If you get this running, then you can hold onto the Windows 10 VM (it's just a few files, after all) for future needs. I took a 2-year break from scanning and came back to it and picked up where I left off. Well, with a bunch of windows updates to run first.",
            "replies": []
        }
    ]
},
{
    "post_author": "InkyPanthurianDemon",
    "post_id": "1dtscyd",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 9:02:46 PM GMT+3",
    "flair_text": "Backup",
    "post_title": "Dr. Stone Manga Full Download",
    "media": [],
    "post_content": "I want to download the entire Dr Stone manga from free online resources. To my knowledge the only way to successfully complete this task is by saving each panel individually and reconstructing them into a book through another website. The information I need is understanding how to download the contents of the webpage using inspect element on windows. Is that possible?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "lupin-san",
            "score": "2",
            "content": "You can use an app like Mihon to download the chapters if there is an extension for the website you're going grab the images from.",
            "replies": []
        },
        {
            "author": "PaulOPTC",
            "score": "2",
            "content": "https://github.com/dazedcat19/FMD2 FMD2 Load up the website (there’s a whole list) Search for the manga Click download If it fails, then go to a different site and download the chapters that failed Save it as a CBZ (you could also do zip) Then you’ll need a program to read it and host it. Or just read it on your computer. I use Kavita to host it And then paperback on IOS with the Kavita extension to read it It’s seamless, and easy to set up",
            "replies": []
        },
        {
            "author": "EchoGecko795",
            "score": "0",
            "content": "Wrong sub but, https://nyaa.si/ lets you download the already ripped files directly.",
            "replies": [
                {
                    "author": "AshleyUncia",
                    "score": "3",
                    "content": "How have we gone from an era where manga piracy was whole chapters or books, either pirated or scanlated, in easy to torrent zip files, to an era where... Actually all of that is still available, but people prefer an easy ad filled website for direct viewing and they cant' even imagine downloading anything beyond 'right click + save image as' over and over and over again?",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "TheFatLook100",
    "post_id": "1dsef2z",
    "post_score": "3",
    "post_time": "Monday, July 1, 2024 at 2:15:47 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Does anyone know how to use the \"Internet Archive Book Images\" collection? ",
    "media": [
        "https://www.flickr.com/photos/internetarchivebookimages/21300718252/in/dateposted/",
        "https://www.flickr.com/photos/internetarchivebookimages/"
    ],
    "post_content": "So I just discovered the Internet Archive Book Images on Flickr. As I understand, it holds more than 5 million pictures of illustrations taken from books, which is awesome. But I don't understand how to search meaningfully inside such a huge collection. There are no albums, no galleries, and the search function doesn't yield any relevant results. I can't find a way to classify the images thematically. Apparently it's just sorted by \"date uploaded\".\nI guess I could just randomly click on any page and hope I find something useful... but there are 53138 pages. What if I want something specific? What if I want to check a certain category? Maybe there's something about Flickr that I don't understand (as I'm not a regular user)…\nSo, as it is... 5 million images, and nothing but insects.\nHow is this collection supposed to be navigated? Does anyone know?\nThanks!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "cajunjoel",
            "score": "7",
            "content": "I have it on good authority that this collection is a mess. Lol. Take a look at this instead https://www.flickr.com/photos/biodivlibrary/",
            "replies": [
                {
                    "author": "TheFatLook100",
                    "score": "3",
                    "content": "But do people use it or is it pretty much forgotten? Thanks for the suggestion btw!",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "LuckBuff",
    "post_id": "1drug1s",
    "post_score": "14",
    "post_time": "Sunday, June 30, 2024 at 8:37:00 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Virus scanning my 700GB archive of old backup files",
    "media": [],
    "post_content": "Hey,\nI have this backup archive that contains everything from my PC, laptop, phone, etc. It even has files over 10 years old. I'll transfer them to an external hard drive, but I want to make sure that there are no viruses in it because let's say, I wasn't really virus careful 10 years ago.\nI'm looking for something free since it's going to be a one time thorough scan.\nAny recommendations? Thanks!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "dr100",
            "score": "13",
            "content": "The built-in Defender if you have Windows or ClamAV for other platforms (I guess Windows too if you want).",
            "replies": []
        },
        {
            "author": "TakeoChan",
            "score": "2",
            "content": "ESET trial version, it could register with a disposable email ( DeveloperMail etc) Scan the entire drive with administrator",
            "replies": []
        },
        {
            "author": "JeromeZilcher",
            "score": "2",
            "content": "A lot of products have free one-month trials. This site always has good comparison lists: https://www.av-test.org/en/",
            "replies": []
        },
        {
            "author": "JumalJeesus",
            "score": "2",
            "content": "Not exactly sure what you mean by backup archive. If you mean that the files are literally in a single file archive, then you'd have to extract them all first to be able to scan them. What is the threat model that warrants a need to scan them? The reason I am asking is because many people have big misconceptions about how malware works, such as thinking that \"infected files\" could spread on their own. I can't really think of a situation where it would make sense to scan all of those 700 gigabytes. Just copy them over to the external drive, as long as you don't run any executables there is no risk involved.",
            "replies": []
        },
        {
            "author": "niky45",
            "score": "3",
            "content": "malwarebytes has a free version that doesn't do real-time scanning but seems to be very good at doing on-demand scans",
            "replies": [
                {
                    "author": "elNegritoguero",
                    "score": "2",
                    "content": "The trial version does have real time scanning",
                    "replies": []
                }
            ]
        },
        {
            "author": "hlloyge",
            "score": "2",
            "content": "Not really sure if AV will scan 700 GB archive file. And even if it would, how do you propose it removes the threat? By removing the whole archive? :) This will be tedious work, but you'll have to unpack the whole thing, and then sort it out in various folders (ready to be compressed into separate archives!), programs, pictures, by year, however. While you work, current AV will monitor the file and probably catch infected ones. Once you sorted files to multiple folders, scan them all once more with OS AV software, and download multiple offline scanners - there are more than few available. Scan with them, too. Then, compress files into multiple archives, not one gigantic file.",
            "replies": [
                {
                    "author": "niky45",
                    "score": "3",
                    "content": "I'm pretty sure by \"archive\" OP just means \"drive\" and not \"compressed archive\" I mean, who the hell compresses everything.",
                    "replies": []
                },
                {
                    "author": "CryGeneral9999",
                    "score": "1",
                    "content": "It's been a while since I ran a commercial AV but there used to be a \"scan archives\" settings. As long as it wasn't password protected it'd scan the contents.",
                    "replies": []
                },
                {
                    "author": "ASatyros",
                    "score": "1",
                    "content": "In theory you can mount the archive file, but I forgot the name of the software 😅 Then you can run it. On the other note, I would use Virtual Disk for this, or not even archive it in the first place, but that depends on the data type. Videos and images are already compressed for example.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Fragtrap007",
            "score": "1",
            "content": "Malewarebytes is ok i think",
            "replies": []
        }
    ]
},
{
    "post_author": "shrine",
    "post_id": "exdka0",
    "post_score": "3957",
    "post_time": "Sunday, February 2, 2020 at 1:14:43 AM GMT+3",
    "flair_text": "",
    "post_title": "The Coronavirus Papers unlocked: 5,352 scientific articles covering the coronavirus - fully searchable and free.",
    "media": [
        "https://www.nytimes.com/2015/04/08/opinion/yes-we-were-warned-about-ebola.html",
        "https://www.washingtonpost.com/science/2020/01/24/scientists-are-unraveling-chinese-coronavirus-with-unprecedented-speed-openness/",
        "https://www.reddit.com/r/scihub/",
        "https://the-eye.eu/",
        "https://the-eye.eu/public/Papers/CoronaVirusPapers/",
        "https://searchin.the-eye.eu/?i=Coronavirus",
        "https://www.reddit.com/r/DataHoarder/",
        "https://docs.google.com/spreadsheets/d/1bzbVkKhxgiCwuzSh9hMyOMx1PIDJFWlaYUToHCze6C4/edit#gid=0",
        "https://www.elsevier.com/connect/coronavirus-information-center",
        "https://www.reddit.com/r/Coronavirus/comments/feo68j/humanity_wins_our_fight_to_unlock_32544_covid19/",
        "https://ipfs.io/ipfs/bafykbzaced4xstofs4tc5q4irede6uzaz3qzcdvcb2eedxgfakzwdyjnxgohq/",
        "https://www.reddit.com/r/libgen/",
        "https://secure.wiley.com/Coronavirus2020",
        "https://the-eye.eu/CoronaVirusPapers/",
        "https://sci-hub.tw/",
        "https://the-eye.eu/donate/",
        "https://www.reddit.com/r/seedboxes/",
        "https://the-eye.eu/CoronaVirusPapers/coronaviruspapers.torrent"
    ],
    "post_content": "2020-04-15 update: the-eye.eu is temporarily down, but the de-centralized Interplanetary File System (IPFS) link remains up.\nNote, publishers have made most Coronavirus articles free as of March 6th 2020.\nVisit r/libgen and r/scihub to join the open science revolution.\nAccess\nArticle listing / Links\nOpen Directory\nFull-text Search\nTorrent\nInterPlanetary File System\nInformation\nIn a 2015 New York Times op-ed the chief medical officer of Liberia argued that the Ebola pandemic responsible for the loss of over 2,200 lives could have been prevented if not for a paywall blocking access to an article from 1982. Dividing the world’s scientists with a paywall in the middle of a global humanitarian crisis is an unacceptable and unforgivable act of criminal greed. In the developing world the price for a single article can amount to as much as half a week’s salary for a physician. A few days ago, I found an early-release coronavirus article with a $35.95 access fee for non-subscribers. The fury I felt brought tears to my eyes.\nMe and a few friends share that fury, so we gathered a collection of five-thousand scientific studies covering any article title containing “coronav*” from 1968-2020. The scope of the papers spans not only the 7 human coronaviruses, but up to 40 other Coronaviridae family strains. The Ebola virus showed us that every study counts. We are on the first step towards compiling a complete open-access Coronaviridae research catalog for the world’s scientists, journalists, and virology experts to draw from to fight the virus and save lives.\nOur project is illegal, but it’s the right thing to do in this crisis. We refuse to put copyright before human lives. Sharing everything we know about the virus is essential, which is why international scientists are openly sharing their coronavirus findings in an unprecedented way. Developing-world scientists often work without article access due to complex and expensive contract agreements between publishers, universities, and hospitals, relying on overseas colleagues to help them hunt down PDF files. The virus is not going to wait for this, so we need to act with conviction, now.\nTo their credit, publishers made a few dozen papers open-access in the last few days, which you can find over at Elsevier’s Novel Coronavirus Information Center and Wiley’s Coronavirus collection. While Wiley is slating to shut down their collection in April, our collection won’t be shutting down anytime soon. We’re going to keep growing to help our scientists out, and you can help us complete the catalog by identifying any papers we missed. All extant Coronaviridae research, accessible in seconds, by any scientist in the world. It’s the least we can do to help.\nMethodology\nHow did we do it?\nWe scanned Sci-Hub's 80 million title collection for the coronavirus, then we extracted the titles and Digital Object Identifiers (DOI) to an index, and exported the PDF files to upload them to The-Eye.eu’s full-text search repository.\nHow can I help?\nWe always need developers. You can also help us identify new articles by joining our team spreadsheet here. Request access and you can begin adding new article titles to the list. You can also help share word of the collection with the scientific community by reaching out to journalists.\nWho is helping us?\nOur brave host is The-Eye.eu, a “non-profit, community driven platform dedicated to the archiving and long-term preservation of any and all data,” making this project just one of the many public access preservation projects they stand behind. You can aid projects like this one by donating toward their server bills.\nA thank you to Sci-Hub and Library Genesis.\nLast year communities across reddit (including r/seedboxes and r/DataHoarder) came together in a mission to secure and preserve Sci-Hub and Library Genesis, collectively the two largest free and open non-profit library collections in the world: Sci-Hub’s 80-million scientific article database that made this project possible, and LibGen’s 2.5-million scientific-book collection. The libraries fulfill United Nations world development goals mandating the removal of restrictions on access to science, and they serve developing world doctors, academic researchers, and other experts in society with the knowledge they need to build a better world. Keeping these libraries open and thriving means saving lives, educating the world, and providing invaluable science to humanity’s global experts.\nThank you to everyone involved in the project, The-Eye.eu for their support, and to all the scientists around the world working on behalf of humanity today.",
    "comments": [
        {
            "author": "spicy45",
            "score": "178",
            "content": "This post gives me Aaron Schwartz vibes! (R.I.P)",
            "replies": [
                {
                    "author": "TeamedOranger",
                    "score": "41",
                    "content": "Right?? Respect",
                    "replies": []
                },
                {
                    "author": "brainhack3r",
                    "score": "22",
                    "content": "RIP Aaron... I new Aaron for about ten years and still think about him ever 1-2 weeks...",
                    "replies": [
                        {
                            "author": "shrine",
                            "score": "14",
                            "content": "I love that his name and memory are part of this ongoing story and fight for open access.",
                            "replies": []
                        },
                        {
                            "author": "_villainsgottavill_",
                            "score": "4",
                            "content": "RIP, if only he knew how much Steve and Alexis had to sell out when they bought their company back just to keep getting their precious funding etc. 😔 but this post makes Reddit still a good thing I think.",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "[deleted]",
                    "score": "19",
                    "content": "That's what I'm saying.",
                    "replies": []
                },
                {
                    "author": "semafore",
                    "score": "10",
                    "content": "Aaron Schwartz would be proud. RIP homie.",
                    "replies": []
                },
                {
                    "author": "adidapizza",
                    "score": "4",
                    "content": "A true patriot murdered by the U.S. Government. RIP",
                    "replies": []
                }
            ]
        },
        {
            "author": "gidoBOSSftw5731",
            "score": "67",
            "content": "Threw it on my torrent box, it'll sit there until I fuck it up again, but my connection is limited by my VPN. EDIT: Cant/too lazy to torrent? Here's an https mirror: https://imagen.click/i/613336.zip This should be fast, on my home gigabit I got 100mbps but you could pull more if you had a good enough link. \"But isnt this mirrored in 5 other places?\" Yes, but they're big targets for DMCA, I'm just a guy, so hopefully I'll be a smaller target.",
            "replies": []
        },
        {
            "author": "[deleted]",
            "score": "83",
            "content": "Ethics in this outweighs any sort of legal precedent that rules this as illegal. You have my utmost support. Thank you.",
            "replies": []
        },
        {
            "author": "EchoGecko795",
            "score": "76",
            "content": "I added the torrent to my seedbox, will seed for 60+ days, then on my home connection until I stop.",
            "replies": []
        },
        {
            "author": "-Archivist",
            "score": "1",
            "content": "Article. https://www.vice.com/en_us/article/z3b3v5/archivists-are-bypassing-paywalls-to-share-studies-about-coronaviruses",
            "replies": []
        },
        {
            "author": "jamesckelsall",
            "score": "121",
            "content": "The virus is not going to wait for this Unless you have one or more studies to back this up, I am not sure you should be stating it as fact. You don't know that the virus won't wait. It could develop patience. Seriously though, good on you for this. Free and easy access to this research could potentially save lives.",
            "replies": [
                {
                    "author": "shrine",
                    "score": "70",
                    "content": "You had me going for a second. At least I'd have my citations to back me up :)",
                    "replies": []
                }
            ]
        },
        {
            "author": "makeworld",
            "score": "54",
            "content": "I tried to mirror it on the Internet Archive, but it got marked as spam... I'll email them and hopefully you guys can gain another mirror. Edit: I tried again just now it and it worked! There is now a mirror on IA: https://archive.org/details/coronaviruspapers",
            "replies": []
        },
        {
            "author": "severanexp",
            "score": "47",
            "content": "Guys, this is what bit torrent was made for. Like, literally. Data hoarders, unity! Put a torrent up with this and I'll share it. Good luck putting this down then!",
            "replies": [
                {
                    "author": "shrine",
                    "score": "28",
                    "content": "Godspeed, torrent! It's the 4th link: https://the-eye.eu/CoronaVirusPapers/coronaviruspapers.torrent",
                    "replies": []
                }
            ]
        },
        {
            "author": "[deleted]",
            "score": "",
            "content": "Brings me a smile every time his name comes up in our threads. A lifelong pursuit for the freedom of science, proud to have a small part in helping carry that mission forward.",
            "replies": [
                {
                    "author": "shrine",
                    "score": "26",
                    "content": "Brings me a smile every time his name comes up in our threads. A lifelong pursuit for the freedom of science, proud to have a small part in helping carry that mission forward.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Elocai",
            "score": "23",
            "content": "Is this even illegal? The producers of the work are free to share their work as they want to, they have to publish their work, but I don't think they are legally bound to that publisher. Not a lawyer, but I guess if the scientist would give an ok than it's fine",
            "replies": [
                {
                    "author": "jarfil",
                    "score": "30",
                    "content": "",
                    "replies": []
                },
                {
                    "author": "binkarus",
                    "score": "24",
                    "content": "Illegal enough that the US government and the US Attorney of Massachusetts thought it was worth dogmatically pursuing Aaron Schwartz until he committed suicide.",
                    "replies": []
                },
                {
                    "author": "shrine",
                    "score": "20",
                    "content": "True. Almost any scientist would give their OK, and do - we see this with researchgate and email requests. But that approach only gets the world's scientists so far - it doesn't scale, particularly not for papers from the 1980s. The complaints come from the publishers who profit from a closed-access model, not from the scientists whose goal and dream was only to share their work with as many people as ever wanted to read it, forever.",
                    "replies": []
                },
                {
                    "author": "[deleted]",
                    "score": "20",
                    "content": "Yes it's illegal, but it should be done. It's what Aaron Swartz believed in and what he died for. RIP it's great to see his legacy lives on in these people.",
                    "replies": []
                }
            ]
        },
        {
            "author": "TotesMessenger",
            "score": "21",
            "content": "I'm a bot, bleep, bloop. Someone has linked to this thread from another place on reddit: [r/china_flu] The Coronavirus Papers unlocked: 5,352 scientific articles covering the coronavirus - fully searchable and free. If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads. (Info / ^Contact)",
            "replies": []
        }
    ]
},
{
    "post_author": "evanMeaney",
    "post_id": "ffjfj4",
    "post_score": "9129",
    "post_time": "Monday, March 9, 2020 at 12:24:36 AM GMT+3",
    "flair_text": "Question?",
    "post_title": "I just built a collapse-ready laptop. What are some must haves to put on it?",
    "media": [
        "https://preview.redd.it/b26egpzenil41.png?width=640&crop=smart&auto=webp&s=fe9ddce213064ff8dc977b4820018e22205ad1f7",
        "https://i.redd.it/b26egpzenil41.png"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "DDzwiedziu",
            "score": "659",
            "content": "A hand crank, for the only power source available when locked up in your bunker :P",
            "replies": [
                {
                    "author": "evanMeaney",
                    "score": "273",
                    "content": "Solid idea. I was thinking about one of those gravity generators too.",
                    "replies": [
                        {
                            "author": "bp332106",
                            "score": "108",
                            "content": "What’s a gravity generator?",
                            "replies": [
                                {
                                    "author": "evanMeaney",
                                    "score": "131",
                                    "content": "Something modified from the idea behind the gravity light. http://www.windup-battery.com/diy/diy-gravity-lightgravity-generator",
                                    "replies": []
                                },
                                {
                                    "author": "edge_hog",
                                    "score": "33",
                                    "content": "It's too keep you from floating away when the gravity goes out",
                                    "replies": []
                                },
                                {
                                    "author": "DDzwiedziu",
                                    "score": "17",
                                    "content": "Same here. Does it relate to a thermal water pump somehow? [1] A quick search is too close too quackery for comfort (\"free energy\" red flag appears on the first page). [1] https://www.youtube.com/watch?v=DiFqgiRnNFI",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "6bytes",
                            "score": "3",
                            "content": "Thing is a hand crank doesn’t generate a lot of power so you’d need a decent-size Battery which doesn’t seem could fit in your (awesome!) current setup. Perhaps better energy sources would be Solar or a Generator.",
                            "replies": [
                                {
                                    "author": "evanMeaney",
                                    "score": "4",
                                    "content": "I'm thinking solar is the main way forward, with a backup being a handcrank and external battery.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "IchBinMaia",
                            "score": "2",
                            "content": "Nah, I want an anti-gravity machine, like the one at Toby's going away party",
                            "replies": [
                                {
                                    "author": "evanMeaney",
                                    "score": "2",
                                    "content": "Do you mean anti-depressants? Because I can put you through to someone for that?",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "minetruly",
                            "score": "1",
                            "content": "Foot pedal is another possibility. You can also get solar panels for the first couple years. How long will the rechargable battery last?",
                            "replies": []
                        },
                        {
                            "author": "Eggman8728",
                            "score": "1",
                            "content": "This thing is pretty thick, you could probably include some decent solar panels inside to power this and some other small devices.",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "[deleted]",
            "score": "",
            "content": "I grabbed Wikipedia via the Kiwix project. https://www.kiwix.org/en/downloads/kiwix-serve/ It can even act like a server on an improvied LAN.",
            "replies": [
                {
                    "author": "evanMeaney",
                    "score": "323",
                    "content": "I grabbed Wikipedia via the Kiwix project. https://www.kiwix.org/en/downloads/kiwix-serve/ It can even act like a server on an improvied LAN.",
                    "replies": []
                }
            ]
        },
        {
            "author": "10leej",
            "score": "310",
            "content": "Cooking recipes using locally sourced ingredients Generic Survival guide stuff Butchering tips",
            "replies": []
        },
        {
            "author": "Balance-",
            "score": "511",
            "content": "Offline maps. Preferably road as well as terrain maps",
            "replies": []
        },
        {
            "author": "[deleted]",
            "score": "182",
            "content": "Nintendo emulators",
            "replies": [
                {
                    "author": "evanMeaney",
                    "score": "201",
                    "content": "Won't the apocalypse be hard enough without BattleToads?",
                    "replies": []
                }
            ]
        },
        {
            "author": "therobnzb",
            "score": "343",
            "content": "once you've settled on it, then an entire second one of whatever it is, kept somewhere else. two is one. one is none.",
            "replies": []
        },
        {
            "author": "DazedWithCoffee",
            "score": "160",
            "content": "A LoRa WAN connection, along with some small separate devices to act as nodes. Having long range wireless network capabilities might be useful, for sensing, communications, alarm systems, etc. would require some custom manufacturing though",
            "replies": []
        },
        {
            "author": "evanMeaney",
            "score": "671",
            "content": "This was inspired by an awesome project from u/back7co which many of you may have seen. https://back7.co/home/raspberry-pi-recovery-kit After loading on an offline Wikipedia and Wikivoyage server, what else should this have to survive with no internet/electricity/cell service? Open to any and all thoughts.",
            "replies": [
                {
                    "author": "[deleted]",
                    "score": "401",
                    "content": "Photovoltaic cells.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Lost4468",
            "score": "377",
            "content": "LVDS and/or eDP converter to whatever input it uses. So if the screen breaks/dies you can easily resource one from random broken equipment. A backup mouse or touchpad, I know it has a touchscreen, but if that breaks you'd have to use the keyboard, and if that breaks as well you're SoL. Solar panels. The ability to use a wide ranger of input power. Wide voltage range, can use low current, messy unstable power, AC as well as DC, etc. Redundant storage + backup storage. GPS, maybe satellite internet/communication? Minecraft for when you're bored after the apocalypse. The ability to receive AM and FM. Maybe the ability to send AM? Large separate/internal battery pack. Some sort of locator type beacon? In-case it's stolen or lost?",
            "replies": [
                {
                    "author": "evanMeaney",
                    "score": "145",
                    "content": "The LVDS is a really good call. Thanks! I keep a backup mouse and rollable keyboard with it, along with some extra power equipment (I outlined it in a comment above). As for storage, would you think a flash drive is enough or would you take it in a different direction. There are some raspberry pi projects with HAM radio. That might be a great next step. Thanks for the ideas!",
                    "replies": []
                }
            ]
        },
        {
            "author": "Balance-",
            "score": "159",
            "content": "Offline Dictionaries, translation and speech recognition software. Being able to read foreign manuals and speak with foreigners can be essential. https://voice.mozilla.org/ is a nice start for the voice part",
            "replies": []
        },
        {
            "author": "Romenhurst",
            "score": "146",
            "content": "You should write a guide to keep with this (printed) detailing: How to build another full unit and clone data to them. Suitable alternatives if parts are unavailable. How to assemble and dismantle the unit, notes for repair. The OS configuration & included software, where to find an extended digital guide in the data store Also stockpile backups for important components that are hard to come by in the first place. (Like the screen, battery, RPi, etc.)",
            "replies": []
        },
        {
            "author": "InfiniteSpaceIPH",
            "score": "67",
            "content": "Tetris",
            "replies": []
        },
        {
            "author": "NYSenseOfHumor",
            "score": "67",
            "content": "Keyboard letters.",
            "replies": []
        }
    ]
},
{
    "post_author": "Towbee",
    "post_id": "1dtrnul",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 8:33:53 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Just bought my first big boy drives, isn't this supposed to be on the drive and not the outside?",
    "media": [
        "https://i.redd.it/c5s9pvti55ad1.jpeg",
        "https://preview.redd.it/just-bought-my-first-big-boy-drives-isnt-this-supposed-to-v0-c5s9pvti55ad1.jpeg?width=640&crop=smart&auto=webp&s=8bbf9459ffd17c6cdeea678668b0f3787e0643b9"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "curtisjk",
            "score": "8",
            "content": "No this is the SKU sticker from SCAN. It has nothing to do with the manufacturer warranty.",
            "replies": [
                {
                    "author": "lurkingstar99",
                    "score": "1",
                    "content": "But do you have to keep the sticker and the box or something?",
                    "replies": []
                }
            ]
        },
        {
            "author": "Middle_Inside9346",
            "score": "2",
            "content": "Ha I could tell that was a sticker from Scan :) Must be the font.",
            "replies": []
        },
        {
            "author": "Kltpzyxmm",
            "score": "2",
            "content": "lol",
            "replies": []
        },
        {
            "author": "ImmaNobody",
            "score": "1",
            "content": "Remove the drive from the box and warranty goes poof!",
            "replies": [
                {
                    "author": "jmegaru",
                    "score": "2",
                    "content": "Don't give them ideas m8, next time they will seal the box with the warranty sticker 😱",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "Maratocarde",
    "post_id": "1dt4sbn",
    "post_score": "60",
    "post_time": "Tuesday, July 2, 2024 at 12:35:46 AM GMT+3",
    "flair_text": "News",
    "post_title": "Internet Archive presented their case before the Courts. What are their chances?",
    "media": [],
    "post_content": "",
    "comments": [
        {
            "author": "diamondsw",
            "score": "22",
            "content": "I wouldn't have expected they'd have a chance, but we'll see - the court was tentatively receptive to the arguments. This is why IANAL.",
            "replies": []
        },
        {
            "author": "Maratocarde",
            "score": "11",
            "content": "About this new development: https://arstechnica.com/tech-policy/2024/06/appeals-court-seems-lost-on-how-internet-archive-harms-publishers/ This Youtube video is based on the Oral Arguments presented by IA in their appeal case: https://www.courtlistener.com/docket/67801014/hachette-book-group-inc-v-internet-archive/ The judges asked a few questions to the lawyer, you can heard all of it in this video. It seems they can rule about the appeal at any moment, now... For those that don't know, IA lost before: https://time.com/6266147/internet-archive-copyright-infringement-books-lawsuit/",
            "replies": []
        },
        {
            "author": "TheFumingatzor",
            "score": "4",
            "content": "Approaching nil.",
            "replies": []
        },
        {
            "author": "VaksAntivaxxer",
            "score": "4",
            "content": "The circuit court hearing arguments for 90 minutes indicates that they think the argument is serious. The IA is clearly pushing the limits of what fair use can justify and I don't think they will win. However libraries providing creating copies of works for their users is not completely unprecedented, in Williams & Wilkins Co. v. United States the Court of Claims held that providing photocopies of journal articles was fair use, the supreme court was equally divided on the issue.",
            "replies": []
        },
        {
            "author": "Far_Marsupial6303",
            "score": "3",
            "content": "What are their chances? While it's interesting to follow, I don't get why people think that this is near any end. It doesn't matter if they get the judgement overturned or not. As the article says and I've been saying since this started, it will almost inevitably be appealed up to the Supreme Court, where it will probably takes years. The only wild card is that the Supreme Court may push it back down to the local appeals court's ruling. Bottom line is, these are only battles and the winner is far from being declared.",
            "replies": []
        },
        {
            "author": "Known_Investigator_9",
            "score": "1",
            "content": "I wonder if this somehow gets up to the Supreme Court, if it could cause major change with copyright law since the cheveron deference was just overturned. I also wonder if that would be a good or bad thing.",
            "replies": [
                {
                    "author": "GagOnMacaque",
                    "score": "1",
                    "content": "Copyright rules are already under fire. The copyright office pretty much has those rules up for debate.",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "xxmcgriddlexx",
    "post_id": "1dsmu2u",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 10:12:41 AM GMT+3",
    "flair_text": "Guide/How-to",
    "post_title": "External Hard Drive Issues",
    "media": [],
    "post_content": "hi! so i’ve been playing sims for a very long time and i would use my macbook but after a while and a bunch of mods later i decided to which my game and mods on an external hard drive. now i want to log back into my game and for some reason the external hard drive isn’t showing up (note: the light on it still turns on and i’ve already used two cords to try and connect it) i recently invested in a pc and wanted to transfer my files over but it’s still not showing up. the drive i have is the seagate 2tb usb 3.0 can anyone who plays on an external hard drive help me with this issue or direct me to somewhere or someone that can help me. thanks! :)",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "wiideathmod",
            "score": "2",
            "content": "1 question 2 awnsers Q.(Sorry if this sounds rude or mean) but why were you playing games from a external hdd and not internal mac ssd load times would have been faster A.get a 3.5 enclosure off ebay or Amazon take the hdd out of the current enclosure and put it in the new one if that works make a back up ie 3-2-1 look it up if you don't know what it is A. Is the external in exfat or mac os native expat is readable easier to pay a recovery service to get the data back (the cost could be 1000 and up to 8000 depending on who you go to at that cost start from scratch and do the 3-2-1if the saves are important) if in mac os native you are pretty much sol",
            "replies": []
        }
    ]
},
{
    "post_author": "babelfishery",
    "post_id": "10rj691",
    "post_score": "3790",
    "post_time": "Thursday, February 2, 2023 at 9:40:44 AM GMT+3",
    "flair_text": "News",
    "post_title": "Twitter will remove free access to the Twitter API from 9 Feb 2023. Probably a good time to archive notable accounts now.",
    "media": [
        "https://i.redd.it/jz68m9omirfa1.png",
        "https://preview.redd.it/twitter-will-remove-free-access-to-the-twitter-api-from-9-v0-jz68m9omirfa1.png?width=640&crop=smart&auto=webp&s=6938a61fe6749a0fcfa61155e9657155144f7524"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "t3h",
            "score": "220",
            "content": "You can always use the OAuth keys from the official Twitter apps to access the API, rather than your own API keys: https://gist.github.com/shobotch/5160017 I wonder if this'll still work post API shutdown...",
            "replies": []
        },
        {
            "author": "00Koch00",
            "score": "1246",
            "content": "I literally want to know the thought process that made them think that monetize it was a good idea, instead of an instant kill for every good bot in existence, meanwhile malicious bot would gladly pay for this because they will make even more money ... This has to be one of the most idiotic thing that Musk did this week...",
            "replies": []
        },
        {
            "author": "insanelygreat",
            "score": "932",
            "content": "In the late 2000s/early 2010s, the Twitter API was basically the \"Hello World\" of REST APIs. So many engineers' first contact with HTTP outside of a browser was building something that talked to it. How far they've fallen.",
            "replies": [
                {
                    "author": "Luke123halley",
                    "score": "151",
                    "content": "I remember my first assignment in college was to make an led blink every-time a certain word was tweeted - time flys 😢",
                    "replies": []
                }
            ]
        },
        {
            "author": "pmjm",
            "score": "468",
            "content": "Wow. Talk about killing your platform. Basically anything that programmatically integrates with Twitter is dead in a week. If you really want to get people to abandon your social network, this is how you do it.",
            "replies": []
        },
        {
            "author": "projectingwhip",
            "score": "38",
            "content": "will front-ends like https://nitter.net be affected by this?",
            "replies": [
                {
                    "author": "Forcen",
                    "score": "41",
                    "content": "\"very unlikely\" https://github.com/zedeus/nitter/issues/783",
                    "replies": []
                }
            ]
        },
        {
            "author": "Mr_Viper",
            "score": "201",
            "content": "This is insane. I'm in the middle of writing a fun discord bot for a server in in, that uses the Twitter API. So that's just gonna be gone now? No fucking way I'll pay for that",
            "replies": []
        }
    ]
},
{
    "post_author": "Odd-Contract-4501",
    "post_id": "1dsey6p",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 2:41:40 AM GMT+3",
    "flair_text": "Backup",
    "post_title": "Friends, Does the SEAGATE EXOS X18 ENTERPRISE works on normal PCS?",
    "media": [],
    "post_content": "So, i found a store selling this HDD for a pretty cheap price in my country, and i need a lot of storage, so i was wondering if i can use this 18TB HDD on a normal pc since i dont have a interprise pc, is not to be using every time, just to store my things in one place and dont stress about size anymore. I saw a guy here on reddit saying that some HDDs will ask for abusiness license before they store my data, this one is going to ask this thing? Thanks!!!!!!",
    "comments": [
        {
            "author": "BmanUltima",
            "score": "2",
            "content": "I saw a guy here on reddit saying that some HDDs will ask for abusiness license before they store my data That's not a thing. If it's the SATA version, it'll work like any other SATA storage drive.",
            "replies": [
                {
                    "author": "Odd-Contract-4501",
                    "score": "1",
                    "content": "Ok, hope that i can use normally, i will buy one and see",
                    "replies": [
                        {
                            "author": "uluqat",
                            "score": "3",
                            "content": "Make sure it is SATA and not SAS; if it is SAS, you need a SAS controller card to make it work in a normal PC.",
                            "replies": [
                                {
                                    "author": "Odd-Contract-4501",
                                    "score": "1",
                                    "content": "Sure, i will search for this, thank you a lot!!!",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "WikiBox",
            "score": "1",
            "content": "As long as it is a SATA drive, it is just like any other SATA drive. Check if the cheap drive is refurbished. You don't want that to be a surprise...",
            "replies": []
        },
        {
            "author": "snatch1e",
            "score": "1",
            "content": "As it was said, it is just as any other drive nothing specific. Just make sure, that you will be able to connect your drive to your machine.",
            "replies": []
        }
    ]
},
{
    "post_author": "123ranchdressing",
    "post_id": "1dt24p9",
    "post_score": "1",
    "post_time": "Monday, July 1, 2024 at 10:46:14 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Trying to scrape images from a large Fandom wiki, either from Wayback Machine or another method",
    "media": [
        "http://web.archive.org/cdx/search/cdx?url=[url"
    ],
    "post_content": "Hi all, I want to preface by saying that I am NOT A CODER and this is basically my only experience using command prompts, so please ELI5. I’ve tried a couple different things and none of them have worked.\nFandom images are all hosted on static.wikia.nocookie.net/[wiki name here]/ and I was able to find them on Wayback Machine under this domain, all being listed as image files. I put this into the Wayback Machine Downloader, however, all of these images downloaded as index.html files with a bunch of random code/text and no images. No clue why.\nSo then, I was able to find a list of image links by using http://web.archive.org/cdx/search/cdx?url=[url name here]*&output=txt. I tried to insert this list into JDownloader to download current versions, and for a smaller wiki, it worked like a charm, but for a larger one (roughly 100k links), nothing worked. I couldn’t copy and paste the links into the pop up box for links, I couldn’t drag the links, I couldn’t drag a txt file with the links— it would freeze for a second, then go on like nothing happened.\nWhere do I go from here? Any advice would be helpful. Thank you!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "JSouthGB",
            "score": "2",
            "content": "Have you tried any browser extensions? Here's a couple for Firefox. Web Scraper and Download All Images",
            "replies": []
        },
        {
            "author": "TheSpecialistGuy",
            "score": "1",
            "content": "Use wfdownloader instead, just drag and drop the links on it, I'm sure it can handle more than 100k links. I too noticed it can be an issue for other apps when the links is that much.",
            "replies": []
        }
    ]
},
{
    "post_author": "Chaychi09",
    "post_id": "1dtoq2p",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 6:33:15 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Asking about buying a hdd enclosure for extra storage.",
    "media": [],
    "post_content": "Is it ok to buy hdd enclosure for data storage? I'm not gonna run it 24/7. My plan is to use it while i'm using my computer. Is it my data secure enough with hdd enclosure that is not running 24/7. I'm new to this, and nas is very expensive. Thank you in advance.",
    "comments": [
        {
            "author": "Far_Marsupial6303",
            "score": "2",
            "content": "Data security is encryption. Longevity and reliability is backups, plural. Ideally at least two sets with one offsite, physical or cloud in case of a local catastrophe. Mantra: Any storage device/media can fail at any time for any reason, with or without notice. The only solution is proper backups. A single drive enclosure are that they usually run hotter than a multi-drive one because of poor airflow. Get a good quality aluminum enclosure, ideally with a fan, bigger is better. Alternately or in addition, use a small USB fan blowing across the case for additional cooling. At some level, you're increasing the likelihood of drive failure by turning it on and off because all electronic and mechanical devices are most stressed and likely to fail at startup. But as long as you're not continually turning the drive on/off multiple times a day, the lifespan difference should be negligible.",
            "replies": []
        },
        {
            "author": "AngelOfDeath6-9",
            "score": "0",
            "content": "yes. it’s just how external drives work",
            "replies": [
                {
                    "author": "Far_Marsupial6303",
                    "score": "1",
                    "content": "??? Externals can be left on 24/7. Just as a NAS or DAS can be turned off when not in use.",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "retrorays",
    "post_id": "1dsilza",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 5:53:24 AM GMT+3",
    "flair_text": "Backup",
    "post_title": "Best way to backup data - securely? ",
    "media": [],
    "post_content": "I have a two Western Digital 10TB USB drives, and two mobile (thin form factor) Western Digital 2TB drives.\nI have ~2TB of data that is backed up on the two mobile 2TB drives as it was convenient. The images are identical. I use WDs password system to protect the drives. I'm not using the two large 10TB USB drives for anything useful.\nI used to have cloud backup as well but decided that wasn't worth the cost/hassle. I may go back to cloud in the future.\n--\nI'd like to clean this up to make it more secure, and provide the best possible reliabillity. I'd like to move my backup solution to the large 10TB USB drives and use the mobile drives for somethign else.\nI was thinking to do the following:\nMove the 2TB+ of data to each 10TB USB drive. Mirror the same data on each drive.\nUse bitlocker to secure the data. One concern is if the drive has a small corruption could this break the entire bitlocker image? In that case should I have separate bitlocker regions on the USB drive?\nIs there a better way to do this? Are there any other steps I should take?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "snatch1e",
            "score": "4",
            "content": "I'd like to clean this up to make it more secure, and provide the best possible reliabillity. Encrypted backups and immutable storage are the way to achieve security on backups. You can use s3 compatible storage for cloud backups. For example, Backblaze b2, Wasabi and etc. https://wasabi.com/cloud-object-storage/s3-object-lock For Veeam, you can go with Linux Hardened Repo, which will give you immutable storage on your machine. https://www.veeam.com/blog/immutable-backup-solutions-linux-hardened-repository.htmlPrebuilt options can be used like this: https://www.starwindsoftware.com/blog/starwind-vsan-as-hardened-repository-for-veeam-backup-and-replication Also, you need to make sure your backups are encrypted, it can be configured in your backup software. You can keep your backup box disconnected from the network by disabling network adapter when backups are not running. You can schedule it via cron or task scheduler. For external drives, bitlocker is a go, you can also encrypt your backups.",
            "replies": [
                {
                    "author": "retrorays",
                    "score": "1",
                    "content": "Awesome thanks. Is veracrypt also good? The other fellow advised against a closed source solution like bitlocker",
                    "replies": []
                }
            ]
        },
        {
            "author": "Ill_Energy7165",
            "score": "2",
            "content": "I wouldn't use bitlocker tbh as it is closed source proprietary software. Instead I would recommend VeraCrypt. It is a opensource encryption program that even allows you to encrypt the whole drive. You also have many encryption options and it is available on macos and linux if there is ever need to access it from elsewhere. For the copying itself with this many data, I would maybe consider not just using Ctrl C + Ctrl V, but some software that verifies the data, such as Rclone or TeraCopy",
            "replies": [
                {
                    "author": "retrorays",
                    "score": "1",
                    "content": "Thanks. I used veracrypt before..I liked it, but thought bitlocker might be a bit better because Microsoft supports it. Guess not ;)",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "shrine",
    "post_id": "nc27fv",
    "post_score": "8419",
    "post_time": "Friday, May 14, 2021 at 9:42:04 AM GMT+3",
    "flair_text": "SEED TIL YOU BLEED!",
    "post_title": "Rescue Mission for Sci-Hub and Open Science: We are the library.",
    "media": [
        "https://seedbox.io/",
        "http://libgen.fun/",
        "https://www.theverge.com/2021/1/8/22220738/twitter-sci-hub-suspended-indian-court-case",
        "https://phillm.net/torrent-health-frontend/stats-filtered-table.php?propname%5B%5D=seeders&comp%5B%5D=%3C&value%5B%5D=12&propname%5B%5D=type&comp%5B%5D===&value%5B%5D=scimag",
        "https://www.vice.com/en/article/pa7jxb/archivists-are-trying-to-make-sure-a-pirate-bay-of-science-never-goes-down",
        "https://sci-hub.do/",
        "https://www.reddit.com/r/datahoarder/",
        "https://www.eff.org/deeplinks/2021/05/activists-mobilize-fight-censorship-and-save-open-science",
        "https://libgen.fun/",
        "https://www.reddit.com/r/Coronavirus/comments/feo68j/humanity_wins_our_fight_to_unlock_32544_covid19/",
        "https://en.wikipedia.org/wiki/Aaron_Swartz",
        "https://github.com/freereadorg/awesome-libgen",
        "http://libgen.rs/scimag/repository_torrent/",
        "https://www.vice.com/en/article/z3b3v5/archivists-are-bypassing-paywalls-to-share-studies-about-coronaviruses",
        "https://en.wikipedia.org/wiki/Alexandra_Elbakyan",
        "https://www.nforce.com/",
        "https://www.reddit.com/r/seedboxes/",
        "https://twitter.com/ringo_ring/status/1390782451140767749",
        "https://www.reddit.com/r/scihub/"
    ],
    "post_content": "EFF hears the call: \"It’s Time to Fight for Open Access\"\nEFF reports: Activists Mobilize to Fight Censorship and Save Open Science\n\"Continuing the long tradition of internet hacktivism ... redditors are mobilizing to create an uncensorable back-up of Sci-Hub\"\nThe EFF stands with Sci-Hub in the fight for Open Science, a fight for the human right to benefit and share in human scientific advancement. My wholehearted thanks for every seeder who takes part in this rescue mission, and every person who raises their voice in support of Sci-Hub's vision for Open Science.\nRescue Mission Links\nQuick start to rescuing Sci-Hub: Download 1 random torrent (100GB) from the scimag index of torrents with fewer than 12 seeders, open the .torrent file using a BitTorrent client, then leave your client open to upload (seed) the articles to others. You're now part of an un-censorable library archive!\nInitial success update: The entire Sci-Hub collection has at least 3 seeders: Let's get it to 5. Let's get it to 7! Let’s get it to 10! Let’s get it to 12!\nContribute to open source Sci-Hub projects: freereadorg/awesome-libgen\nJoin r/scihub to stay up to date\nNote: We have no affiliation with Sci-Hub\nThis effort is completely unaffiliated from Sci-Hub, no one is in touch with Sci-Hub, and I don't speak for Sci-Hub in any form. Always refer to sci-hub.do for the latest from Sci-Hub directly.\nThis is a data preservation effort for just the articles, and does not help Sci-Hub directly. Sci-Hub is not in any further imminent danger than it always has been, and is not at greater risk of being shut-down than before.\nA Rescue Mission for Sci-Hub and Open Science\nElsevier and the USDOJ have declared war against Sci-Hub and open science. The era of Sci-Hub and Alexandra standing alone in this fight must end. We have to take a stand with her.\nOn May 7th, Sci-Hub's Alexandra Elbakyan revealed that the FBI has been wiretapping her accounts for over 2 years. This news comes after Twitter silenced the official Sci_Hub twitter account because Indian academics were organizing on it against Elsevier.\nSci-Hub itself is currently frozen and has not downloaded any new articles since December 2020. This rescue mission is focused on seeding the article collection in order to prepare for a potential Sci-Hub shutdown.\nAlexandra Elbakyan of Sci-Hub, bookwarrior of Library Genesis, Aaron Swartz, and countless unnamed others have fought to free science from the grips of for-profit publishers. Today, they do it working in hiding, alone, without acknowledgment, in fear of imprisonment, and even now wiretapped by the FBI. They sacrifice everything for one vision: Open Science.\nWhy do they do it? They do it so that humble scholars on the other side of the planet can practice medicine, create science, fight for democracy, teach, and learn. People like Alexandra Elbakyan would give up their personal freedom for that one goal: to free knowledge. For that, Elsevier Corp (RELX, market cap: 50 billion) wants to silence her, wants to see her in prison, and wants to shut Sci-Hub down.\nIt's time we sent Elsevier and the USDOJ a clearer message about the fate of Sci-Hub and open science: we are the library, we do not get silenced, we do not shut down our computers, and we are many.\nRescue Mission for Sci-Hub\nIf you have been following the story, then you know that this is not our first rescue mission.\nWe protected the Library Genesis book collection\nWe unlocked over 5,000 COVID-19 research articles\nWe successfully petitioned publishers to unlock their COVID-19 paywalls\nbookwarrior, the founder of Library Genesis, took his library onto the de-centralized and un-censorable IPFS web\nNext? Make Sci-Hub un-censorable too.\nRescue Target\nA handful of Library Genesis seeders are currently seeding the Sci-Hub torrents. There are 850 scihub torrents, each containing 100,000 scientific articles, to a total of 85 million scientific articles: 77TB. This is the complete Sci-Hub database. We need to protect this.\nRescue Team\nWave 1: We need 85 datahoarders to store and seed 1TB of articles each, 10 torrents in total. Download 10 random torrents from the scimag index of < 12 seeders, then load the torrents onto your client and seed for as long as you can. The articles are coded by DOI and in zip files.\nWave 2: Reach out to 10 good friends to ask them to grab just 1 random torrent (100GB). That's 850 seeders. We are now the library.\nFinal Wave: Development for an open source Sci-Hub. freereadorg/awesome-libgen is a collection of open source achievements based on the Sci-Hub and Library Genesis databases. Open source de-centralization of Sci-Hub is the ultimate goal here, and this begins with the data, but it is going to take years of developer sweat to carry these libraries into the future.\nHeartfelt thanks to the r/datahoarder and r/seedboxes communities, seedbox.io and NFOrce for your support for previous missions and your love for science.",
    "comments": [
        {
            "author": "VonChair",
            "score": "1",
            "content": "Hey everyone, Over at The-Eye we've been working on this stuff and have been aware of it for a while now. We've been getting some people contacting us to let us know about this thread so hopefully they read this first. If you're ever wondering if we've seen something, please feel free to ping u/-CorentinB u/-Archivist or u/VonChair (me) here on Reddit so we can take a look.",
            "replies": []
        },
        {
            "author": "catalinus",
            "score": "524",
            "content": "Just a dumb question - would it not be wiser to have a script running linked to the tracker somehow to generate a pseudo-random list of 10 torrents for people wanting to help - and generally make that a list of the least seeded segments? A list of 850 items from which to pick something randomly is a little overwhelming, a list of just 10 (pseudo-randomized already) is really manageable. EDIT: Somebody added this: https://www.reddit.com/r/DataHoarder/comments/nc27fv/rescue_mission_for_scihub_and_open_science_we_are/gy2umtt/",
            "replies": [
                {
                    "author": "[deleted]",
                    "score": "",
                    "content": "Just saying - more than half that I see have just 1 seed but I also have seen some with 4+.",
                    "replies": [
                        {
                            "author": "catalinus",
                            "score": "68",
                            "content": "Just saying - more than half that I see have just 1 seed but I also have seen some with 4+.",
                            "replies": []
                        },
                        {
                            "author": "[deleted]",
                            "score": "1",
                            "content": "I made website for this purposes. You can checkout more details here: https://www.reddit.com/r/scihub/comments/nfz3zk/i_created_a_website_to_track_the_number_of/",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "ther0n-",
            "score": "185",
            "content": "Not using torrents, but want to help. Is vpn needed/advised when seeding this? Living in Germany",
            "replies": [
                {
                    "author": "FiReBrAnDz",
                    "score": "271",
                    "content": "A must. Germany has very strict IP enforcement. Seen a ton of horror stories in other subreddits.",
                    "replies": []
                }
            ]
        },
        {
            "author": "-masked_bandito",
            "score": "162",
            "content": "It's simple. Much of that research is funded publicly, but these fucks get to double dip for profit. I have institutional access but I find google/google scholar + sci hub to be faster and finds better articles. It got me through a significant portion of ug and g.",
            "replies": []
        },
        {
            "author": "stealthymocha",
            "score": "287",
            "content": "This site tracks libgen torrents that need the seeds most. EDIT: u/shrine asked me to remind you to sort by TYPE to get SCIMAG torrents. EDIT2: It is not my site, so I am not sure if the data is still reliable. EDIT3: This is a correct and working site: https://phillm.net/torrent-health-frontend/stats-scimag-table.php. Thanks u/shrine.",
            "replies": [
                {
                    "author": "Dannyps",
                    "score": "102",
                    "content": "Many of those have 0 seeders in the site, but when downloading there are dozens... Did we do this and the site just isn't up to date, or is it broken?",
                    "replies": []
                }
            ]
        },
        {
            "author": "JCDU",
            "score": "96",
            "content": "I don't have a spare 1Tb right now but a list of the torrents most in need of seeds would be very helpful as I can definitely do at least one 100Gb, maybe a couple.",
            "replies": []
        }
    ]
},
{
    "post_author": "melmoairplane",
    "post_id": "1ds9y86",
    "post_score": "0",
    "post_time": "Sunday, June 30, 2024 at 10:54:02 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "How to check the date of manufacture for Seagate Backup Plus External drive?",
    "media": [],
    "post_content": "Title. Somehow can't find info or anything that works after 20 minutes of googling and redditing. Driving me crazy, can't believe there's no straightforward info on this. Any help appreciated. Thx!",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "the_real_nirv",
            "score": "2",
            "content": "I would say smartmontools. It installs on Linux or mac, if you install brew first or if you install the linux subsystem on windows. You would then enter a command like: sudo smartctl -a /dev/sdX /dev/sdX is a placeholder that represents the device identifier of the disk The problem might be two fold, external drives don't always respond to tools like smartmontools and the other issue is that the DOM (Date of Manufacture) doesn't always get displayed in the output of smartctl but if the serial number displays you can ask the manufacture. Some 3.5 SATA drives typical have DOM and a date value on the drive's sticker.",
            "replies": [
                {
                    "author": "melmoairplane",
                    "score": "1",
                    "content": "Thanks. The serial number is on the drive obviously. Seagate cust service said that \"this information is out of our scope**\"** and can't help out. Even just the year of manufacture would be ok... crazy how difficult this is",
                    "replies": []
                }
            ]
        },
        {
            "author": "binaryriot",
            "score": "1",
            "content": "Maybe SMART the serial number and then check it in Seagates warranty list? Similar the serial from the case itself probably should do the trick? /edit Tested it with one of mine (via data from SMART), but getting \"Warranty Information Not Available.\". No idea if it's because the disk is too old, or the \"internal\" serial of the built-in disk itself doesn't do the trick.",
            "replies": [
                {
                    "author": "melmoairplane",
                    "score": "0",
                    "content": "Yeah I'm totally lost, the hard drive is close to ten years old I think... thanks for trying.",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "Rotisseriejedi",
    "post_id": "1drzjvm",
    "post_score": "4",
    "post_time": "Sunday, June 30, 2024 at 2:39:25 PM GMT+3",
    "flair_text": "Backup",
    "post_title": "Cannot backup region 2 disks anymore",
    "media": [],
    "post_content": "I used DVD Fab for years to do this, no problem. Have not done this in over 4 years because I just DL most things I want now\nI have a region DVD 2 set and yesterday, DVD FAB could not read it. So I read online and decided to try \"Make MKV\" and it could not read due to region. I went into device manager, changed the drive from region1 to region 2, and it starts to rip disk but about 15% through, it comes up error. This happened on the first 4 disks I tried",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "SkinnyV514",
            "score": "2",
            "content": "Try good ol’s DVD Decrypter, never failed me.",
            "replies": []
        },
        {
            "author": "nekoanikey",
            "score": "1",
            "content": "You sure you can really change the region of the drive? If I remember correct, before I flashed libredrive onto mine, I got some warning in MakeMKV, telling me I could only change the drive region x more times. Not that your drive simply is locked to one region now.",
            "replies": [
                {
                    "author": "Rotisseriejedi",
                    "score": "1",
                    "content": "Well, using Make MKV, I could not rip at all, but I went into device manager and changed region and could get the rip to start but like I said, it gets an error like 15-20% into the rip I read on an old post about changing the drive region My drive is an EXTERNAL USB blue ray drive",
                    "replies": []
                },
                {
                    "author": "dubious_dan",
                    "score": "1",
                    "content": "I would recommend buying a high quality internal drive, a usb adapter so you can use it basically as an external drive, and setting its region code to 2. most external usb drives are slim drives and typically are less reliable than internal drives.",
                    "replies": []
                }
            ]
        },
        {
            "author": "H2CO3HCO3",
            "score": "1",
            "content": "I used DVD Fab for years to do this, no problem. Have not done this in over 4 years because I just DL most things I want now u/Rotisseriejedi, were you using the same PC and drive to rip DVDs in the past? (aka 4+ years ago)",
            "replies": [
                {
                    "author": "Rotisseriejedi",
                    "score": "1",
                    "content": "Most ripping actually done on my laptop but the laptop drive went out, so moved to the exterrnal",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "B_admash",
    "post_id": "1dtmz43",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 5:18:32 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Downloading Search Result of Internet Archive",
    "media": [],
    "post_content": "Hi guys,\ni am trying to download all the search result that gets shown on the Internet Archive when i search for a Thing, can anyone help me bulk download them, its mostly pdf stuff\nfor example i go on Internet Archive and search for the word \"data_hoarder\" and the search results come out to be 200 in quantity, i want to download all those.\nis there a way to download the search result all at once?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "secacc",
            "score": "2",
            "content": "Use the \"ia\" command line tool that they have.",
            "replies": [
                {
                    "author": "B_admash",
                    "score": "1",
                    "content": "can you please elaborate a little",
                    "replies": []
                }
            ]
        },
        {
            "author": "hoptank",
            "score": "3",
            "content": "Install the ia tool mentioned by another poster (https://github.com/jjjake/internetarchive) Login with your ia account (run 'ia configure') Then run: ia download --search='title:hoarder AND mediatype:texts' --glob=\".pdf|.PDF|*.Pdf\" Adding '--dry-run' to the end of the command will allow you to see what would be downloaded without actually downloading anything.",
            "replies": [
                {
                    "author": "B_admash",
                    "score": "1",
                    "content": "not working i wrote this command like this ia download --search='title:hoarder AND mediatype:texts' --glob=\".pdf/.PDF|*.Pdf\" --dry-run",
                    "replies": []
                },
                {
                    "author": "B_admash",
                    "score": "1",
                    "content": "i even tried this one and still not working ia download --search=title:hoarder --metadata=mediatype:texts --glob=\"*.[pP][dD][fF]\" there is something wrong with --metadata argument because without it, it is working",
                    "replies": []
                },
                {
                    "author": "B_admash",
                    "score": "1",
                    "content": "sir, is there a way i can chat with you one on one ? discord maybe? because i am not able to message you here",
                    "replies": []
                }
            ]
        },
        {
            "author": "lupoin5",
            "score": "1",
            "content": "Copy the link and paste it in wfdownloader it will download the files.",
            "replies": [
                {
                    "author": "B_admash",
                    "score": "1",
                    "content": "No sir, I think you do not understand All the results not within one link but the result I get in here for example: https://archive[dot]org/search?query=hoarder&and%5B%5D=mediatype%3A%22texts%22",
                    "replies": [
                        {
                            "author": "lupoin5",
                            "score": "1",
                            "content": "Do you not mean you want to download all the files under that search link?",
                            "replies": [
                                {
                                    "author": "B_admash",
                                    "score": "1",
                                    "content": "Not under a search link All that is in the link I posted in above in reply as an example Open it once, you will understand",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
},
{
    "post_author": "CrazyBax",
    "post_id": "1dt1k0s",
    "post_score": "1",
    "post_time": "Monday, July 1, 2024 at 10:22:24 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "External hard drive noob here. Is my Seagate Expansion 14TB considered on and running if the power is plugged into electricity but the usb is not plugged in?",
    "media": [],
    "post_content": "I just bought my first large external hard drive that I plan to use for video storage for when I edit with my MacBook.\nI’ve read (within the past 20 mins) there’s a big controversy whether to leave it running or not.\nI plan to use it 2-3 times a week so I assume leaving it running is ideal? Again not really sure.\nHowever when I unplugged the usb from my MacBook, I think it turns off due to lack of noise, even though the external is still plugged into an outlet as well.\nSo my question is, when disconnecting the external hard drive from my MacBook (usb connection) does it turn off? Or is it still powered in since it’s connected to an outlet?\nIm pretty mobile with my MacBook and I bring it all over the place. Meaning I won’t be able to keep the usb plugged in at all times.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "WikiBox",
            "score": "1",
            "content": "The hdd may use one of several possible power saving states when idle and/or the USB cable is disconnected. As long as it has power, it is on and \"running\". But it may have spun down. In standby. It may spin up faster when in standby than powered off. I think that you should power off completely if you don't know that you will use the drive within the next few hours. Powering on/off fully a few times per day is not a problem. Powering on/off several times every few minutes could be a problem. Increase wear.",
            "replies": []
        },
        {
            "author": "mervincm",
            "score": "1",
            "content": "Just pull the power when you are not using it. For such rare usage … just pull the power.",
            "replies": []
        },
        {
            "author": "GraveNoX",
            "score": "1",
            "content": "Unplugging USB data cable from the drive will turn off the hard drive completely. The hard drive won't power on if the USB data cable is not connected.",
            "replies": []
        },
        {
            "author": "pastafusilli",
            "score": "0",
            "content": "BestBuy or Newegg? !RemindMe 7 days",
            "replies": [
                {
                    "author": "RemindMeBot",
                    "score": "0",
                    "content": "I will be messaging you in 7 days on 2024-07-08 20:59:05 UTC to remind you of this link CLICK THIS LINK to send a PM to also be reminded and to reduce spam. Parent commenter can delete this message to hide from others. Info Custom Your Reminders Feedback",
                    "replies": []
                }
            ]
        },
        {
            "author": "riftwave77",
            "score": "-1",
            "content": "How much data do you need backed up?  If you are mobile then a series of SSds would be more rugged than a HDD with platters, magnets, motors and lots of mass",
            "replies": []
        },
        {
            "author": "DogeshireHathaway",
            "score": "1",
            "content": "It enters an idle state, parks the heads, and does nothing until you plug the USB back in. There is no harm or risk to the drive by leaving it powered but not plugged into a computer. It's the exact same as a harddrive in a PC that's spun down. That said, it can be good piece of mind to pull the power.",
            "replies": []
        }
    ]
},
{
    "post_author": "trd86",
    "post_id": "12sbch3",
    "post_score": "3768",
    "post_time": "Thursday, April 20, 2023 at 12:45:32 AM GMT+3",
    "flair_text": "We're Archiving It!",
    "post_title": "Imgur is updating their TOS on May 15, 2023: All NSFW content to be banned",
    "media": [],
    "post_content": "",
    "comments": [
        {
            "author": "-Archivist",
            "score": "1",
            "content": "Update 12: Now begins wrangling this big bitch. Update 11: I keep getting a lot of DMs about saving certain sfw subs, so I'll shout this :3 I'M SAVING THE CONTENT OF EVERY IMGUR LINK POSTED TO REDDIT, ALL OF THEM. The talk of nsfw items is due to wanting to archive those subs in place too (make consumable). We have reddits full submission and comment history data and with this project we will have all the imgur media which will allow us to re-build whole subreddits into static portable/browsable archives. There's a lot of work to do in the coming weeks to make sense of this data but rest assured between myself and ArchiveTeam we will have grabbed every imgur link on reddit. AT is working from multiple sources of once public links and at the time of my writing this has grabbed 67TB. My reddit sourced data so far is 52TB while my 7char id crawlers output is coming up on 642TB (crawler running on and off since this post) Note that I'm downloading media only while AT is downloading html pages/media as warc for ingest into the wayback machine. -------- 18 DMs and counting... I'll revisit this and rehost everything I have as well as catch up on the last 3 years. Will update on progress later. ----- > https://www.reddit.com/r/DataHoarder/comments/djxy8v/imgur_has_recently_changed_its_policies_regarding/f4a82xr/ --------- **Update 1:** Keep an eye on this repo if you want to help archive imgur general for input into the wayback machine. > https://github.com/ArchiveTeam/imgur-grab I'm currently restoring what I pulled in the last dump (all reddit sourced) and scraping urls posted to reddit since. Downloads will begin in next 12 hours. --------------- **Update 2:** Downloads started, servers go [zoom! zoom!](https://cdn.discordapp.com/attachments/534870962475368451/1098937457686347787/zoomzoom.png) ~ ~~Output directory will be rehosted later today.~~ ----------- **Update 3:** Waiting on IP block to be assigned to speed things up and avoid rate limits, still avg 400-500MB/s hoping to hit 20Gbit/s at least. --------------- **Update 4:** Downloads are going steady with new IPs, maintained 9Gbit/s* for the last few hours but I'm hitting some limitations of my downloader so if you're proficient in `C++` get in touch <3 ----------- **Update 5:** [Heh ...](https://cdn.discordapp.com/attachments/534870962475368451/1099293595007193218/classicimgur.png) still over 8Gbit/s ... ---------- **Update 6:** Not a great deal new to report, worked out a few kinks in my downloader so things are smoother but I'm still only averaging 9Gbit/s or so. That's likely all I'm going to get unless I up thread count and pass any 429s to another IP or look into load balancing properly. For the nsfw subs I'm going to make a master list from these two `redditlist.com/nsfw` & `old.reddit.com/r/NSFW411/wiki/index`, so if you're an nsfw sub owner that wants your sub archiving and you're not on those lists let me know. I'm downloading all imgur content first but once it's done I'll start putting things together into individual sub archives as a new project. I'm on the road for the next few days so maybe sparse to no updates while I'm afd. ----------- **Update 7:** Moved from singles to albums, much more involved process (to api or not to api, eww api) but still going smoothly!! Some trivia, their 5 character space is 916,132,832 IDs... that's _nine hundred sixteen million one hundred thirty-two thousand eight hundred thirty-two_ potential images, obviously many in that space are dead today but they now use the 7 character space. --------- **Update 8:** imgur dls are fine, this is a rant about reddit archiving tools.... they're all broken or useless for mass archiving. Here's the problem, they ALL adhere to reddits api limit which makes them pointless for full sub preservation (you can only get the last 1000 posts) OR they actually use something like the pushshift API which would be nice if it wasn't broken, missing data or rate limited to fuck when online. We have the reddit data and we can download all the media from imgur and the other media hosts..... So we have all the raw data, it's safe it's gravy! but we have nothing at all to tie everything together and output nice little neat consumable archives of subs. This wasn't the case 4-6 years ago, there was soooo many workable tools, now they're all DEAD! So what needs to be done? [reddit-html-archiver](https://github.com/libertysoft3/reddit-html-archiver) was the damn tits!! and needs rewriting to support using the raw json data as a source and not the ps api this way everything can be built offline and then rehosted, repackaged and shared!!. It then needs extending to support the mirroring of linked media AND to include flags to support media already downloaded like in the case of what we're doing with imgur. This would only be a start on slapping some sense into mirroring reddit and getting consumable archives into the hands of users..... I'll write up something more cohesive and less ranty when I'm done with imgur. (╯°□°）╯︵ ┻━┻ -------------- **Update 9:** AT has the warrior project running now, switch to it manually in your warrior or run the docker/standalone. > https://github.com/ArchiveTeam/imgur-grab > https://tracker.archiveteam.org/imgur/ Content archived in the AT project will only be available via the wayback machine. ---------------- **Update 10:** Coming to a close on the links I have available so I'm now taking stock, running `file` and crawling both id spaces to check for replaced/reused in the 5 and all new in the 7.",
            "replies": [
                {
                    "author": "neonvolta",
                    "score": "28",
                    "content": "Does your archive contain the URLs of all the images? It'd be useful to be able to search for specific links that may be embedded in old posts",
                    "replies": [
                        {
                            "author": "-Archivist",
                            "score": "36",
                            "content": "Does your archive contain the URLs of all the images? Yes, everything stored with original IDs.",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "NerdWampa",
                    "score": "10",
                    "content": "into the wayback machine Considering the legal troubles Archive.org is currently dealing with, do you have a backup solution if the wayback machine gets shafted?",
                    "replies": [
                        {
                            "author": "-Archivist",
                            "score": "11",
                            "content": "do you have a backup solution if the wayback machine gets shafted? Everyone close to IA seems to be going about business as usual. I speculate given how they have operated over the years in the event that archive.org no longer resolves the data would still exist so I think most public worry is for nothing. Having said this I have been making large scale backups of IA content for awhile now. Wayback data on the other hand isn't as easily wrangled as general items.",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "newsfeedmedia1",
                    "score": "9",
                    "content": "damn how the hell you have that much storage lol",
                    "replies": [
                        {
                            "author": "Omnitographer",
                            "score": "19",
                            "content": "20gbit/sec combined download speed, grabbing everything.... I'd love to see the traffic stats for imgur from the days before the announcement to now.",
                            "replies": []
                        },
                        {
                            "author": "-Archivist",
                            "score": "7",
                            "content": "Buy hard drive, repeat.",
                            "replies": []
                        }
                    ]
                },
                {
                    "author": "aeroverra",
                    "score": "6",
                    "content": "I am a c# dev and may be able to make something better or different what are the limitations? I can do c++ too but I don't use it as often.",
                    "replies": []
                },
                {
                    "author": "[deleted]",
                    "score": "",
                    "content": "Already way ahead on this idea, I'll be making a new thread about the state of reddit archiving once this imgur mess is taken care of.",
                    "replies": [
                        {
                            "author": "-Archivist",
                            "score": "13",
                            "content": "Already way ahead on this idea, I'll be making a new thread about the state of reddit archiving once this imgur mess is taken care of.",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "FuckMyHeart",
            "score": "2091",
            "content": "Not just nudity, they're also purging all images not uploaded by a registered account. That seems like the bigger news to me. Isn't that like the majority of images uploaded to Imgur?",
            "replies": [
                {
                    "author": "Puptentjoe",
                    "score": "1279",
                    "content": "Dude the amount of posts with pics, guides, etc that are hosted on imgur is nuts. This is going to be like when I find old message board posts where images were hosted on photobucket.",
                    "replies": []
                },
                {
                    "author": "Benskien",
                    "score": "428",
                    "content": "Yup, I'd assume most used their easy upload method so so much content, especially older will be gone",
                    "replies": []
                }
            ]
        },
        {
            "author": "[deleted]",
            "score": "913",
            "content": "Well, there goes half their traffic.",
            "replies": []
        },
        {
            "author": "[deleted]",
            "score": "552",
            "content": "Worked great for tumblr.",
            "replies": []
        },
        {
            "author": "Teenager_Simon",
            "score": "376",
            "content": "Imgur removing NSFW and Reddit API removing NSFW content as well. Enjoy the good things while it lasts. The first one to make a new utopia with blackjack and porn will make internet history. Tumblr gone. Twitter turned to shit. Other social medias have been shit. Reddit thrives only off it’s community. It’s gotten too big with too much money to be made leading to this shit.",
            "replies": []
        },
        {
            "author": "trucorsair",
            "score": "985",
            "content": "Tumbler Debacle 2.0",
            "replies": [
                {
                    "author": "billyhatcher312",
                    "score": "461",
                    "content": "and the beginning of the end of imgur begins",
                    "replies": []
                }
            ]
        },
        {
            "author": "faceman2k12",
            "score": "175",
            "content": "well, there goes the majority of old reddit posts.",
            "replies": []
        },
        {
            "author": "The_Pip",
            "score": "614",
            "content": "RIP Imgur.",
            "replies": []
        },
        {
            "author": "overratedcabbage_",
            "score": "528",
            "content": "this guy began archiving NSFW off imgur when they made a ToS change similar to this 4 years ago, https://www.reddit.com/r/DataHoarder/comments/djxy8v/comment/f4a82xr/?utm_source=share&utm_medium=web2x&context=3 maybe we need a teamed up approach like this",
            "replies": [
                {
                    "author": "Mr_Brightstar",
                    "score": "187",
                    "content": "The Eye, that place died horribly, sadly",
                    "replies": []
                }
            ]
        },
        {
            "author": "Substantial_City4618",
            "score": "344",
            "content": "Tumblr did this. It died…. Only fans considered this but realized it was stupid. Rip imgur.",
            "replies": []
        },
        {
            "author": "the_Athereon",
            "score": "256",
            "content": "So. They've just announced that they're giving up then? Because a good chunk of their traffic comes from NSFW reddit threads.",
            "replies": [
                {
                    "author": "[deleted]",
                    "score": "157",
                    "content": "Just wait til Reddit pulls all nsfw content..",
                    "replies": []
                }
            ]
        },
        {
            "author": "VicarBook",
            "score": "244",
            "content": "Worse than the Tumblr decision, as that 10% that was left afterwards, was definitely unique and not represented elsewhere, unlike Imgur, which has no uniqueness to it at all.",
            "replies": []
        },
        {
            "author": "Zerofelero",
            "score": "197",
            "content": "idiots",
            "replies": []
        },
        {
            "author": "stilljustacatinacage",
            "score": "193",
            "content": "I sure do love living in Digital Iran. Better every day.",
            "replies": []
        },
        {
            "author": "SkiingAway",
            "score": "174",
            "content": "I'll piggyback on this with a note - Xhamster lost a court case in Amsterdam last week and is likely to purge all their old (unverified upload) content within the next 2 weeks.",
            "replies": []
        }
    ]
},
{
    "post_author": "swaggersouls694",
    "post_id": "1dsibpm",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 5:37:52 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Diy or buy 10G NAS for heavy video editing? ",
    "media": [],
    "post_content": "Hey guys, I'm looking to diy my old pc into a NAS for live video editing.\nIt's a 3700x, gtx 1660, basic b450m mobo, ddr4 ram, supports m.2 nvme and has a couple of sata ports (I'll also attach an m.2 expansion card and a 10gbe network card that goes to a 10G switch)\nPurpose would be for 2 editors to edit live off the NAS (Working with 4-8 cams shot in 4K H.264, and the occasional 6k RED raw)\nI'm thinking all active projects live on the ssds (raid 0 with daily backups) and everything else on hdds with redundancy and offsite backups where needed\nUltimately, I require speed, stability and less headaches to deal with after initial setup. I would greatly appreciate any recommendations.",
    "comments": [
        {
            "author": "_RouteThe_Switch",
            "score": "3",
            "content": "I would go synology 1821+ with 10g upgrade and nvme cache drives I've had synology for 10 years and they are rock solid.",
            "replies": []
        },
        {
            "author": "Joe-notabot",
            "score": "1",
            "content": "Value your time, buy a NAS & get back to work. Synology 1821+ with 10gbE card & NVMe cache works great.",
            "replies": []
        }
    ]
},
{
    "post_author": "fairytalejunkie",
    "post_id": "1ds6pv4",
    "post_score": "0",
    "post_time": "Sunday, June 30, 2024 at 8:29:45 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Converting Sony camcorder tapes, audio issues.",
    "media": [],
    "post_content": "I have a Sony camcorder with tapes I am trying to digitize. I have a vidbox converter with red white and yellow inputs. The camcorder has yellow and black. I am new to this so I’m definitely not using the correct terminology I apologize. The audio doesn’t seem to pick up any music or background noise with just one audio input so I bought a single female to 2 male adapter thinking that would work and I would be able to use all three input on the vidbox but that didn’t help either. I may be missing something very simple here but I’m at a loss if anyone could help I’d really appreciate it.\n(The audio plays perfectly in the camera screen itself)",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "AcornWhat",
            "score": "1",
            "content": "Look on your camcorder to find the model number. Look up the model number online to find the manual. Read what the outputs put out. Match those outputs to the inputs on your dongle.",
            "replies": []
        },
        {
            "author": "seronlover",
            "score": "1",
            "content": "I recommend replacing the cable with another one. If the output is working correctly, of course. Maybe try a different software as well. VLC worked smoothly for my vhs digitization",
            "replies": []
        },
        {
            "author": "Sessamy",
            "score": "1",
            "content": "The audio might have to come from a headphone jack. I am not sure what the black av plug would be.",
            "replies": []
        },
        {
            "author": "DoaJC_Blogger",
            "score": "1",
            "content": "I wrote a long comment about how to do it with the highest quality. If your tapes are digital then you should capture them as DV with FireWire. If they're analog, you should capture them as S-Video or direct head RF. Using one of these methods instead of composite will make your videos look noticeably better, especially if they're Hi8 or Digital8. Analog tapes are also quite unstable so you're probably going to need a TBC. Capturing analog tapes as direct head RF lets you use the free full-frame software TBC that comes with vhs-decode, and if they have Hi-Fi audio you can also capture the audio and video to a single file with just one device so you don't need an audio device. For analog and digital tapes, you should de-interlace them to 50 or 59.94p with QTGMC.",
            "replies": []
        }
    ]
},
{
    "post_author": "aty0504",
    "post_id": "1dt18f8",
    "post_score": "1",
    "post_time": "Monday, July 1, 2024 at 10:09:18 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Hdd 3.3v pin",
    "media": [
        "https://preview.redd.it/hdd-3-3v-pin-v0-56hwp7lmhy9d1.jpg?width=640&crop=smart&auto=webp&s=8324f9d28f2121cb6e0da7e1600f1e45ad370d11",
        "https://preview.redd.it/hdd-3-3v-pin-v0-0b4h9uqmhy9d1.jpg?width=640&crop=smart&auto=webp&s=ff130cc2ec37604dae31ab75bb1ef6fb7d088d5d",
        "https://preview.redd.it/hdd-3-3v-pin-v0-f7gws5vmhy9d1.jpg?width=640&crop=smart&auto=webp&s=e008608b4a0897764c289e1c101076a462fdc32c"
    ],
    "post_content": "Hi,\nI purchased a couple of HGST drives and of course they won't work with my PC but power up fine in my Synology NAS.\nI've seen a few guides that say you can put some Kapton tape or use a moelx to SATA adapter.\nI've also seen a few guides on modigying the normal SATA cable.\nMy question is that if I purchase a SATA extension cable that supports 5 hdds, what is the best way of modding it?\nMy first thought was why can't I just the end that connects to extend the cable (male I think) which has the end that look similar to the connections on the Hdd and remove the 3rd pin (as some have done directly on the hdd)?\nDoes this not achieve the same outcome and also will provide all 5 drives no 3.3V?\nForgive my ignorance on the matter.",
    "comments": [
        {
            "author": "Hallowee1234",
            "score": "1",
            "content": "Yes, I believe it should work. You are stopping the 3.3v, it doesn’t matter where along the connection you do it.",
            "replies": []
        },
        {
            "author": "gamerjocke",
            "score": "1",
            "content": "i just cut the 3.3v wire on the extension cable and wrap the cut end in electrical tape",
            "replies": []
        }
    ]
},
{
    "post_author": "e_spider",
    "post_id": "lq2zr7",
    "post_score": "8334",
    "post_time": "Tuesday, February 23, 2021 at 2:18:14 AM GMT+3",
    "flair_text": "",
    "post_title": "Data transfer to new Lustre storage overwhelms campus network",
    "media": [
        "https://preview.redd.it/zdkgt1us34j61.png?width=640&crop=smart&auto=webp&s=5404cdbfeba8946f98e1e59a996eeaa71b7a40d6",
        "https://i.redd.it/zdkgt1us34j61.png"
    ],
    "post_content": "",
    "comments": [
        {
            "author": "IMI4tth3w",
            "score": "606",
            "content": "its... beautiful... One can only aspire to transfer 700TB over the internet in 8 days.. It'll be months before i get my 80TB of data onto my google cloud drive... but that's more of a google limit than a hardware limit..",
            "replies": [
                {
                    "author": "_Rogue136",
                    "score": "154",
                    "content": "I hope you saw the upcoming changes.... https://www.blog.google/outreach-initiatives/education/google-workspace-for-education",
                    "replies": [
                        {
                            "author": "KoopaTroopas",
                            "score": "128",
                            "content": "Well shit, I hadn't seen this. I currently store about 30TB in my school accounts google drive. Is there anything I should be doing?",
                            "replies": [
                                {
                                    "author": "_Rogue136",
                                    "score": "143",
                                    "content": "Prepare for IT to come knocking in the next year or so. They probably won't be able to be chill about it.",
                                    "replies": []
                                },
                                {
                                    "author": "fullouterjoin",
                                    "score": "11",
                                    "content": "You need physical copies asap.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "Thefaccio",
                            "score": "14",
                            "content": "Shit, I have 10TB on my uni drive...10% of a 35k people university is a bit too much I guess",
                            "replies": []
                        },
                        {
                            "author": "IMI4tth3w",
                            "score": "11",
                            "content": "I have a g suite account not a school account",
                            "replies": [
                                {
                                    "author": "MageFood",
                                    "score": "12",
                                    "content": "Still effects you, they changed the Gsuite stuff also",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "AdamLynch",
                            "score": "6",
                            "content": "Any news on if this is impacting Google Workspace Enterprise (not Education)?",
                            "replies": [
                                {
                                    "author": "Lurker_Turned_User",
                                    "score": "6",
                                    "content": "As of now, this is only impacting education and non-profit. Business Enterprise organizations still get as much as they need.",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "author": "DM2602",
                            "score": "0",
                            "content": "so 100TB are 400,000 hours of video according to them. What video takes 1GB per hour? Probably 480p because that's for sure not 1080p with a watchable bitrate.",
                            "replies": [
                                {
                                    "author": "TheLazyGamerAU",
                                    "score": "3",
                                    "content": "lots of 720p/1080p movies fit into 1gb an hour",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "author": "e_spider",
            "score": "1127",
            "content": "Lots of genomic data. Because of our new equipment's location, data had to leave the campus network and travel over the public internet. The available internet backbone was 100Gbps on one end and 40Gbps on the other. Campus IT was more interested in how I did it than on stopping me. They were also happy the campus firewall held up as well as it did.",
            "replies": [
                {
                    "author": "_Rogue136",
                    "score": "295",
                    "content": "Campus IT was more interested in how I did it than on stopping me. Yeah that goes for most people in IT once they know there was no malicious intent they just want to then know how.",
                    "replies": []
                },
                {
                    "author": "ImperialAuditor",
                    "score": "484",
                    "content": "Relevant xkcd Do you have backups? Is this a database used by multiple groups or is this just yours?",
                    "replies": []
                }
            ]
        },
        {
            "author": "seanc0x0",
            "score": "176",
            "content": "Hi fellow campus network sponge! I did a 100TB transfer from another institution to our large storage array back around 2013 or so. Only fallout was our networking group asking me to rate-limit the transfers during business hours, but they let me go ham overnight.",
            "replies": []
        },
        {
            "author": "minnsoup",
            "score": "119",
            "content": "We pulled a shit ton of cancer transcriptome bam files a few years ago and they made us wait until a long holiday weekend to do the transfer so the help desk wouldn't get calls for slow and shitty traffic. Love it. What kind of work you do if you're pulling genomic?",
            "replies": [
                {
                    "author": "e_spider",
                    "score": "93",
                    "content": "Human disease discovery as well as some new model organism annotation (human research pays the bills, but model organisms are where you get to see more weird and interesting science). I used to work on pancreatic cancer genomics.",
                    "replies": []
                }
            ]
        },
        {
            "author": "samettinho",
            "score": "102",
            "content": "I once ran a homemade Flickr image downloader that used half of the university's bandwidth. They called me and said to not run it during work hours. I was pretty proud of myself.",
            "replies": []
        }
    ]
},
{
    "post_author": "utzcheeseballs",
    "post_id": "1dtmfzd",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 4:55:32 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Can I use a NAS HDD as an External HDD?",
    "media": [],
    "post_content": "I'm wondering if I can use a NAS drive as an external HDD. Why? I don't want or need the full-blown power of a NAS solution but would like to piecemeal one possibly in the future. For example, maybe one day I have 4 NAS drives, all with enclosures acting as external hard drives, now I only have to purchase a 4-bay diskless Synology or something similar.",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "Caranesus",
            "score": "4",
            "content": "Yep, it will work normally.",
            "replies": []
        },
        {
            "author": "JimboLodisC",
            "score": "1",
            "content": "I went from 1 external to a second external to a NAS drive in an enclosure, totaling about 12TB currently between the three. I figured when I filled up my fourth drive I'll shuck them and have a nice set of drives for my NAS. But as I've bought these drives they've gotten larger in size, so they're different sizes. Not a problem for some setups, but now a slot is getting eaten up by a drive that could be much larger with today's pricing. Yesterday I bought three 12TB drives and am currently shopping for a NAS mobo.",
            "replies": [
                {
                    "author": "Monocular_sir",
                    "score": "1",
                    "content": "That ghd hgst deal was awesome if that’s what you got.",
                    "replies": [
                        {
                            "author": "JimboLodisC",
                            "score": "1",
                            "content": "it was! I think they were $80 previously and dropped to $75 so it's good time to scoop them up, I had been waiting on Synology to do something new but now I'm just gonna do my own build",
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "author": "BmanUltima",
            "score": "1",
            "content": "Sure. You will have to wipe the drives when you put them in a NAS though.",
            "replies": []
        },
        {
            "author": "migm16",
            "score": "0",
            "content": "you don’t peace a nas together as you go, unless u like building a nas just to save data that you won’t have when the final build comes to fruition. since to add the drive to said nas setup you’ll have to wipe them. You build a nas now to start holding your data then expand it as needed over time.",
            "replies": [
                {
                    "author": "Far_Marsupial6303",
                    "score": "0",
                    "content": "Wiping the drives isn't an issue because you restore from backups! Which are a must!",
                    "replies": []
                }
            ]
        },
        {
            "author": "J4m3s__W4tt",
            "score": "-1",
            "content": "\"NAS HDDs\" are just regular SATA discs rated for continuous usage. You can reuse the drives, but you will have to format them and delete the data in the progress. You could get two external HDDs now, use the second one as a backup. Later when you get a NAS, use the second drive to move the data over.",
            "replies": []
        }
    ]
},
{
    "post_author": "SapToFiction",
    "post_id": "1dsg2j4",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 3:38:09 AM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "help with wget -- downloading scripts from BBC site",
    "media": [
        "https://www.bbc.co.uk/writers/scripts/"
    ],
    "post_content": "bit of a wget noob, trying to nail down the right syntax so I can download all the pdfs from BBC's script library -- Script Library (bbc.co.uk) Can yall help?\nI've trying different variations of \"wget -P -A pdf -r library url\" and each time I either index html files, a bunch of empty directories or some, but not all, scripts in pdf form. does anyone know the proper syntax to get exactly all the PDFs from the entire script library (and its subdirectories)?",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        },
        {
            "author": "JSouthGB",
            "score": "1",
            "content": "For direct links I use the -O option. Maybe this SO answer will help.",
            "replies": []
        }
    ]
},
{
    "post_author": "[deleted]",
    "post_id": "c20oq6",
    "post_score": "3742",
    "post_time": "Tuesday, June 18, 2019 at 1:40:45 PM GMT+3",
    "flair_text": "",
    "post_title": "Thought you guys would appreciate this.",
    "media": [],
    "post_content": "",
    "comments": [
        {
            "author": "[deleted]",
            "score": "",
            "content": "I'm kinda turned on right now",
            "replies": [
                {
                    "author": "nascentt",
                    "score": "207",
                    "content": "I'm kinda turned on right now",
                    "replies": [
                        {
                            "author": "LTCM_15",
                            "score": "43",
                            "content": "Only kind of? Hard as a rock over here.",
                            "replies": []
                        },
                        {
                            "author": "neebski",
                            "score": "15",
                            "content": "Unzips...",
                            "replies": [
                                {
                                    "author": "port53",
                                    "score": "6",
                                    "content": "125/flips/minute!",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "mainfingertopwise",
                    "score": "150",
                    "content": "It'd take years. I once had a job where I was \"scanning\" individual pages of ~100 year old books using a digital camera mounted above it, face down. Page....... click. Page....... click. Page....... click. I kind of miss that job.",
                    "replies": []
                },
                {
                    "author": "f0rcedinducti0n",
                    "score": "51",
                    "content": "OR, Clamp the book be tween two pieces of wood, with only the spine exposed... remove spine with table saw, band saw, etc... and put through auto feeder scanner. I also had a friend who cut pages out one by one with a xacto knife in college.",
                    "replies": []
                }
            ]
        },
        {
            "author": "PJitrenka",
            "score": "181",
            "content": "Link: https://linearbookscanner.org/ Its open source, and supposedly low cost!",
            "replies": [
                {
                    "author": "redrosebluesky",
                    "score": "142",
                    "content": "neat idea, but site admits there's room for improvement. can only handle 60% of books tested, and 45% of books scanned had at least one page folded or ripped? i'm anal about my books and can't stand the odds of ripping or ruining a single page in any of them",
                    "replies": []
                }
            ]
        },
        {
            "author": "f0rcedinducti0n",
            "score": "47",
            "content": "Until it gets a little bit off and turns your ancient rare volume into confetti...",
            "replies": []
        },
        {
            "author": "getliquified",
            "score": "35",
            "content": "That gives me anxiety. I feel like it's going to rip some pages as the entire book slides",
            "replies": [
                {
                    "author": "SisconOnii-san",
                    "score": "25",
                    "content": "It does Is it safe for books? Prototype 1 could scan the majority of books without damage, but may tear one or two pages in some books. Out of 50 books tested, 45% had one or two of their pages either torn or folded. This is a very early prototype and there are many areas for improvement in the design. https://linearbookscanner.org/faq/",
                    "replies": []
                }
            ]
        }
    ]
},
{
    "post_author": "iamworship",
    "post_id": "1dtl5p9",
    "post_score": "0",
    "post_time": "Tuesday, July 2, 2024 at 3:55:42 PM GMT+3",
    "flair_text": "Question/Advice",
    "post_title": "Export and Archive FB Messenger Conversation, Organize with Titles/Headers",
    "media": [],
    "post_content": "Is there a third-party app that allows you to bring your Facebook Messenger conversation with someone over to your PC, and then save small conversations on the thread as different conversations that are titled? Almost like journal entries with someone you love...",
    "comments": [
        {
            "author": "AutoModerator",
            "score": "1",
            "content": "",
            "replies": []
        }
    ]
},
{
    "post_author": "justsomeuser23x",
    "post_id": "1dsnoga",
    "post_score": "0",
    "post_time": "Monday, July 1, 2024 at 11:11:02 AM GMT+3",
    "flair_text": "News",
    "post_title": "Why This New CD could change everything [ColdFusion]",
    "media": [],
    "post_content": "",
    "comments": [
        {
            "author": "FranconianBiker",
            "score": "18",
            "content": "Yawn.... Nope. Projects like the HVD and the organic disc never made it out of the lab. This one won't either.",
            "replies": [
                {
                    "author": "captain-obvious-1",
                    "score": "7",
                    "content": "There seem to be a timer for \"research papers\" to come out every 2-3 years and create this same vaporware hype again about a magical new storage media.",
                    "replies": [
                        {
                            "author": "justsomeuser23x",
                            "score": "-10",
                            "content": "",
                            "replies": [
                                {
                                    "author": "captain-obvious-1",
                                    "score": "6",
                                    "content": "none reached and none will reach the critical mass to become a reasonable option to even the majority of users here. There is also the issue of reliability. Otherwise it would have happened already. 20 years from now, people will be using LTO-13 or 14 for those scenarios.",
                                    "replies": []
                                },
                                {
                                    "author": "JohnStern42",
                                    "score": "4",
                                    "content": "‘A matter of time’? You need a market. What’s the market for this product? The only reasons CDs exist is because it was a way to deliver music. The only reason DVDs and BluRays exist is because they were a way to deliver video to consumers. THAT market drove the product, data use was a nice side benefit What’s driving this product? You saying HDDs and SSDs tells me you have no concept on what optical storage is for. The only possible area I can see is cold storage, and tape has that market, I don’t see this fragile nonsense taking over.",
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "author": "phoenystp",
                    "score": "1",
                    "content": "Oh come on, where do i put all the linux isos i downloaded?",
                    "replies": []
                },
                {
                    "author": "user3872465",
                    "score": "0",
                    "content": "There just needs to be one adopter which sees cost benefits in it for Archival purposes. It just needs to be better or cheaper than Tape and Tapestorage is.",
                    "replies": []
                }
            ]
        },
        {
            "author": "Malossi167",
            "score": "11",
            "content": "First, you have to have an idea. This is rather easy and basically free. Then you have to theorize how it can be used in a practical application. Not all that easy but still rather cheap. Then you have to build a prototype in a lab. This can be pretty tricky, but as long as your idea is sound, you likely can just throw a bit of money around and make it work. And you can get away creating something mostly impractical and just scale up your numbers etc. At this point, media will often write some pretty fantastical articles how this breakthrough will change the world. However, the most important, difficult and often very expensive step is the last: Devising a production method, material, and supply line that can transforms the idea into a cheap, mass producible and end user friendly product. And here tons of ideas break apart. Making the protype out of pure gold might be fine, but for the end product you have to make it work with a gold coating. Scratch that, to stay competitive you have to make it out of copper. And that special centrifuge you used to create this gel you use? You either have to find a way to make this using a normal mixing plant, or somehow find someone willing to invest like a billion dollars into developing a much larger version of that centrifuge. Oh, and you have to make the product much more sturdy, otherwise consumers will break it all the time. And no, you cannot make people take a 3 week course just to learn how to handle your product. You have to make it idiotproof. All while keeping costs low. TLDR: Until you can buy it for a reasonable price, just ignore videos like this.",
            "replies": []
        },
        {
            "author": "Aeristoka",
            "score": "9",
            "content": "VaporWare and ClickBait again",
            "replies": []
        },
        {
            "author": "Party_9001",
            "score": "6",
            "content": "Lol",
            "replies": []
        },
        {
            "author": "PeaceIsFutile",
            "score": "5",
            "content": "\"Dipping your balls in cold water will revolutionize testicle cooling...someday...idk...10 years, YEAH in 10 YEARS!\" \"Bro just use an AC..\"",
            "replies": [
                {
                    "author": "Aeristoka",
                    "score": "3",
                    "content": "Genuinely made me laugh at loud, and at my girl's dance performance. Bravo!",
                    "replies": []
                }
            ]
        }
    ]
}