[
{"Title": "Sunday Daily Thread: What's everyone working on this week?", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "Thursday Daily Thread: Python Careers, Courses, and Furthering Education!", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "Should all Python projects have type hinting?", "Author": "u/Ok-Frosting7364", "Content": "I recently released a \nvery simple API wrapper\n and in my efforts to become a better programmer I asked in a Python Discord for feedback.\n  \n\n    One bloke was very adamant I should use type hints. I understand the need/desire for type hints but this commentator basically was implying that all Python code should be written with type hints.\n  \n\n    For a simple project I didn't think it was necessary but I'm curious as to what this community thinks.\n  \n\n    How do you make the decision as to when to use type hints? Do you do it for all projects, regardless of size? What are your general thoughts?"},
{"Title": "NumPy 2.0: an evolutionary milestone", "Author": "u/partev", "Content": "an interesting blog post about the latest NumPy release:\n  \n\n\nhttps://blog.scientific-python.org/numpy/numpy2/"},
{"Title": "Anyone have experience using Vercel to host Python projects?", "Author": "u/marcelmarais", "Content": "Vercel is really convenient for NextJS and tbh it would be really nice to host and manage everything from one place.\n  \n\n    Unfortunately the documentation is pretty sparse and there doesn't seem to be many resources on the topic."},
{"Title": "Textual Serve - Serve TUIs in the browser", "Author": "u/willm", "Content": "Textual Serve (\nhttps://github.com/Textualize/textual-serve\n) is a project which serves TUIs (built with Textual) in the browser.\n  \n\n    This is self-hosted, so you don't need to rely on any external service."},
{"Title": "Python on ARM laptops", "Author": "u/Fun-Asparagus-837", "Content": "Hi there !\n  \n\n    I'm thinking about buying an ARM windows laptop with the new Qualcomm chips. They will replace the x86 so I was wondering : Will There be a massive risk of non-compatibility of Python packages ? I guess they are made for x86 but I don't know if it's possible to work with them with an ARM based CPU."},
{"Title": "Python Project Management Primer", "Author": "u/Martynoas", "Content": "This article\n explores how to manage Python project environments and dependencies, as well as how to structure projects effectively."},
{"Title": "karpet 0.5 released", "Author": "u/n1___", "Content": "What's karpet library:\n\n\n\n    Library for fetching coin/token historical data, trends and more (official and unofficial APIs).\n  \n\n\nSource code:\n\n\n\n\nhttps://gitlab.com/imn1/karpet\n\n\n\n\nReleases including changelog:\n\n\n\n\nhttps://gitlab.com/imn1/karpet/-/releases"},
{"Title": "I made a simple python script which can evaluate a mathematical expression from a string", "Author": "u/SubatomicPlanets", "Content": "I made this simple Python file a year ago. I thought you might be interested.\n  \n\n    It is only 100 lines long and uses no external libraries. It can do math on a string like this:\n  \n\n    \"What's fifty three+7*6/2?\" -> 74\n  \n\n    It can convert written-out numbers to actual numbers, it knows constants like PI, and it can do the actual math to get a single output.\n  \n\n\nhttps://github.com/SubatomicPlanets/SimpleStringMath"},
{"Title": "Time Series Forecasting and Simulations: Python Signature Transformation Method", "Author": "u/Data_Nerd1979", "Content": "Signature of Time Series! Very interesting topic!\n  \n\n\nhttps://opendatascience.com/time-series-forecasting-and-simulations-python-signature-transformation-method/"},
{"Title": "a new mime detect library", "Author": "u/matz_naruto", "Content": "Hi, all:\n  \n\n    I created a library to detect mime. it's easy to customize. it's apache tika compatible, but it's implemented in pure python.\n  \n\n\nhttps://github.com/chenkovsky/fast-mime\n\n\n\n    Please give me a star, if you find it helps."},
{"Title": "Apps to code on ipad", "Author": "u/Fresh_One_4867", "Content": "I just started learning python and I was wondering if there are any reliable python apps I can use to run the system on ipad."},
{"Title": "Video Quality Ranker", "Author": "u/SAV_NC", "Content": "What my project does\n\n    Ranks videos based on overall quality. Takes into account multiple metrics to determine what quality is the best.\n  \nTarget audience\n\n    Home users / Video enthusiasts\n  \nComparison\n\n    This project uses the following metrics to rank videos:\n  \n\n\n\n\n\n\nResolution\n: Higher resolution videos are preferred.\n  \n\n\n\n\n\n\nFrame Rate\n: Videos with higher frame rates are ranked higher.\n  \n\n\n\n\n\n\nBitrate\n: Higher bitrate often indicates better quality.\n  \n\n\n\n\n\n\nCodec\n: Some codecs provide better quality than others at the same bitrate.\n  \n\n\n\n\n\n    The script extracts these metrics using \nffprobe\n from the FFmpeg suite and sorts the videos accordingly. Here's how the metrics are used:\n  \n\n\n\n\n\n\nResolution\n: The script first compares the resolution (width x height) of the videos. Higher resolutions are ranked higher.\n  \n\n\n\n\n\n\nFrame Rate\n: If two videos have the same resolution, the one with the higher frame rate is ranked higher.\n  \n\n\n\n\n\n\nBitrate\n: For videos with the same resolution and frame rate, the bitrate is used to determine the quality.\n  \n\n\n\n\n\n\nCodec\n: In case of a tie in all other metrics, the codec is considered to break the tie.\n  \n\n\n\n\nAccess the Script\n\n    You can access the script on GitHub \nhere"},
{"Title": "I need advice on using google pay API.", "Author": "u/CodeNSpinWizard", "Content": "So, as mentioned in the title I am making a smart expense tracker web app using python and flask, is obtaining transaction history from Google Pay safe using API, if Yes How should i proceed with that and if No what is a better way to obtain the transaction history so that the user's privacy and safety in not compromised."},
{"Title": "CherrySaaS [WIP 🚧]: An open-source SaaS template for Reflex. 🌸", "Author": "u/RevolutionaryPen4661", "Content": "What My Project Does\n\n\n\n\nCherrySaaS\n is a 100% \nopen-source\n \nPythonic SaaS template\n that lets you build crazy beautiful SaaS using \nChakra and Radix UIs powered by Reflex\n. It is currently a work in progress and requires community contribution because I don't have the energy to write the entire template. If I were to do an entire template, I would never open-source it as it would become hard to maintain alone. So, I need collaborators and community effort to remain it to be open-sourced. Here's the \nplanning\n in the notion (Comments are allowed on the notion site).\n  \n\n\nTarget Audience\n\n\n\n    It is meant for production but requires community contributions to complete. It is currently in work progress but if people make useful contributions, it can be accomplished faster.\n  \n\n\nComparison\n\n\n\n    The reason is that it is a rare project as no free SaaS template has ever been made in Pure-Python. There are proprietary 2 SaaS templates made using Reflex. So I decided to make a free one for the community too. I have looked at a SaaS template called \nshipfast.com\n (which is getting popular nowadays). Ah, yes this also became an inspiration but I wanted to make one free.\n  \n\n\nSelling Shovels During The Gold Rush ❌\nGiving away shovels for free during the Gold Rush ✔\n\n\n\n    If you want to be a collaborator, reach to me out on Discord (adarshgourabmahalik) or post your GitHub email in this \ndiscussion\n. Here's a discord link to preview the landing page of the template. \nhttps://discord.com/channels/1029853095527727165/1063735841333198938/1252953503106732053"},
{"Title": "Conway's game of life. can you find an optimization?", "Author": "u/Significant_Water_28", "Content": "little challenge for you, how fast can this be pushed in python?\n  \n\n    This function takes a numpy.ndarray / 2d numpy array, and returns the updated array. iv updated this function several times, this i the fastiest so far.\n  \n\n    numba jit dosn't like the double roll, and its faster than for loops in jit.\n  \ndef conways_game_of_life(board:numpy.ndarray):\n  n_neighbour = sum(numpy.roll(numpy.roll(board, i, 0), j, 1) for i in (-1, 0, 1) for j in (-1, 0, 1) if (i != 0 or j != 0))\n  board[(n_neighbour<2) | (n_neighbour>3)] = 0\n  board[(n_neighbour==3)] = 1\n  return board"},
{"Title": "A JIT compiler for CPython", "Author": "u/lutipri", "Content": "Brandt Bucher talks on JIT compiler for Python at CPython Core Developer Sprint. Brandt is  a member of the \nFaster CPython project\n, which is working on making the reference implementation of the language faster via a variety of techniques.\n  \n\n\nhttps://www.youtube.com/watch?v=HxSHIpEQRjs"},
{"Title": "Experimental Python Wheels for Windows on ARM64", "Author": "u/Balance-", "Content": "For anyone on a (new) Windows on Arm system, I found this great repo with Arm64 Windows wheels:\n  \n\n\n\n\n\n\nhttps://github.com/cgohlke/win_arm64-wheels\n\n\n\n\n\n\n\n\nHighlights\n\n\n\n\n\n\n\n    256 packages for Python 3.12\n  \n\n\n\n\n\n    Built with numpy 2 if possible\n  \n\n\n\n\n\n    Scipy stack: numpy with OpenBLAS, scipy, matplotlib, Pandas, scikit-learn, scikit-image, numba, etc.\n  \n\n\n\n\n\n    GIS stack: GDAL, netCDF4, pyproj, Shapely, rasterio, basemap, Fiona, etc.\n  \n\n\n\n\n\n    Image IO: Imagecodecs, Pillow, OpenImageIO, OpenEXR, pylibCZIrw, etc.\n  \n\n\n\n\n\n    Noteworthy: Pytorch, Kivy, opencv_python_headless, pymol-open-source, pywin32"},
{"Title": "json3pdf : Batch OCR for high quality document archiving.", "Author": "u/DrumcanSmith", "Content": "What my project does\n\n    Performs OCR on scanned Books using Microsoft Azure Document Intelligence read\n  \nTarget audience\n\n    People who are unsatisfied with traditional OCR People who want to add clear text to the original PDF and not just extract the text. People who want to archive documents at best quality.\n  \nComparasion\n\n    In my use case traditional OCR was near to useless. Tesseract was meh, Google API didn't process large files. Document Intelligence takes up to 500MB (although in practice a little less), and is possible to OCR 400-600 pages over books in batch by dividing and merging the source and results locally by only a few chunks. It doesn't provide the text in PDF form so that was my reason to start this project.\n  \n\n    Still in alpha and in separate modules and a lot of rigid coding, but it is working fine for my original task so thought maybe I'd showcase it.\n  \n\n\nhttps://github.com/DesertDoggy/json3pdf"},
{"Title": "Give me an idea for my project (telegram bot) in python.", "Author": "u/STNKTeam", "Content": "Give me an idea for my project (telegram bot) in python, I'm using aiogram3 for it. And i will mention your nickname/name in the project. Thanks."},
{"Title": "Parsing Python ASTs 20x faster with Rust", "Author": "u/the1024", "Content": "https://www.gauge.sh/blog/parsing-python-asts-20x-faster-with-rust"},
{"Title": "Trying to find this package", "Author": "u/CompositePrime", "Content": "I should have saved the post but maybe 4-6 months ago I was reading a post (I am pretty sure it was in \nr/Python\n) where someone created a package that creates a visual for data contained within a list. For example, let’s say I have a data frame where one of the columns is named “colors” and each record contains a list of colors. One record might be [black,blue,yellow] another record might have [blue,yellow,black]. The visual had two parts where the top was a column chart to show the frequency of the list combinations and below the column chart was more of a table that showed each “color” as one column and then across the row for each color and under the columns from the chart above was an indicator of sorts that would be greyed out of the color for that row was not in the corresponding columns list and highlighted another color of it was. Anyways this is probably a long shot but either the package or the name of this visual would be super helpful. Thanks python community!"},
{"Title": "Wednesday Daily Thread: Beginner questions", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "I am Nominating Myself for PSF Board of Directors", "Author": "u/tavallaie", "Content": "I am nominating myself for the PSF Board of Directors! 🌟 Check out my latest blog post to learn more about my journey, my commitment to the Python community, and my application for an OFAC license to expand educational activities in restricted areas.\n  \n\n    Read more at \nmy blog"},
{"Title": "Scrapegraph AI Tutorial; Scrape Websites Easily With LLaMA AI", "Author": "u/INSERT_KEYWORD", "Content": "I'm going to show you how to get Scrapegraph AI up and running, how to set up a language model, how to process JSON, scrape websites, use different AI models, and even turning your data into audio. Sounds like a lot, but it's easier than you think, and I'll walk you through it step by step.\n  \n\n\nhttps://www.scrapingbee.com/blog/scrapegraph-ai-tutorial-scrape-websites-easily-with-llama-ai/"},
{"Title": "Looking for a good WYZIWIG/visual editor to go with with Jinja + Weasyprint", "Author": "u/Benoss", "Content": "End goal is to produce PDF using external data and a template. Needs to support Jinja tags, conditionals and loops.\n  \n\n    Using \nhttps://github.com/Kozea/WeasyPrint\n and \nhttps://github.com/pallets/jinja\n as base stack (Open to other suggestions)\n  \n\n    I was thinking of building some base HTML templates but would be awesome if I could find a visual HTML editor that could produce code 100% compatible with Weasyprint so that end users can build templates by themselves or modify existing ones.\n  \n\n    Could be Wysiwyg based using \nhttps://editorjs.io\n or \nhttps://github.com/slab/quill\nor more advanced web builders like \nhttps://github.com/GrapesJS/grapesjs\n\n\n\n    Anybody built something similar?"},
{"Title": "What are the hardware requirements in a laptop to run Python + Future AI based projects?", "Author": "u/Madlynik", "Content": "I will buy a laptop for coding purposes but just started learning and practising Python using Pyecharm. What are the software requirements that lead to hardware specs a general Python coder must look into?\n  \n\n    Please suggest the hardware setup within a pocket friendly budget."},
{"Title": "rug 0.10.4 released", "Author": "u/n1___", "Content": "What's rug library:\n\n\n\n    Library for fetching various stock data from the internet (official and unofficial APIs).\n  \n\n\nSource code:\n\n\n\n\nhttps://gitlab.com/imn1/rug\n\n\n\n\nReleases including changelog:\n\n\n\n\nhttps://gitlab.com/imn1/rug/-/releases"},
{"Title": "NumPy 2.0.0 is the first major release since 2006.", "Author": "u/commandlineluser", "Content": "NumPy 2.0.0 is the first major release since 2006.\n  \n\n\n\n\n\n\nhttps://github.com/numpy/numpy/releases/tag/v2.0.0\n\n\n\n\n\n\n\n\nhttps://numpy.org/devdocs/release/2.0.0-notes.html\n\n\n\n\n\n\n\n\nhttps://numpy.org/devdocs/numpy_2_0_migration_guide.html"},
{"Title": "Load Tests Python Task Queues", "Author": "u/tuple32", "Content": "What My Project Does\n\n\n\n    While looking for task queues, I found that there are many options available in the Python ecosystem, making it really hard to choose the right one. To get a sense of how each library performs and to help make an informed decision, I conducted a load test on some of the most popular ones: Python-RQ, ARQ, Celery, Huey, and Dramatiq.\n  \n\n\nTarget Audience\n\n\n\n    I hope my findings can help those who are also looking for a task queue solution in Python.\n  \n\n\nComparison\n\n\n\n    Most articles out there seem to focus on comparing the features of these libraries but rarely discuss performance. While there could be a lot of improvements on my tests, I think it still provide some different insights into how each library handles heavy loads and concurrency.\n  \n\n\nLinks:\n\n\n\n    You can read  my findings \non my blog\n\n\n\n    Check out the source code: \non Github\n\n\n\n    Thanks"},
{"Title": "Aurora: An extensible Python static site generator", "Author": "u/zerojames_", "Content": "What My Project Does\n\n\n\n\nAurora\n is a fast, extensible Python static site generator. With Aurora, I can generate my personal website (~1,700 files, with multiple layers of jinja2 templates for each page) in < 4 seconds. Aurora generated 292,884 pages from a Hacker News post dataset in 2m:20s.\n  \n\n    Aurora supports incremental static regeneration, where pages can be regenerated in under 400ms, with hot reloading. I documented how this works \non my blog\n.\n  \n\n\nTarget Audience\n\n\n\n    I'm building Aurora to help me run my website, but it is built to be general so you can use it for your own projects. I would love feedback!\n  \n\n    I want this to be a tool for running static sites in production, at scale.\n  \n\n\nComparison\n\n\n\n    Aurora is inspired by the folder structure of Jekyll, but is written in Python. It has a hooks API that lets you define custom Python functions that manipulate the state of a page. This allows you to implement custom behaviours in isolation of the engine itself. I use this to open link previews from a cache that I plan to use on my website, among other things."},
{"Title": "Looking to learn Tkinter", "Author": "u/Odd-Blacksmith1872", "Content": "Does anyone know of a full course to learn the Python Tkinter library? I want courses that\n  \n\n\n\n\n\n    Are in video format\n  \n\n\n\n\n\n    Are not FreeCodeCamp\n  \n\n\n\n\n\n    Do not exceed 8 hours\n  \n\n\n\n\n\n    Optionally in these full courses, I also want to see\n  \n\n\n\n\n\n    Examples with explanations\n  \n\n\n\n\n\n    Mini projects\n  \n\n\n\n\n\n    How to package and publish apps made with Tkinter"},
{"Title": "Suggestion: make ray.io a part of Python's std lib", "Author": "u/jmakov", "Content": "Imagine having the option to write code once and run on multiple cores or on the cluster as part of the std lib. I know there's a company (currently) behind it - Anyscale, also not sure what the license is but other than that, what's holding the Py community back?"},
{"Title": "Advise on choosing UI technology with Python", "Author": "u/green9cactus", "Content": "I am new to python and currently working on simple 3 layer web application -\n  \n\n\n\n\n\n    frontend - ?\n  \n\n\n\n\n\n    backend API to fetch data from DB - python\n  \n\n\n\n\n\n    DB - cloud\n  \n\n\n\n\n\n    This application has main intention to fetch data from DB, display graphs , table format data etc.  also perform some combination analysis of data and show on UI.\n  \n\n    Which less complex and stable technology I should prefer for frontend ? python flask, Bulma, Mesop by google or any other ? Thank you."},
{"Title": "Tuesday Daily Thread: Advanced questions", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "Ruff: A Modern Python Linter for Error-Free and Maintainable Code", "Author": "u/ajpinedam", "Content": "Linting is essential to writing clean and readable code to share with others. A linter, like Ruff, is a tool that analyzes your code and looks for errors, stylistic issues, and suspicious constructs. Linting allows you to address issues and improve your code quality before you commit your code and share it with others.\n  \n\n    Ruff is a modern linter that’s extremely fast and has a simple interface, making it straightforward to use. It also aims to be a drop-in replacement for many other linting and formatting tools, such as Flake8, isort, and Black. It’s quickly becoming one of the most popular Python linters.\n  \nInstalling Ruff\n\n    Now that you know why linting your code is important and how Ruff is a powerful tool for the job, it’s time to install it. Thankfully, Ruff works out of the box, so no complicated installation instructions or configurations are needed to start using it.\n  \n\n    Assuming your project is already set up with a virtual environment, you can install Ruff in the following ways:\n  \n```bash\n$ python -m pip install ruff\n```\n\nYou can check that Ruff installed correctly by using the ruff version command:\n\n```bash\n$ ruff version\nruff 0.4.7\n```\nLinting Your Python Code\n\n    While linting helps keep your code consistent and error-free, it doesn’t guarantee that your code will be bug-free. Finding the bugs in your code is best handled with a debugger and adequate testing, which won’t be covered in this tutorial. Coming up in the next sections, you’ll learn how to use Ruff to check for errors and speed up your workflow.\n  \nChecking for Errors\n```bash\n$ ruff check\none_ring.py:1:8: F401 [*] `os` imported but unused\none_ring.py:10:12: F821 Undefined name `name`\nFound 2 errors.\n[*] 1 fixable with the `--fix` option.\n```\n\n    Success! Ruff found two errors. Not only does it show the file and line numbers of the errors, but it also gives you error codes and messages. In addition, it lets you know that one of the two errors is fixable. Great!\n  \n\n    You can tell Ruff to fix errors by applying the --fix flag. Here’s what happens when you follow its suggestion:\n  \n```bash\n$ ruff check --fix\none_ring.py:9:12: F821 Undefined name `name`\nFound 2 errors (1 fixed, 1 remaining).\n```\n\n    You can find the rest of this Free tutorial \nhere"},
{"Title": "Advice for creating 3D modelling program", "Author": "u/Latter-History-8053", "Content": "I am creating a Python program which models 3D shapes so that they can be saved and or interacted with (i.e. rotated). The process currently takes a while to render shapes consisting of multiple materials. The libraries being implemented are currently matplotlib and numpy. What would you advise for improving the rendering process (library choice etc)?"},
{"Title": "Efficient Resource Management in Python: A Guide to Using Context Managers", "Author": "u/ImmediateDecision320", "Content": "Managing resources efficiently in Python is crucial to prevent memory leaks and ensure optimal performance. One of the best ways to handle resource allocation and deallocation is through the use of context managers. In my latest blog post, I dive deep into the concept of context managers, their significance, and how to implement them using both the built-in `with` statement and the `contextlib` module.\n  \n\n    Here's a brief overview of what you'll find in the article:\n  \n\n\nUnderstanding Context Managers:\n\n\n\n    What They Are: Context managers help manage resources such as file handling and database connections by setting up a temporary runtime context and cleaning up after the operations are completed.\n  \n\n    The `with` Statement: The primary way to use context managers in Python, ensuring that resources are properly handled even if an exception occurs.\n  \n\n    The `contextlib` Module: Provides utilities for creating and working with context managers, offering more control over resource management.\n  \n\n\nUsing Context Managers:\n\n\n\n    Built-in Context Managers: How to use the `with` statement with built-in context managers like file handling.\n  \n\n\nfile_path = \"Context.txt\"\n\n\n\n\nwith open(file_path, 'r') as file:\n\n\n\n\nfile_content = file.read()\n\n\n\n\nprint(\"The Content of file is:\")\n\n\n\n\nprint(file_content)\n\n\n\n\nCustom Context Managers:\n Implementing custom context managers using the `__enter__()` and `__exit__()` methods.\n  \n\n\nclass File:\n\n\n\n\ndef __init__(self, filename, mode):\n\n\n\n\nself.filename = filename\n\n\n\n\nself.mode = mode\n\n\n\n\ndef __enter__(self):\n\n\n\n\nprint(f\"Opening {self.filename} .......\")\n\n\n\n\nself.file = open(self.filename, self.mode)\n\n\n\n\nreturn self.file\n\n\n\n\ndef __exit__(self, exc_type, exc_value, traceback):\n\n\n\n\nprint(f\"Closing {self.filename} ......\")\n\n\n\n\nself.file.close()\n\n\n\n\nwith File('Context.txt', 'r') as file:\n\n\n\n\ncontent = file.read()\n\n\n\n\nprint(content)\n\n\n\n\nAdvanced Techniques:\n\n\n\n    The `contextlib` Decorator: Creating context managers using the `contextmanager` decorator.\n  \n\n\nfrom contextlib import contextmanager\n\n\n\n\ncontextmanager\n\n\n\n\ndef file(filename, mode):\n\n\n\n\nprint(\"This is the implicit ENTER block\")\n\n\n\n\nmy_file = open(filename, mode)\n\n\n\n\nyield my_file\n\n\n\n\nprint(\"This is the implicit EXIT block\")\n\n\n\n\nmy_file.close()\n\n\n\n\nwith file(\"Context.txt\", 'r') as file_content:\n\n\n\n\ncontent = file_content.read()\n\n\n\n\nprint(content)\n\n\n\n\nHandling Exceptions:\n Ensuring proper resource management and cleanup even in the presence of exceptions.\n  \n\n    I hope this guide helps you understand the importance of context managers and how to use them effectively in your Python projects. You can read the full article \nhere\n for more detailed examples and explanations. Happy coding!"},
{"Title": "pieshell: python for shell scripting and as an interactive shell", "Author": "u/Severe_Inflation5326", "Content": "Pieshell is a Python shell environment that combines the expressiveness of shell pipelines with the power of python iterators.\n  \n\n    It can be used in two major ways:\n  \n\n\n\n\n\n    As an interactive shell replacing e.g. bash\n  \n\n\n\n\n\n    As an ordinary python module replacing e.g. subprocess.Popen\n  \n\n\n\n\n\n    Obligatory example:\n  \n140:/home/oven/pieshell >>> for x in ls(-a) | tr(\"s\", \"S\"):\n...   if x.endswith('.py'):\n...      print x\n... \nSetup.py\n\n    Source code: \nhttps://github.com/redhog/pieshell\n\n\nWhat the project does\n\n    It's a replacement for the subprocess module, and for bash as an interactive shell, and makes interacting with shell pipelines easier.\n  \nTarget Audience\n\n    System administrators, system software developers, data scientists\n  \nComparison\n\n    While os.system is very limited but easy to use, subprocess.Popen offers a lot of flexibility, but the interface is very low level. Any actual pipelining of multiple programs is pretty much required to be done by e.g. a bash process, constructing the pipeline as a shell script string. Further, interacting with standard in and standard out requires careful IO handling.\n  \n\n    Pieshell on the other hand lets you construct pipelines as python objects. Standard io from a pipeline can be handled using iterators or async iterators. Pieshell has full asyncio integration."},
{"Title": "How does Python earn money? What would have been their business model?", "Author": "u/Civil-Captain5676", "Content": "I was wondering recently about any startup and any coding language that how does they make money. So I was curious to know about Python which is widely used"},
{"Title": "I created a script to automatically patch revanced", "Author": "u/ltlbwu", "Content": "What My Project Does\n\n\n\n    AutoReVanced is a Python script that automates downloading and patching APKs using ReVanced patches from ApkPure. It's perfect for anyone wanting to patch their revanced app.\n  \n\n\nTarget Audience\n\n\n\n    Suitable for a fun side project or hobbyists, AutoReVanced is designed for anyone wanting to customize Android apps with ReVanced patches.\n  \n\n\nComparison\n\n\n\n    Unlike alternatives, AutoReVanced is automatic.\n  \n\n    GitHub: \nautorevanced"},
{"Title": "Monday Daily Thread: Project ideas!", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "abstract-factories - a simple framework for content creation pipelines", "Author": "u/HistoricalCrow", "Content": "Hey all, my project \nabstract_factories\n is up to gauge interest and primarily feedback.\n  \n\n    The design goal is to make it easier to iterate on typical Content Creation pipeline tools (tool dev, rigging, validation, asset management etc) with a flexible framework to provide convenience, open and simple design and no dependencies (currently). It's an approach I've used a lot over the years and found it pretty versatile in production across numerous projects.\n  \nKey features\n\n\n\n\n\n    Auto-registration of matching items (types or instances) from any given path or python module.\n  \n\n\n\n\n\n    Simple or conditional item identifiers.\n  \n\n\n\n\n\n    Versioning.\n  \n\n\n\n\n\n    Recursive path searching (recursive module search in review).\n  \n\n\n\n\n\n    Dynamic resolving and importing modules in packaged (supports relative importing).\n  \n\n\n\n\nUsage Examples\n\n    There are a couple of \nsimple examples\n given along with tests to cover all of the current features.\n  \nWhat the project does\n\n    It's a convenience package for creating scalable tools and frameworks using \nAbstract Factory\n design pattern.\n  \nTarget Audience\n\n    Due to the solutions it's built for, it's aimed primarily at Technical Artists, Technical Animators, Pipeline and Tool Developers, but I'm interested in hearing about other possible applications.\n  \nComparison\n\n    Compared to other Factory and Abstract Factory convenience packages, mine is based on the work from \nthis GDC talk\n. The direct \nabstract-factories\n currently comes with a few more conveniences I've found useful during production. The idea stems from boiling down \nPyblish\n to something that became a little more reusable when writing frameworks as opposed to being the framework.\n  \n\n    Suggestions, questions, comments etc welcome."},
{"Title": "Showcase: pdf-to-podcast.com -- Convert PDF's to podcast episodes. Free and open-source :)", "Author": "u/knowsuchagency", "Content": "What My Project Does\n\n    Upload any PDF and have it converted into a podcast episode with two or more speakers discussing its contents.\n  \n\n\nhttps://github.com/knowsuchagency/pdf-to-podcast\n\n\nTarget Audience\n\n    Anyone, but other developers in-particular. The code is open-source on GitHub and there's a link to the source on \nhttps://pdf-to-podcast.com\n. I want the project to serve as an illustrative example of how to build useful things on top of LLMs with relatively little code.\n  \nComparison\n\n    I just made this for fun. It's possible there are other similar projects"},
{"Title": "Have anyone tried google/mesop", "Author": "u/codes_astro", "Content": "Google Open sourced Mesop. Mesop is a Python-based UI framework that allows you to rapidly build web apps. Used at Google for rapid internal app development similar to Streamlit.\n  \n\n    find more \nhere"},
{"Title": "Privacy-first natural language to SQL + charting + editing app", "Author": "u/anthony2261", "Content": "What my project does\n\n\nDataLine \nis an AI-driven open source and privacy-first platform for data exploration. Your data is accessed using your device and stored on your device.\n  \n\n    In simple terms, it's an interface that allows you to \"chat\" with your database/dataset. You can ask it explorative questions, e.g. \"what potential insights can I find in this data\", or specific questions \"who are my top five customers in the past 3 months\", and it will gladly oblige. The backend is written using FastAPI, and the frontend uses Reactjs.\n  \n\n    For me, it acts as a tool that gives me a 10x speed boost. The fact that it can now generate charts out of the data, live, blows my mind still.\n  \nTarget Audience\n\n    Anyone who has data, regardless of whether they're technical or non-technical people. Devs, data scientists, marketing, sales, farmers, people working alone, in a startup, or in big enterprises.\n  \nComparison\n\n\n\n\n\n    No data leaves your machine. In other words, no data is sent to 3rd parties. Not even to us.\n  \n\n\n\n\n\n    DataLine is free and open source - all other alternatives are paid and closed source. Anyone is free to check out \nthe repo\n and contribute!\n  \n\n\n\n\n\n    Specializes in data exploration, generates charts and SQL, and allows editing and rerunning queries for flexibility."},
{"Title": "I created Yu-Gi-Oh! Power of Chaos save handler", "Author": "u/wildpantz", "Content": "Quick backstory:\n  \n\n    Upper floor of my house is sort of a man-cave until we decorate it, so during this time I have two PCs which I use to play games with a friend when we have extra time to waste. The other day I remembered the game mentioned in the title and we had lots of fun playing it (there's 3 different games in this series). I decided I'd transfer the save file to my main PC so I can play when he's not visiting and I quickly learned it's an extremely annoying process to transfer save files across different PCs. Long story short, you need to find a proper registry key (which isn't always located at same spot for some reason) and you need to locate a system.dat file also located in a folder that isn't always in the same place. This process gets tedious pretty quick, so I decided to use the power of Python to make my life easier.\n  \n\n    What the project does:\n  \n\n    It's essentially a CLI save handler for the game mentioned in the title. It has 5 slots where you can backup your current save or load the backup to the computer. It can also fix minor registry issues if needed.\n  \n\n    Target audience:\n  \n\n    Given that I'm about 20 years too late... I'd say mostly people with very slow PCs or people who like to inhale nostalgia.\n  \n\n    I learned a lot about using winreg and msvcrt and getch, so while I will likely get bored of the game in the coming weeks, I'm happy I learned something new in the meantime, plus maybe someone finds it useful!\n  \n\n    Source code: \nmarkomavrinac/yugioh_poc_save_handler: Yu-Gi-Oh! Power of Chaos save handler - A script to manage your save games across multiple computers (github.com)"},
{"Title": "Tutorial: A Timely Python Multi-page Streamlit Application on Olympic Medal Winning Countries", "Author": "u/jgloewen", "Content": "Streamlit\n is an open-source app framework that allows data scientists and analysts to create interactive web applications with ease.\n  \n\n    Using just a few lines of Python, you can turn data scripts into shareable web apps.\n  \n\n    And combined with a data visualization library like \nPlotly,\n you can create beautiful charts and maps with only a few lines of code.\n  \n\n    In this article, let me step you through how to use \nStreamlit\n to create a multi-page interactive application that visualizes Olympic medal data.\n  \n\n    The application will have three pages:\n  \n\n\n\n\n\n    an overview of medal counts,\n  \n\n\n\n\n\n    a country-specific analysis, and\n  \n\n\n\n\n\n    a choropleth map displaying global medal distributions.\n  \n\n\n\n\n\n    Let’s get to it!\n  \n\n    Link to free article \nHERE\n\n\n\n    Github repo \nHERE"},
{"Title": "Learning Python coming from a JVM background", "Author": "u/Human_Dependent6814", "Content": "I have 4 years worth JVM languages (Java, Kotlin) and have a need to learn some Python.  What's a good resource to get up to speed quickly with idiomatic Python?"},
{"Title": "I made a cool calendar app with PyQt6", "Author": "u/Specialist-Arachnid6", "Content": "Tempus is a calendar with horoscopes, reminders, etc made with PyQt6\n  \nWhat my Project does?\n\n    Tempus is a desktop-based calendar management application built with PyQt6, allowing users to manage their todos, reminders, and special dates efficiently. It offers features like adding, editing, and deleting tasks and reminders, as well as marking dates as special. Tempus ensures users stay organized and never miss important events. Plus, it shows you how many days are remaining until a special day in the dashboard.\n  \nTarget Audience\n\n    Well, anyone who uses a desktop calendar app I guess?\n  \nComparison\n\n    I did some research and couldn't find good calendar apps made with PyQt6.  If you guys knows any, please mention it below and I'm sorry in advance.\n  \nGitHub\n\n\nhttps://github.com/rohankishore/Tempus"},
{"Title": "Better-OrderedMultiDict - a fast pure-pyton implementation of an ordered multi-valued dictionary.", "Author": "u/JoachimCoenen", "Content": "What my project does\n\n    It provides a fast pure-python implementation of an ordered, multi-valued dictionary.\n  \nTarget audience\n\n    Python developers that need this kind of specialized functionality.\n  \n\n    This can be used in production. It has no dependencies. The code is unit-tested (almost fully, I'm working on it) It requires Python 3.12+\n  \nComparison\nComparison to dict and OrderedDict\n\n\ndict\n and \nOederedDict\n are already ordered, but they only allow one value per key. You could use a defaultdict of lists, but then you have these disadvantages:\n  \n\n\n\n\n\n    you can end up with empty lists within the dict if you aren't careful\n  \n\n\n\n\n\n    you lose the order of individual items within the dict:\n  \n\n\n\n\n\n\nitems = [(1, '1'), (2, '2'), (2, '22'), (1, '11')]\nnormal_dict = defaultdict(list)\nfor key, value in items:\n    normal_dict [key].append(value)\nom_dict = OrderedMultiDict(items)\nprint(list(normal_dict .items)) # prints [(1, ['1', '11']), (2, ['2', '22'])] \nprint(list(om\\_dict.items))     # prints [(1, '1'), (2, '2'), (2, '22'), (1, '11')]\n\n\n\n\n\n    iterating over all key/value pairs can be cumbersome as you need nested loops\n  \n\n\n\n\nComparison to \nomdict\n.\n\n\nOederedDict\n provides a (in my opinion) nicer interface with less surprising behavior or pitfalls. My implementation is also faster. e.g iterating over all items is ~5x faster.\n  \nMore info\n\n    This started as a toy project, that later became useful to me, so I decided to cleanup the code, add tests, and publish it.\n  \nfrom better_orderedmultidict import OrderedMultiDict\nomd: OrderedMultiDict[int, int] = OrderedMultiDict([(1,1), (2,2), (1,11), (2,22)])\n\nfor key in reversed(omd.unique_keys()):\n    print(f\"{key}: {omd.getall(key)}\")\n# prints:\n# 2: [2, 22]\n# 1: [1, 11]\n\nprint(omd.popfirstitem())  # prints: (1, 1)\nprint(omd.poplast(2))  # prints: 22\n\nfor key in reversed(omd.unique_keys()):\n    print(f\"{key}: {omd.getall(key)}\")\n# prints:\n# 2: [2]\n# 1: [11]\nInstallation\n\n    You can install Better-OrderedMultiDict using pip:\n  \npip install better-orderedmultidict\nContributing\n\n    If you have any suggestions or improvements for Better-OrderedMultiDict, feel free to submit a pull request or open an issue on the \nGitHub repository\n. I appreciate any feedback or contributions!\n  \nLinks\n\n    Here's the link to the GitHub repository: \nhttps://github.com/JoachimCoenen/Better-OrderedMultiDict\n\n\n\n    Here's the link to PyPi: \nhttps://pypi.org/project/better-orderedmultidict"},
{"Title": "Cant decide between flask, django ninja or fastAPI for sideproject", "Author": "u/Eggesalt", "Content": "As the title says, I cant decide what to use for rest api for mye summer project. I am uni student, so this project will only be very small scale project. I have made simpel rest apis in sll of them, but still cant decide which one to actuslly use for my project. Do anyone have any tips for which might be right one? A thing to consider for me answel is how easy it is to host."},
{"Title": "Sunday Daily Thread: What's everyone working on this week?", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "Thursday Daily Thread: Python Careers, Courses, and Furthering Education!", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "Should all Python projects have type hinting?", "Author": "u/Ok-Frosting7364", "Content": "I recently released a \nvery simple API wrapper\n and in my efforts to become a better programmer I asked in a Python Discord for feedback.\n  \n\n    One bloke was very adamant I should use type hints. I understand the need/desire for type hints but this commentator basically was implying that all Python code should be written with type hints.\n  \n\n    For a simple project I didn't think it was necessary but I'm curious as to what this community thinks.\n  \n\n    How do you make the decision as to when to use type hints? Do you do it for all projects, regardless of size? What are your general thoughts?"},
{"Title": "NumPy 2.0: an evolutionary milestone", "Author": "u/partev", "Content": "an interesting blog post about the latest NumPy release:\n  \n\n\nhttps://blog.scientific-python.org/numpy/numpy2/"},
{"Title": "Anyone have experience using Vercel to host Python projects?", "Author": "u/marcelmarais", "Content": "Vercel is really convenient for NextJS and tbh it would be really nice to host and manage everything from one place.\n  \n\n    Unfortunately the documentation is pretty sparse and there doesn't seem to be many resources on the topic."},
{"Title": "Textual Serve - Serve TUIs in the browser", "Author": "u/willm", "Content": "Textual Serve (\nhttps://github.com/Textualize/textual-serve\n) is a project which serves TUIs (built with Textual) in the browser.\n  \n\n    This is self-hosted, so you don't need to rely on any external service."},
{"Title": "Python on ARM laptops", "Author": "u/Fun-Asparagus-837", "Content": "Hi there !\n  \n\n    I'm thinking about buying an ARM windows laptop with the new Qualcomm chips. They will replace the x86 so I was wondering : Will There be a massive risk of non-compatibility of Python packages ? I guess they are made for x86 but I don't know if it's possible to work with them with an ARM based CPU."},
{"Title": "Python Project Management Primer", "Author": "u/Martynoas", "Content": "This article\n explores how to manage Python project environments and dependencies, as well as how to structure projects effectively."},
{"Title": "karpet 0.5 released", "Author": "u/n1___", "Content": "What's karpet library:\n\n\n\n    Library for fetching coin/token historical data, trends and more (official and unofficial APIs).\n  \n\n\nSource code:\n\n\n\n\nhttps://gitlab.com/imn1/karpet\n\n\n\n\nReleases including changelog:\n\n\n\n\nhttps://gitlab.com/imn1/karpet/-/releases"},
{"Title": "I made a simple python script which can evaluate a mathematical expression from a string", "Author": "u/SubatomicPlanets", "Content": "I made this simple Python file a year ago. I thought you might be interested.\n  \n\n    It is only 100 lines long and uses no external libraries. It can do math on a string like this:\n  \n\n    \"What's fifty three+7*6/2?\" -> 74\n  \n\n    It can convert written-out numbers to actual numbers, it knows constants like PI, and it can do the actual math to get a single output.\n  \n\n\nhttps://github.com/SubatomicPlanets/SimpleStringMath"},
{"Title": "Time Series Forecasting and Simulations: Python Signature Transformation Method", "Author": "u/Data_Nerd1979", "Content": "Signature of Time Series! Very interesting topic!\n  \n\n\nhttps://opendatascience.com/time-series-forecasting-and-simulations-python-signature-transformation-method/"},
{"Title": "a new mime detect library", "Author": "u/matz_naruto", "Content": "Hi, all:\n  \n\n    I created a library to detect mime. it's easy to customize. it's apache tika compatible, but it's implemented in pure python.\n  \n\n\nhttps://github.com/chenkovsky/fast-mime\n\n\n\n    Please give me a star, if you find it helps."},
{"Title": "Apps to code on ipad", "Author": "u/Fresh_One_4867", "Content": "I just started learning python and I was wondering if there are any reliable python apps I can use to run the system on ipad."},
{"Title": "Video Quality Ranker", "Author": "u/SAV_NC", "Content": "What my project does\n\n    Ranks videos based on overall quality. Takes into account multiple metrics to determine what quality is the best.\n  \nTarget audience\n\n    Home users / Video enthusiasts\n  \nComparison\n\n    This project uses the following metrics to rank videos:\n  \n\n\n\n\n\n\nResolution\n: Higher resolution videos are preferred.\n  \n\n\n\n\n\n\nFrame Rate\n: Videos with higher frame rates are ranked higher.\n  \n\n\n\n\n\n\nBitrate\n: Higher bitrate often indicates better quality.\n  \n\n\n\n\n\n\nCodec\n: Some codecs provide better quality than others at the same bitrate.\n  \n\n\n\n\n\n    The script extracts these metrics using \nffprobe\n from the FFmpeg suite and sorts the videos accordingly. Here's how the metrics are used:\n  \n\n\n\n\n\n\nResolution\n: The script first compares the resolution (width x height) of the videos. Higher resolutions are ranked higher.\n  \n\n\n\n\n\n\nFrame Rate\n: If two videos have the same resolution, the one with the higher frame rate is ranked higher.\n  \n\n\n\n\n\n\nBitrate\n: For videos with the same resolution and frame rate, the bitrate is used to determine the quality.\n  \n\n\n\n\n\n\nCodec\n: In case of a tie in all other metrics, the codec is considered to break the tie.\n  \n\n\n\n\nAccess the Script\n\n    You can access the script on GitHub \nhere"},
{"Title": "I need advice on using google pay API.", "Author": "u/CodeNSpinWizard", "Content": "So, as mentioned in the title I am making a smart expense tracker web app using python and flask, is obtaining transaction history from Google Pay safe using API, if Yes How should i proceed with that and if No what is a better way to obtain the transaction history so that the user's privacy and safety in not compromised."},
{"Title": "CherrySaaS [WIP 🚧]: An open-source SaaS template for Reflex. 🌸", "Author": "u/RevolutionaryPen4661", "Content": "What My Project Does\n\n\n\n\nCherrySaaS\n is a 100% \nopen-source\n \nPythonic SaaS template\n that lets you build crazy beautiful SaaS using \nChakra and Radix UIs powered by Reflex\n. It is currently a work in progress and requires community contribution because I don't have the energy to write the entire template. If I were to do an entire template, I would never open-source it as it would become hard to maintain alone. So, I need collaborators and community effort to remain it to be open-sourced. Here's the \nplanning\n in the notion (Comments are allowed on the notion site).\n  \n\n\nTarget Audience\n\n\n\n    It is meant for production but requires community contributions to complete. It is currently in work progress but if people make useful contributions, it can be accomplished faster.\n  \n\n\nComparison\n\n\n\n    The reason is that it is a rare project as no free SaaS template has ever been made in Pure-Python. There are proprietary 2 SaaS templates made using Reflex. So I decided to make a free one for the community too. I have looked at a SaaS template called \nshipfast.com\n (which is getting popular nowadays). Ah, yes this also became an inspiration but I wanted to make one free.\n  \n\n\nSelling Shovels During The Gold Rush ❌\nGiving away shovels for free during the Gold Rush ✔\n\n\n\n    If you want to be a collaborator, reach to me out on Discord (adarshgourabmahalik) or post your GitHub email in this \ndiscussion\n. Here's a discord link to preview the landing page of the template. \nhttps://discord.com/channels/1029853095527727165/1063735841333198938/1252953503106732053"},
{"Title": "Conway's game of life. can you find an optimization?", "Author": "u/Significant_Water_28", "Content": "little challenge for you, how fast can this be pushed in python?\n  \n\n    This function takes a numpy.ndarray / 2d numpy array, and returns the updated array. iv updated this function several times, this i the fastiest so far.\n  \n\n    numba jit dosn't like the double roll, and its faster than for loops in jit.\n  \ndef conways_game_of_life(board:numpy.ndarray):\n  n_neighbour = sum(numpy.roll(numpy.roll(board, i, 0), j, 1) for i in (-1, 0, 1) for j in (-1, 0, 1) if (i != 0 or j != 0))\n  board[(n_neighbour<2) | (n_neighbour>3)] = 0\n  board[(n_neighbour==3)] = 1\n  return board"},
{"Title": "A JIT compiler for CPython", "Author": "u/lutipri", "Content": "Brandt Bucher talks on JIT compiler for Python at CPython Core Developer Sprint. Brandt is  a member of the \nFaster CPython project\n, which is working on making the reference implementation of the language faster via a variety of techniques.\n  \n\n\nhttps://www.youtube.com/watch?v=HxSHIpEQRjs"},
{"Title": "Experimental Python Wheels for Windows on ARM64", "Author": "u/Balance-", "Content": "For anyone on a (new) Windows on Arm system, I found this great repo with Arm64 Windows wheels:\n  \n\n\n\n\n\n\nhttps://github.com/cgohlke/win_arm64-wheels\n\n\n\n\n\n\n\n\nHighlights\n\n\n\n\n\n\n\n    256 packages for Python 3.12\n  \n\n\n\n\n\n    Built with numpy 2 if possible\n  \n\n\n\n\n\n    Scipy stack: numpy with OpenBLAS, scipy, matplotlib, Pandas, scikit-learn, scikit-image, numba, etc.\n  \n\n\n\n\n\n    GIS stack: GDAL, netCDF4, pyproj, Shapely, rasterio, basemap, Fiona, etc.\n  \n\n\n\n\n\n    Image IO: Imagecodecs, Pillow, OpenImageIO, OpenEXR, pylibCZIrw, etc.\n  \n\n\n\n\n\n    Noteworthy: Pytorch, Kivy, opencv_python_headless, pymol-open-source, pywin32"},
{"Title": "json3pdf : Batch OCR for high quality document archiving.", "Author": "u/DrumcanSmith", "Content": "What my project does\n\n    Performs OCR on scanned Books using Microsoft Azure Document Intelligence read\n  \nTarget audience\n\n    People who are unsatisfied with traditional OCR People who want to add clear text to the original PDF and not just extract the text. People who want to archive documents at best quality.\n  \nComparasion\n\n    In my use case traditional OCR was near to useless. Tesseract was meh, Google API didn't process large files. Document Intelligence takes up to 500MB (although in practice a little less), and is possible to OCR 400-600 pages over books in batch by dividing and merging the source and results locally by only a few chunks. It doesn't provide the text in PDF form so that was my reason to start this project.\n  \n\n    Still in alpha and in separate modules and a lot of rigid coding, but it is working fine for my original task so thought maybe I'd showcase it.\n  \n\n\nhttps://github.com/DesertDoggy/json3pdf"},
{"Title": "Give me an idea for my project (telegram bot) in python.", "Author": "u/STNKTeam", "Content": "Give me an idea for my project (telegram bot) in python, I'm using aiogram3 for it. And i will mention your nickname/name in the project. Thanks."},
{"Title": "Parsing Python ASTs 20x faster with Rust", "Author": "u/the1024", "Content": "https://www.gauge.sh/blog/parsing-python-asts-20x-faster-with-rust"},
{"Title": "Trying to find this package", "Author": "u/CompositePrime", "Content": "I should have saved the post but maybe 4-6 months ago I was reading a post (I am pretty sure it was in \nr/Python\n) where someone created a package that creates a visual for data contained within a list. For example, let’s say I have a data frame where one of the columns is named “colors” and each record contains a list of colors. One record might be [black,blue,yellow] another record might have [blue,yellow,black]. The visual had two parts where the top was a column chart to show the frequency of the list combinations and below the column chart was more of a table that showed each “color” as one column and then across the row for each color and under the columns from the chart above was an indicator of sorts that would be greyed out of the color for that row was not in the corresponding columns list and highlighted another color of it was. Anyways this is probably a long shot but either the package or the name of this visual would be super helpful. Thanks python community!"},
{"Title": "Wednesday Daily Thread: Beginner questions", "Author": "u/AutoModerator", "Content": "Daily Thread"},
{"Title": "I am Nominating Myself for PSF Board of Directors", "Author": "u/tavallaie", "Content": "I am nominating myself for the PSF Board of Directors! 🌟 Check out my latest blog post to learn more about my journey, my commitment to the Python community, and my application for an OFAC license to expand educational activities in restricted areas.\n  \n\n    Read more at \nmy blog"}
]