[
{"Title": "Official Giveaway: June 2024 Seagate IronWolf Pro 16TB Hard Drive Giveaway", "Author": "u/Seagate_Surfer", "Content": "Hi r/DataHoarder crowd! We love your sub and would like to rev up another giveaway with the permission of the mod team. The prize is: one 16TB IronWolf Pro Hard Disk Drive How to enter: Just reply to this post once with a top-level comment response on the following topic: What kind of loyalty program matters to you for a company? Is drive capacity, price point, excellent customer service, etc. the highest priority for you? Please include the phrases RunWithIronWolf and Seagate in your comment. Selection process/rules One entry per person. Using alt accounts will result in a ban. New accounts created after this post went live are not eligible. Entries are open until June 27, 2024 at 23:59 UTC. We will use a random raffler utility to filter out top level comments (that is, top-level replies to this post, and not to another comment, and not on any cross-posts). The tool will remove duplicate usernames, sort the list, and grab the randomly chosen username, at which point the winner will be contacted within a day or so of the giveaway ending. Winners will have 48 hrs to get us their physical address and contact details for shipping (no PO boxes). Any person who does not reply in time loses their spot and everyone moves up a tier. For example: the 1st place person does not respond, so the 2nd place person gets contacted. Seagate will use the information strictly for shipping purposes only and will ship the drive directly. We reserve the right to edit this post including this process and these rules without notice. This is reddit, after all. Geographic restrictions: Our policy is for our forums and Reddit giveaways to be global where local shipping and/or giveaway restrictions/current world events don’t prevent us, however we are basing the below list of eligible counties from previous giveaways, as some counties have unique restrictions (e.g. the obvious shipping restrictions to Russia and Belarus currently) US Canada (will require a basic skills-based question if winner is chosen by law) Brazil South America United Kingdom Germany France Iberia Australia New Zealand Korea India Malaysia Singapore China"},
{"Title": "Internet forums are disappearing because now it's all Reddit and Discord. And that's worrying.", "Author": "u/Run_the_Line", "Content": "No content"},
{"Title": "Seagate opens new eBay US store for recertified drives", "Author": "u/Constellation16", "Content": "No content"},
{"Title": "Archiving ~500 raw comic books", "Author": "u/AndroidAssistant", "Content": "I'm trying to digitize my father's ~500 comic book collection before his birthday in August so he can read them on his tablet. He gifted them to me a while back because, while he wouldn't admit it, his eyes are starting to go, and he couldn't enjoy them anymore. With the tablet he can zoom in as far as needed so I know he would love to revisit the comics once they are in digital form. Everything is in pristine condition with sleeves and backers, but there is nothing insanely valuable in the collection. He has a couple that are worth something, but most sit at >$10. That said, it would crush him if any were damaged so the scanning method must be non-destructive. What I have tried: Czur Aura Pro Super quick, but random cropping and glare for days, even using the side lights. I tried using it with the official light box, outside the box, with 1-5 additional lights, with only external lights at every angle known to man, in a diffusion light box, with polarizers, etc. The only thing that worked 100% of the time was scanning while sitting on my back porch on an overcast day. I opened a ticket with their support and the response was \"Make your room light bright enough, but do not have direct light shining on the book.\". They didn't address the cropping issues. Epson Perfection V600 Epson Scan - Impressive for OEM software but inconsistent and changing the framing is a pain unless things are at perfect right angles. VueScan - Sometimes it decides just not to scan, sometimes it scans and the image is black. When it does scan it does fine, but the auto skew is ~90% accurate which may as well be 0 because I have to adjust every single picture. Silverfast - I was surprised at how much better the scans look, but the scans take 2-3 times as long as the Vue or Epson software. Also I have to take a prescan every time I move the page? At this point I'm ready to hire a service if anyone has any suggestions, but I would really prefer to do the scanning myself because I plan on at least completing the series that he has, and probably expanding on them. I do have an R10 and an M50, so I could try some sort of diybookscanner.com solution, but that is a lot of effort for something that may or may not have different results."},
{"Title": "Need help in archiving a second coppy of the famitracker website and forums", "Author": "u/jreina2002", "Content": "Hello all. Last year I had requested of a website to be archived, called as http://famitracker.com/ When that site had gone down a year ago it came back up, and I wanted to preserve the site and its topics as well as music. It turns out that they had some initiative in doing so, but the people at the famitracker.org Discord server also had things going on in real life so they were unable to help archive at this time. I would like to ask if you can please help me? Not all of the famitracker site and forums were preserved apparently, and now we have a second shot at this! They're some things you should know though. First of all we need to archive at a speed that's safe for the site. It musn't be too fast otherwise the site might go down, but I also have a question. Is it possible that it can be made into an archive that's readable by those wanting to look at it as in not on archive.org?"},
{"Title": "Internet Archive forced to remove 500,000 books after publishers’ court win", "Author": "u/Jacksharkben", "Content": "No content"},
{"Title": "SATA HDD/SSD diagnostic tools? HW or SW?", "Author": "u/trapexit", "Content": "After just having a drive failure (of course it happened while transferring data to a new drive) I was wondering if there was any tooling around that perhaps data recovery folks leveraged to help diagnose issues. I've got two drives right now (8TB Seagate Archive drives) that died suddenly. One seems like it could be a bad logic board and I do have another with not just the same general board but the same batch? (same qr code) but haven't transferred the ROM between the boards to see if that will address it. The other (the one that died today while trying to transfer data to a new drive) will spin up but then makes a sound like the heads are seeking twice and then spins down. As I understand that's likely a hardware problem and not as home fixable. While the data one these drives aren't critical it would be nice to be able to better diagnose the problems to see if it is worth the hassle to try to recover them."},
{"Title": "Does my enterprise HDD enclosure need a fan?", "Author": "u/Top_Combination9023", "Content": "I barely know anything about data hoarding, but I want to store PDFs, games and music outside my laptop and flash drives aren't enough anymore. After some research here I'm going to buy a 16TB Exos (I can't afford a whole 3-2-1 setup). I just need the one so I was thinking an enclosure, but I saw mixed opinions on whether my enclosure needed a cooling fan. What would happen if I bought one without?"},
{"Title": "Is EaseUS Partition Surface Test Reliable?", "Author": "u/chineke14", "Content": "Just wanted to see if anyone has experience with using Easeus for surface test? I used HD Sentinel in the past, but figured I try Easeus in case it's faster. But in doign that, I am wondering if it's surface test is just as good as HD Sentinels?"},
{"Title": "When an external hard drive dies, what is your strategy?", "Author": "u/DrWho345", "Content": "When Samsung and WD drives start acting up, it will be working for ages, then one day, it will be connected as usual and then, no matter what you do, it won't mount, you can feel it running in your hands, but nothing shows up on your computer, you disconnect, reconnect, try to mount it via command/terminal absolutely nothing is working... what are your strategies/next steps? I have a few that have died/stopped working? and don't know what to do now. I have a Mac by the way, and an Windows 11 NUC running MacDrive, I have connected the drive to both, and have had nothing at all. Edit: when I connect it, I can feel it running when I touch it, but it doesn’t mount at all, I can’t backup anything because I can’t see anything when it is connected."},
{"Title": "Any advice on LTO-6 drive models (2nd hand on eBay) to look out for?", "Author": "u/freshairproject", "Content": "Which LTO6 drives do people usually recommend for Windows 11? I have 20tb that I’d like to back up in addition to other sata drives. Do used tape drives go bad? Like does it have a certain amount of writes before the magnet goes bad?"},
{"Title": "WD Red Old Stock being sold on Amazon", "Author": "u/jacraest", "Content": "I guess a warning and a bit of a wakeup call to check your drives and not to take sellers for granted on amazon. Bought a drive advertised as new and was manufactured in Dec 2016. Warranty expired in Dec 2019. 200 reallocated sectors within 40 on hours. Same - age WD Gold drive with 20k power on hours has no issues lol. This occured with the 3TB WD30EFRX model. Never had this issue on amazon before."},
{"Title": "Is this the right subreddit to be?", "Author": "u/Ok_Pin1735", "Content": "I tend to hoard \"knowledge findings\" from social media that I find valuable or want to implement to improve my life. Often, when I come across these findings. However, I never store them; I don't prioritize backups, I just dont care. I simply like or save findings within my respective accounts. But the inability to search through my scattered findings when I need them or to categorize them has been a frustrating pain point, especially since I only actively recall about 5% of what I save when I get the nudge to use something. Does anyone related?  Recently, I started organizing my findings using r/ObsidianMD , and it's been very helpful. I started with Youtube watch later playlists and I went from 1789 videos to 21."},
{"Title": "Building 2nd Array with existing DAS?", "Author": "u/braillegrenade", "Content": "I'll make this fast! I have: OWC 8-bay DAS RAID 5 via SoftRAID 8x 16TB drives in there now, about 70% full. Let's call this array \"Alpha\" Questions: Can shut it down, I pull those drives, put in 8 fresh ones and build a new array (\"Bravo\")? (pretty sure this is a yes) I presume swapping the array back to Alpha and starting up will just act like nothing happened ? What are the things to watch out for? Drives must go in the same drive slot? What might cause the array to not be recognized after removing and replacing? Thanks so much!"},
{"Title": "Helping a friend archive her deceased husbands digital life.", "Author": "u/SamTheManBrown", "Content": "I’m helping a friend who recently lost her husband, back up and consolidate all his data. He’s an editor so he had a lot of computers around the house but luckily he had work computers that I don’t have to worry about. She wants me to just buy a big drive and copy everything from each computer onto the drive. I’m pretty tech savvy but I know it’s going to be a little bit more complicated than that. I have 3 questions: Is there a good guide on the best way to about this as far as, using a drive… cloud… blu-ray. Is there a good step by step guide on how to do this? What brands do most people recommend?"},
{"Title": "(QNAP) Split external backup into individual parts?", "Author": "u/HugeFrog24", "Content": "Currently rocking a QNAP TVS-h874 with 2x WD Red Pro 24 TB mirrored as RAIDZ1. As I work on developing a robust backup strategy for my NAS, I wonder if QNAP offers a native solution that allows splitting backups across multiple external drives automatically, without manually dividing my directories into chunks of 4 TB each. The rationale is that a 24 TB backup cannot fit on a single 4 TB external HDD. This becomes even more apparent if I expand to a usable 144 TB in the future. In that case, it would be impossible to find a single 144 TB external drive, as such drives simply do not exist. So, is it possible to distribute backups across multiple external drives using QuTS hero 5? How exactly?"},
{"Title": "New Exos X14: HSMR or HM-SMR?", "Author": "u/SirLouen", "Content": "I've found this drive Exos X14 model ST10000NM0568 Here is the data sheet https://www.seagate.com/www-content/datasheets/pdfs/exos-x-14-channel-DS1974-5-1912GB-en_AU.pdf In the photo i can clearly read that HSMR But I can't seem to figure out which kind of disk are we talking about. It's H as in Hybrid or as in Host Managed? Not the same here, but is says that X14 used to be TDMR back in 2018 https://www.anandtech.com/show/12557/seagate-announces-exos-x14-a-heliumfilled-14-tb-pmr-hdd Looking at the past threads, it appears that many of these HDD end to be very fishy: https://www.reddit.com/r/DataHoarder/comments/tfm7w9/what_is_st18000nm013j_exos_x20z_hsmr_18tb_hdd/"},
{"Title": "Should I buy used and renewed drives? And if so where?", "Author": "u/Twofacedattic21", "Content": "I was looking to buy a 2.5 hard drive for my ps4 but I’m tight on budget. I often use renewed drives for my other consoles like my ps3 cause they’re usually a lot cheaper. I buy off the amazon renewed section, but I’ve heard it’s not reliable. My main question is, is the reduced price worth the risk of a faulty drive? Any help would be appreciated"},
{"Title": "URGENT! DROPPED HARD DRIVE", "Author": "u/Spiketop_", "Content": "I AM ONLY LOOKING FOR HELPFUL SOLUTIONS. PLEASE BE RESPECTFUL. THANK YOU. Earlier today I dropped my external hard. It fell about 2 feet. I did not have it in an enclosure. At the time, I didn't think anything of it and plugged it back in. I didn't realize until way later in the day it was not working as I was not on the computer for a while. It is not being recognized by any computer. I am willing to pay to get it fixed if it's possible. I had about  7TB of the 8TB storage used up so it's really important to me. If anyone can help me get this to work it would be extremely appreciated. I do not want to lost my files and if anyone can help get it fixed I will give them a small finders fee to help me if needed. Thank you"},
{"Title": "Would it make sense to transocde these video files?", "Author": "u/Over_Variation8700", "Content": "So I have around 150 of these 4K video files with a bit rate ranging from 40 to 70 megabits per seconds and each file being exactly 4GB. However, I don't really need them to have the highest quality possible as they're all screen recording files but I might need them in the future. Would it make any sense to transcode to better format and reduce file size? 13700KF CPU+4070Ti GPU"},
{"Title": "All of my data storage mediums, if you want I can update every Friday I get a new thing to put on the wall as a weekly thing", "Author": "u/LaundryMan2008", "Content": "No content"},
{"Title": "On my way, first pair of 12TB drives up and running", "Author": "u/09Klr650", "Content": "Purchased (2) 12TB drives from serverpartdeals.com.  Just one would hold everything I have in a motley collection of drives. Impressively they came WITH both a pin3 disabled power cable AND a card with a little kapton tape and instructions. As I am using a Sabrent 5-bay (eBay find, decent price for a non-raid external) I used the tape to disable the pin3 reset. Discovered I need to cut back on the caffeine as my hands were shaking WAAAY to much to make that easy. But it is up and running. Figure I will run these two as regular or raid 1, then once I order two more go raid 5. Now to spend some of the weekend using an external SATA dock to try to reclaim files from a stack of old bare drives, then my misc external drives. Suspect this will take a while. Now to research software raid programs . . ."},
{"Title": "Largest SSD is 1,000 TB in 3.5\" size, why not bring 5.25\" mechanical drive?", "Author": "u/Warcraft_Fan", "Content": "The largest hard drive is 30TB but if they would use 5.25\" drive then it'd be possible to get some hundred TB in a standard 5.25\" half height (same as CD and DVD drive) Computer cases are still produced with 5.25\" support as some people still need optical drive or possibly tape drive. So what's keeping them from putting out massive 5.25\" hard drives?"},
{"Title": "Are external hard-drives more prone to failure than internal hard-drives WHEN properly cared for and maintained? + Decision making for new backup storage upgrades advice wanted", "Author": "u/celexaprozac", "Content": "I have a 5TB external Seagate One Touch Rescue Edition that's just sat on top of my tower PC for as long as I've had it as my primary backup method, obviously insanely important materials are still in the cloud or spread across numerous flash drives. However, having only one backup copy of my shit is not a recipe for success. Having one is as good as having none as I like to say, redundancy is crucial when it comes to hoarding my data. Important pictures are backed up, the most important of which are printed out. My consideration here is whether or not I get a high capacity internal HDD @ 7200 RPM or if I buy a high capacity portable HDD that can take abuse and is less likely to be damaged by physical adjustments and movements. This is rarely a concern in my day to day but I live in an earthquake prone area and I would agonise over losing everything to some shaking dirt. I can't do both due to financial constraints at the moment but the decision is as follows; Do I get a second external USB HDD that will be slower and have inferior transfer rates BUT be more protected in event of disaster and any other events that may happen (dog with zoomies for instance.) or Do I get a more efficient and practical internal HDD (I imagine its also cheaper) that I suspect to be significantly more fragile and susceptible to sudden movements and will likely be lost in the aforementioned events. If the internal is selected, should I acquire this before the sale ends? If I should go with an external what should I acquire? I'd like something larger than my current 5TB. I haven't used more than 1.1TB on it but I'd rather kick the can of running out of space a few more years down the road."},
{"Title": "Honey, I Shrunk My Server", "Author": "u/sylinen", "Content": "No content"},
{"Title": "LSI 9207-8i setup", "Author": "u/Mooman5", "Content": "Hey everyone I’m currently trying to get the LSI 9207-8i to work in my home unraid server. I’m using it with 4 hba 4tb hdd’s, and I’m having a lot of trouble. The card is detected in my bios and in unraid. I’m using an asrock b560m-c motherboard. This is my first time trying to make any kind of server, so please have mercy on me. Any advice is greatly appreciated."},
{"Title": "Is microsd good enough as read only storage?", "Author": "u/PRINNTER", "Content": "I am in possesion of a samsung pro ultimate 256gb microsd, And it was unused, so I am in the process of downloading entire wikipedia in my native launguage (polish) with every picture/video and audio file included and hosting it online. My questions are: Is a microsd that stays plugged in and isn't unplugged/plugged back in good enough for a read only sceniario? (so the pins on the microsd aren't wearing out) Are there any implications, like \"after reading x gb from a microsd it will just stop working\"? Note: I am aware, that wikipedia has already many mirrors hosted online, but It's a learning experience for me (both on data hoarding and programming because I need to write code to host the copy of wikipedia online)."},
{"Title": "Best option for a \"go bag\" external?", "Author": "u/Vietname", "Content": "I have a couple of small synology NAS's, each has a dedicated drive for regular backups, but i wanted to get a small external drive (ideally SSD) to put my really important data on for emergencies, e.g. the house is on fire and i can only grab a few things. What would you recommend?"},
{"Title": "Feasibility/Performance of Mini-PC NAS with external HDD/SSD enclosure?", "Author": "u/RXrenesis8", "Content": "Howdy r/DataHoarder ! I am still a little baby hoarder with only about 15-20TB of data floating around my noisy 10 year old desktop-turned-HTPC. I was looking to expand to ~30TB (with room to grow of course) for a couple of initiatives and initially had been set on a rack and rackmount server or NAS chassis with a bunch of 3.5\" bays for price-efficient spinning drives. The cost though! Racks = $$$ Rackmount Chassis or pre-builts = $$$$! Every penny I would save in drive capacity I would pay back in getting a nice (home-office) rack and NAS. So I've come to you questioning a pivot point: What do you think about smaller solutions? Specifically I am thinking about a Mini-PC running unRAID connected to a JBOD enclosure for disks or large/cheap SSDs. What's the performance difference between a setup like the above and a low-end rackmount setup (which is at the limit of what I could realistically afford)? Any pitfalls I should be aware of? Thanks in advance!"},
{"Title": "dm-vdo block-Level deduplication and compression merged into Linux 6.9", "Author": "u/LeichenExpress", "Content": "No content"},
{"Title": "Is it possible to make mergerfs only log in the account that is going to be used?", "Author": "u/tamashika", "Content": "I need help to understand the policy of mergerfs to better fit my needs. I'm using a free cloud storage that does not let a user to have multiple free accounts. I think limiting the log in time would make my accounts less likely being detected, especially not logging in at the same time. I have checked that rclone union would have to log into all accounts when something is being transferred. I wonder if mergerfs also has to do the same. The reason I thought we don't have to log in to view the content is based on the idea from Virtual Volume View (VVV) , which catalogs the content of removable volumes like CD and DVD disks for off-line searching. Would like to know if mergerfs could do the same or similar thing. Thanks."},
{"Title": "I've got a decent sized physical media collection and unsure if it's worth saving lossless copies of it all", "Author": "u/TripleXero", "Content": "I've spent a stupid amount of time backing up all my DVDs and Blu-rays but I've already capped off an 11TB hard drive and split the extras between drives meant for other stuff and I'm still not done. I don't plan on getting rid of the original physical copies but it's much easier to access them digitally. I should also mention what I have backed up has been shrunk down already to decent looking MP4s to shove on iTunes for sleeker organization but I just don't know if it's worth keeping the original 1:1 files after. I shrunk the original files down once and realized after the fact that it wasn't in a flexible or presentable way for some so I'm hesitant to try again or wipe them completely after all the work. Is there maybe a good way to compress them? I've already went through and removed all non-English audio and subtitles"},
{"Title": "Should I use cold cloud storage for small backup (4TB)?", "Author": "u/CreativeDog2024", "Content": "I know about the 3-2-1 rule, but I've not been implementing it. I'm a college student with 3 years and 4 TB worth of movies/TV shows that have taken DAYS to download at times. I have 2 local backups, one on a segate 5tb and the other on a WD 5tb. I don't want to lose these files, I've used a plex add on to export posters and a list of my media but if I were to ever try and get them back from scratch, it would take a long time and I'm not sure I'd ever dedicated that much time. I know about aws deep glacier as a last resort and it being pretty high cost to recover, but I don't really plan to ever recover unless I both of my local backups. What should I know about? What would you do?"},
{"Title": "ServerPartDeals customer service", "Author": "u/demitrixrd", "Content": "I know many people on here already recommended SPD as a source for fair priced disks. I just wanted to add my $.02 after a recent experience with a failed drive I'd purchased a few months ago. A week ago I woke up to a TrueNas notification that a drive was faulted. I did some troubleshooting and wasn't able to recover any kind of connection to the drive. Plugging it in to a external adapter resulted in what sounded like a rock tumbler, so clearly it was beyond rescue. I started a RMA with SPD, and went back to work; expecting a few hours delay before hearing anything back. Later I realized I'd missed their almost immediate reply to the RMA request. I explained there was no way provide smart test results, and attached a video of my new rock tumbler. In short order the RMA# was provided. I shipped the faulted drive, and didn't think much of it. The drive was delivered yesterday and my replacement shipped this morning. Long story short, big kudos to ServerPartDeals for what is unprecedented customer service in the modern world; and to all the unsure shoppers, spend your money with SPD."},
{"Title": "Get WD Purple for DIY NAS in Raid? Located in India", "Author": "u/The_Bipolar_Guy", "Content": "Building my first DIY NAS. Need 2+2 tb to start off with. Trying to be as cheap as possible. Will be storing all memories and irreplaceable things. Will get an external HDD for offsite backup. Also, I do not care about read write speeds. I just want my data to be safe and backed up at the end of the day for as cheap as possible, I will add new data maybe once a month if not even more rarely. I will be using my old motherboard (6 SATA ports) and processor. Will get a new 500 GB ssd for OS and new RAM. Now here is the dilemma. I am from India and WD Purples are selling for 5250 INR each, cheapest. Next up, WD Blue is also selling for 6000+ INR. I can technically afford (but want to avoid at all costs) to get a 10TB UltraStar or EXOS for 22000 INR but I need two physical drives at least and my total storage need for backup right now or even 3 years later will not exceed 4-5TB. so a 10TB HDD will be useless, not to mention spending 45K INR on drives only (which is VERY VERY EXPENSIVE FOR ME). I know WD Purple glosses over write errors and can be bad. Chucking is equally expensive, if not more. Should I just get 2x 2tb WD Purple for 10.5K INR and set up my backup server for now. Will add more HDDs later as needed (1-4 years later). Can I do anything to prevent the write errors? Also, if there is a cheaper way, especially in the long run, I would appreciate it. Currently I have ~2TB data which grows by like 200-400GB a year. I have thought of BluRay drives but I am unable to procure new BluRay drives cheap enough."},
{"Title": "VIA RAID disks question", "Author": "u/thenovum", "Content": "Hey. Is it possible to extract the data from via raid disk members without using a VIA RAID controler? Disks are from 2004."},
{"Title": "Looking for help as a vlogging nomad. I film all content in 4k60p and visiting every country in the world. Guesstimating I'll need an additional ~24TB of storage for my remaining 100 countries. Budget: hopefully <$10k?", "Author": "u/immranderson", "Content": "Hey! I've been living exclusively out of my backpack + carryon luggage for the last decade and have been filming my travels as I go along. I've been traveling around the world and have amassed a large collection of 2/4TB Samsung T-Series SSDs which is beginning to bump up against the physical carrying capacity in my bags. Lucky enough I've got a 128GB Pixel 1 that I use still to this day for daily remote storage + backup, so that has served me well. However, I also like to have local backups, and have been trying to shop around for SSDs. I'm trying to keep things as compact as possible, and I'm traveling so have avoided going the HDD route since my stuff can get pretty rough and tumbled quite often. I try not to edit directly off my external drives, and I've got an 8TB M-class macbook pro that I've been lugging around with me around the world. I'm trying to figure out how to handle my long term storage needs for the next few years of travel. On average, I'm capturing 100GB - 400GB per week of travel. I'm figuring I've got another 100 countries left to visit around the world, so 100 weeks * ~200GB per country maybe lands me in the ~20TB range of storage I'm anticipating I'll need for the remainder of my travels? Does anyone have any suggestions here? Could I get away with getting 2 x 16TB SSDs with external enclosures and that 32TB worth of capacity would generously cover my needs with wiggle room? If so, what SSD + enclosure combo would you recommend?"},
{"Title": "Migrate from Unraid to OMV, SnapRAID, mergerfs. How to keep hard links, that span between two drives?", "Author": "u/ChrisWreck", "Content": "I'm in the middle of migrating from Unraid to OpenMediaVault, where I'll be using Snapraid and mergerfs. I have 3 disks, one parity and two data drives. They're using XFS in Unraid. I want to use ext4 in OMV. I have formatted the parity drive to ext4, and planned to move data from disk 1 to the parity drive, then format disk 1 to ext4, and then move all data from disk 2 to disk 1 and make disk 2 the new parity drive for SnapRAID. However, I just realized I have hard links from the arr suite, spanning over both data disks ... How can I migrate and preserve the hard links? Preferably without having to move all data to one disk in Unraid before migrating. EDIT: For those of you wondering why I'm switching, I'm actually switching from Unraid to Proxmox, but I'll use OMV to handle my disks (combination of ZFS and ext4) and shares."},
{"Title": "Question about Pixiv bulk downloading", "Author": "u/_izix", "Content": "Has anyone been blocked or banned from bulk downloading from pixiv? I've seen rumors that it may happen, but as far as I've been able to determine, there is no evidence of it actually happening. Is there maybe a hidden limit that's very high? I plan to download all images from users I follow with a script to update my archive with any new images every couple days. So far I have downloaded a few thousand images with no issues. Just figured I'd see if anyone has evidence of that happening before I continue. EDIT: I am using gallery-dl"},
{"Title": "Software for organizing manual backups over the last 10 years?", "Author": "u/PrivateAd990", "Content": "What software is available (paid or free) to help analyze my data on an external HD? it's only about a 1GB but 20+ backups (manually copied files over the years to this HD). MacOS or Linux. Wants: find data by extension (file type) find largest files identifying duplicates and handling it manually Accepting other tips of how to sift through data. I plan to organize all data to one folder rather than 20 backup folders."},
{"Title": "Seattle video store says it needs to raise $1.8M or face possible closure", "Author": "u/justreddit2024", "Content": "No content"},
{"Title": "Best free data integrity tools for validating.", "Author": "u/Captain_Starkiller", "Content": "Can anyone recommend some good tools for validating data integrity as a defense against bit rot?"},
{"Title": "What's the best way to transfer all my family's iCloud backups and device storages to an external media server?", "Author": "u/sav-tech", "Content": "Currently, the data is on an iMac Mid 2011, Google Photos and iCloud. We also have spare devices that we want to recycle. Before doing that, we want to save the data on there and store it externally. I am a tech-enthusiast by nature and think that this would be a good opportunity to setup a home lab. I understand it may take some effort, but I am thinking of having folders for each person in our family and their data goes into an encrypted folder to access remotely via Mobile, PC and Samsung Smart TV..."},
{"Title": "Trying To Digitize Old Cassette Tapes", "Author": "u/boosterbear", "Content": "Hello all! I have been hunting for the right location to ask my many, many questions. This may not be technical enough for this subreddit, but it seemed like the right place to go. I'm a big fan of physical media, likely casual to most here but to my friends I am perceived as intensely pro-physical media. As such, whenever people have spare tapes, CDs, DVDs, etc etc, I'm the man they throw them at. Unfortunately, I am horribly unfamiliar with the digitization process for everything except for CDs and DVDs, and even then I occasionally have hiccups. Recently I purchased the JVC RC-EZ38S CD Portable System (link to user manual) from a flea market to play some of my tapes and CDs, and realized I had a few tapes I'm unable to find anywhere online. Usually I wouldn't worry about my tapes growing old from wear because I can download songs and save them that way, but these tapes (mostly Halloween tracks) were impossible for me to find elsewhere, so I've been trying to preserve them. The JVC product I purchased plays CDs, cassette tapes, and the radio. It has one single 3.5mm jack, a headphone output. I have done some googling, and found my best bet to save the audio is through a combination of cables and Audacity. Unfortunately, my computer only recognizes my aux cord as headphones, and I cannot treat my JVC product as a microphone when using Audacity. I have two cables - one aux with two 3.5mm ends, and one cable that has a male 3.5mm on one end and the other end has two male parts, white and yellow RCA jacks. How, if at all, can I use my JVC player to preserve the tapes I have? Is there a special cord combination I may be able to put together that won't put me out of house and home (I'm unemployed and in a somewhat difficult spot financially, even a $20 purchase has me aghast sometimes) or would I be better off looking for a different product to record my tapes? A friend of mine is currently looking to rehome an old car radio with cassette player - Do those typically have RCA plugs, and would that be a way to go about this? Anything helps, even just correcting my terms so I can communicate what I'm looking for a little better - I'm in a space where I truly don't know what it is that I don't know. I'd love to be a part of saving some lost media, even if it seems a little silly. People put work into those Halloween tapes, dammit!"},
{"Title": "What are the best options for adding disks to my setup?", "Author": "u/StarLordOfTheDance", "Content": "Is it possible to transition my setup from mergeFs+Snapraid to zfs without a lot of spare storage that I don't have? I currently have 2x4TB mergeFs setup, with a 4TB drive for Snapraid parity. (Total 8TB usable storage). - currently holding 7TB of data I have purchased 2x4TB more drives. And ideally want to end up in a situation where I have 16TB of usable storage, with 1 parity. (12TB usable would be acceptable but not ideal). The mergeFs harddrives are connected to a Ubuntu server. And I am moving the whole lot to a new server running proxmox (that has a Ubuntu server running in VM). can anyone help me figure out if it's possible to migrate this to a ZFS pool that will do what I want. I also have looked at unRAID because it supports adding disks, but that is its own hypervisor. So are there alternative ways of working that can work inside a proxmox VM?"},
{"Title": "Backup software", "Author": "u/bhudzallmighty", "Content": "I currently have a dedicated optiplex running linux with nextcloud docker for my iphone data. I would like to expand this system to a DIY nas with a single 20tb hdd storage for backup . What is the best software to do so? I would like to be able to backup once a day. Can i back up the whole hdd? Or just folders? Thank you"},
{"Title": "I have question about ugreen enclosure", "Author": "u/Dismal_Award735", "Content": "No content"},
{"Title": "I need help identifying this hard drive, and where i can get the right cable.", "Author": "u/Chippomannen", "Content": "No content"},
{"Title": "Safest method to wipe out a drive without damaging it? I'm looking for paranoid-level shit.", "Author": "u/500xp1", "Content": "Looking for a method that makes it impossible to recover the wiped data."},
{"Title": "500,000 CDs", "Author": "u/Sliced_Apples", "Content": "Hello, I am working for a startup in the sports industry and we have recently come into the possession of about five hundred thousand cds with 20 year old sports footage. We are trying to train an AI model off of them so as such, they need to be digitized. I know a little about burning cds but not much. As I have been made aware, this would be “ripping” and not burning. What would be the best way to go about doing this? What storage solution would be the best? Any advice is greatly appreciated. I’m happy to answer any questions as well."},
{"Title": "Best at-home manual photo scanner?", "Author": "u/Small_Vermicelli9655", "Content": "Looking to digitize a bunch of old family photos and was hoping for specific scanner suggestions. There’s lots of conflicting information online and I’m not very proficient in this area so was hoping for some insight lol. I’ve heard automatic scanners can mark grooves on the photos and would feel more comfortable with a manual one as time is not a priority. Hoping to stay around a $500 price range and resell after use. Thank you in advance!!"},
{"Title": "Checking for Wiped SMART Data", "Author": "u/eakall", "Content": "So I recently got 35 2TB SSDs (mostly Samsung EVO 860/870) used and when checking the smart data for them I noticed very low power on hours.  The PoH (80-400hrs) is variable across the large set of drives and TBW is about 2-6TB for most of the drives. I was curious if there’s a way to check if the smart data has been reset? It seems a bit suspicious to me that these drives all are so low in PoH. Drives are also manufactured between 2020-2021 ish"},
{"Title": "CD ripping compression", "Author": "u/nlj1978", "Content": "So going through my old CDs, some of them are previously burned CDs in MP3 format. I have been ripping discs in FLAC format. If the ripping software is starting with an MP3 file and ripping to FLAC is that problematic? Compressing a compressed file sounds like a bad idea"},
{"Title": "Today I learned something about shucking", "Author": "u/auridas330", "Content": "I bought two WD elements drives, both are same size, manufacture date, drive number, but one needed me to play with the 3.3v pin to show up. Never knew that WD plays Russian roulette with their drives lol"},
{"Title": "Synology DS923+, DS1821+ & DS223j all on sale right now at B&H", "Author": "u/iddrinktothat", "Content": "** The sale has ended. ** Thought id let you guys know because i havent been seeing a lot of discounts on Synology."},
{"Title": "What is the best NVME SSD controller ?", "Author": "u/Yukinoooo", "Content": "I'm looking for an NVME SSD, 5 years warranty or more and a good controller but I don't know which NVME to choose because there are controllers : \"InnoGrit IG5236\", \"InnoGrit IG5666\", \"Phison E18\", \"Phison E26\" and \"SMI SM2264\""},
{"Title": "Longevity of Recordable CDs, DVDs and Blu-rays — Canadian Conservation Institute (CCI)", "Author": "u/didyousayboop", "Content": "Important information from the Canadian Conservation Institute, an agency of the federal government of Canada. Table 2: the relative stability of optical disc formats Optical disc formats Average longevity CD-R (phthalocyanine dye, gold metal layer) >100 years CD-R (phthalocyanine dye, silver alloy metal layer) 50 to 100 years DVD-R (gold metal layer) 50 to 100 years CD (read-only, such as an audio CD) 50 to 100 years CD-RW (erasable CD) 20 to 50 years BD-RE (erasable Blu-ray) 20 to 50 years DVD+R (silver alloy metal layer) 20 to 50 years CD-R (cyanine or azo dye, silver alloy metal layer) 20 to 50 years DVD+RW (erasable DVD) 20 to 50 years BD-R (non-dye, gold metal layer) 10 to 20 years DVD-R (silver alloy metal layer) 10 to 20 years DVD and BD (read-only, such as a DVD or Blu-ray movie) 10 to 20 years BD-R (dye or non-dye, single layer or dual layer) 5 to 10 years DVD-RW (erasable DVD) 5 to 10 years DVD+R DL (dual layer) 5 to 10 years"},
{"Title": "16x22TB disk MegaRAID data storage ZFS RaidZ2 or HW Raid 60", "Author": "u/Flat-One-7577", "Content": "Hi, I am going to build a 16 disk data storage. This will mainly be a \"backup\" to store data for some time and not need to recreate it again. Recreation would be expensive. I have few very big files and a lot of small one. Main focus is having a lot of storage. I/O is not so important. Having 16x 22TB disks attached to a MegaRAID 9500 Controller I am asking myself what would be the prefered setup? Variant A: HW Raid60 on top ZFS Variant B: JBOD Mode on Controller for songle Disks ZFS -- create 2 RaidZ2 vdevs (6+2) and stripe them Variant C: JBOD Mode on Controller for songle Disks ZFS -- create one RaidZ3 vdev What would you do? Regards, Joachim"},
{"Title": "Looking for some specific storage design help", "Author": "u/Real_Bad_Horse", "Content": "Hey y'all, I don't know that this is the best place for my question, but I suspect that folks around here will either have advice or know where to point me if I'm better served asking this somewhere else. I built out my homelab to learn and get a job in IT. Mission success there. I've since gotten into all kinds of stuff and have a need to rework my storage, but I'm not sure how best to set things up. Here's what I'm looking to do: Complete separation of storage and compute Compute consists of a handful of VMs running on Proxmox, and critically, a Kubernetes cluster The cluster is currently running in VMs but I have plans to move just about everything into the cluster and move into SFF PCs This is partially why the complete separation is important, for flexibility and future migration Here's what I have currently for equipment: Brocade switch with 48x 1gbe and 8x10gig sfp 2x 12 bay 3.5\" servers, one with Proxmox, one with TrueNAS 1x 24 bay 2.5\" server Repurposed NetApp 24x 3.5\" chassis, modified to work as DAS 4x 16gb spinners, currently in raidz1 ~32 old 2, 3, and 4gb spinners I found that K8s cluster was very unstable with my first setup, which was an iscsi target on the TrueNAS server. The iSCSI share was mounted in Proxmox with LVM to create K8s VM OS and NFS storage for containers. This got much better when I moved to a local 3x SSD zpool on the Proxmox host. I understand that the latency with spinners and over the network was likely the cause, but this doesn't allow for the separation if like. Use here is all over - media server is the main thing currently, which for transcoding needs fast seq read/writes, K8s app dev for work, and all kinds of testing containers for work and home. I'd also like to put all VM storage remote as well to play around with some different compute setups. I'd really love to be able to fully wipe Proxmox and try out XCP-ng, or Azure HCI, stuff like that... It's a lab, after all. I'm competent enough to implement a solution, but I guess not enough experience yet to design. I'm not afraid of complex setup, but I do need redundancy, particularly if putting these small drives to use as I don't trust them - came for free with the NetApp shelf. So... Any suggestions on how to set this up for minimal latency and fast read/write? Ceph? Mirrored ZFS using all those small spinners? Dedicated ZFS pools for each K8s node? Caching layers? Not against additional equipment, within reason, if needed."},
{"Title": "Gallery-dl instagram help", "Author": "u/Graestra", "Content": "I'm trying to scrape an instagram account however gallery-dl isn't downloading all posts from the account. I've tried looking into config settings, but I keep getting errors about double quotes when trying to use a config file, and I'm not sure what the right setting to get it to download all posts is in the first place. Any help would be appreciated."},
{"Title": "No M2TS Files on Blu-ray?", "Author": "u/Carsonsgaming", "Content": "As the title says. I'm not finding one anywhere. These are in a folder called AACS, then there's another folder with a bdmv file but that's it. I'm a complete noob to Blu-ray ripping so I'm hoping I'm just missing something. Only interested in ripping the audio."},
{"Title": "13.5 Volt", "Author": "u/Rayuzan_Mojavec", "Content": "I just got a 3.5 inch HDD. It needed 12 volts external power, but I only have 13.5 power adapter. Is it safe?"},
{"Title": "ST12000NTZ01 vs ST12000NTA01", "Author": "u/-Rhialto-", "Content": "The Z is sold by Amazon and the A by Best Buy, could it be just that? Same disk but different number depending on reseller?"},
{"Title": "Need to expand storage. Out of SATA but have PCI-E slot.", "Author": "u/DevanteWeary", "Content": "Hey guys. Using mITX motherboard and out of my four SATA ports, and need four more ports to connect four more drives. My PCIe slot is free and both m.2 slots are taken. What's the best way to get more free SATA ports? It's for my low power streaming server/NAS that is running Unraid. Thank you for any advice!"},
{"Title": "Will adding a new fan to a DAS result in the fan spinning at 100%?", "Author": "u/Apptryiguess", "Content": "I have a DAS and am pretty happy with the temps, but they could be slightly better since the DAS is in a closet and doesn't get that much airflow. My enterprise drives idle at 43-45 C which is ok, but could be a little better. So i thought about adding a new and better fan to the enclosure (Icy Box IB-3805-C31), but the fan never changes speeds, literally never. I don't let my drives spin down but if they were to, the fan does stop spinning after a while, afaik that's the only control the DAS has over the fan. So if i were to add a 2000rpm fan, would it instantly shoot up to that rpm and always spin that fast? Is there a way to control fan speed? I can't see the DAS's fan on any program controlling fan speed so that's something... Any idea on how it would behave? Any idea if there is a way to controll the fan speed? Thanks."},
{"Title": "Help downloading xvideo profiles/playlists", "Author": "u/Thehobbyist916", "Content": "YT-DLP is only able to download one link at a time Anyone have any suggestions or advice? Also, I’d like to be able to download YouTube RED content Thanks"},
{"Title": "WD Red Plus 8TB vs WD Black 8TB vs IronWolf 8TB?", "Author": "u/GearFourth", "Content": "I ordered a WD Black 8TB, but now the Red Plus is on sale for $34 cheaper, do you guys believe the Black is worth $34 more? The biggest difference that I know of is Black has a longer warranty 5 vs 3. Are there any other differences? I would be using them for media storage."},
{"Title": "Software for splitting video files in bulk?", "Author": "u/Comfortable_Ad_6823", "Content": "I am currently ripping my SpongeBob DVDs. For anyone unaware, (almost) all SpongeBob episodes are split into A and B parts. For example, \"Pizza Delivery\" is only episode 5a, with \"Home Sweet Pineapple\" being episode 5b. Two \"segments\" make up one episode. Normally this isn't a problem, as each segment in the SpongeBob DVDs has its own .mkv file. That is, until season 9, where there are no .mkv files for individual segments, only the combined episode. This is rather annoying as I don't want to scrub to the half-way mark of the videos just to watch the episode I actually want to see. I've thought of splitting the files in half, but it would be a tedious process as seasons are quite long. Are there any programs or tools that would make this easier?"},
{"Title": "Seeking Advice on Cost-Effective Backup Solutions for Multiple Hard Drives (beginner) - Thoughts on Bvckup 2?", "Author": "u/AlvTellez", "Content": "I have several larger hard drives: 5TB portable drive connected to my HTPC for films and series via Plex Two unused 8TB drives 4TB drive containing important media (that doesn't fit in my laptop and/or is more important) Initially, I considered getting a Synology NAS, but with less than 10TB of actual data, it seems like overkill, especially since I rarely access this data and usually keep the drives unplugged, except for the 5TB drive that's always connected to my HTPC (I also don't really need a NAS for my Plex needs, since I already have the HTPC as a server for that). After reading some posts, I thought about purchasing a license for Bvckup 2, which is more cost-effective and would allow me to use my other drives for backup. My plan is to transfer data from the 5TB drive to one of the 8TB drives and periodically back up the data to the other 8TB drive. If I run out of space, I could use the 4TB drive similarly and back up data to the other 5TB drive. While this might sound inefficient to experienced data hoarders, how bad/good is this idea? Are there any other software options that could simplify this process, compared to manually copying and pasting data between drives?"},
{"Title": "chkbit: Check that your files were not corrupted", "Author": "u/laktakk", "Content": "No content"},
{"Title": "Organizing drives vs drive sizes vs raids/ZFS/stuff", "Author": "u/PuzzleHeadPistion", "Content": "Hey, I've got two NAS and a bunch of drives. One EXOS 16Tb, two Barracuda 8Tb, one IronWolf 6Tb, on WD \"white\" 6Tb and on WD Red 3Tb. My main NAS is a desktop with +6 slots, my second NAS is a 4 bay Asustor. Currently I don't use raid/parity of any kind... All drives are single volumes and it just sync's each drive from my main NAS to the second NAS, so I try to make the drive setup equal. However, the recent addition of the EXOS 16Tb kills that. Since my main NAS is changing to a FreeBSD/TrueNAS with a ZFS pool, what's the best setup? I was thinking maybe 8Tb+8Tb+6Tb+6Tb in the ZFS pool, then 16Tb+3Tb as single volumes on my second NAS. This way drives in the pool are as similar as possible in size and if parity wastes one drive, it will be about the same total capacity as the second NAS. Does this make sense?"},
{"Title": "Using CRC or the like for music backup checking", "Author": "u/__99999", "Content": "Hello, I know about the various ways to get a crc and sha etc. I'm trying to find a program that keeps the same crc if I change the Metadata of the audio file. Does anyone know of one? It can be Linux or win or even a script. Basically I'm backing up and archiving my music like most of you. The issue I'm running into is I update my Metadata on my audio randomly. As I have over 10tbs (I know rookie numbers) I can't sit down and bang it out in 1 sitting so I do it in waves. tldr? I'm looking for a program that doesn't alter crc if I change the Metadata of my audio file (mp3 or flac etc)"},
{"Title": "How can I view all DMs in Twitter Archive Data? Not all DMs history shows up.", "Author": "u/niceiambearlythere", "Content": "Hello, I've downloaded my Twitter Archive Data, but not all of the DMs could be seen. It only shows a certain part of the chat, usually the earlier conversations. Is there any way to solve this, so that I can look back on all of the messages again?"},
{"Title": "Youtube server side add injection role out | Where is it already?", "Author": "u/Pommes254", "Content": "I am running ytdlp to archive a large amount of channels and i am kinda worried to contaminate my archive data with add injected versions. The thing is so far i havent seen a single one with it in about 500 videos, i just finished downloading via proxies in germany, uk and japan (downloaded videos that are about 1-2 weeks old that i already have and compared length via script) How many users really get videos served with direct injected adds currently? And in what regions? I hope a feature gets merged into ytdlp that checks video lengths and alerts if it detects more than +/- 1 sec compared to a known DB like sponsorblock."},
{"Title": "How to Download a video from a private vimeo server?", "Author": "u/diradi", "Content": "I subscribed to an online course service, and the provider uploads the class recordings to the platform through a private Vimeo server. I can watch the classes, but it's practically impossible to download them using traditional methods. I was able to download some videos on the platform using IDM (Internet Download Manager), but lately, whenever I try to download a video, a message appears saying \"Unknown error, please try again.\" Can someone help me with a solution? Either a method to download private Vimeo videos or a way to fix the IDM error. Thank you."},
{"Title": "alternative to Cathy or Virtual Volumes view that can do Boolean Search", "Author": "u/another_lease", "Content": "I need to do Boolean search on my unconnected disks. E.g., I need to search for files that contain the word \"confidence\" and \"interval\". If I enter `confidence interval` in the search bar, Cathy will only find files that contain the phrase \"confidence interval\" in their file name. Virtual Volumes View will find me files that contain both words anywhere in the file name, but it will also return files that contain either word in their filename. I know that Cathy and VVV have come up before on this subreddit. I was wondering if anyone's figured out some portable freeware that can do Boolean search. Thanks in advance."},
{"Title": "Need Help archiving important Norwegian Stenography", "Author": "u/VanillaKirby", "Content": "Hello, I need some assistance with archiving a book containing some of the only documentation of one of the only shorthand systems in the Norwegian Language, Wang-Krogdahl. The book is scanned and located in the Norwegian Public Library available here https://www.nb.no/items/URN:NBN:no-nb_digibok_2016011905022 You will need a Norwegian VPN to access the book, (i am using tunnelbear with a free license) I do not know of a way to extract these scans of the book from the website, help appreciated."},
{"Title": "Looking for a software to recognize multiple TB of images", "Author": "u/EasyMoney322", "Content": "Hello, I'm looking for a self-hosted software (that also wouldn't upload photos anywhere) that could do image recognition on the fileshare with an acceptable success rate. I was able to find posts on this sub about nsfw bodyparts recognition, but its not what Im looking for. What level of recognition? It must be able to tell appart photos of mass events, people, pets, documents, roads, buildings etc. Having them organized by a location metadata, perhaps. Finding similar (almost duplicate, but with different hash) images. Would be great if I could select all the tagged images after, re-check them for false-positives, and delete. The fileshare is hosted on OpenSuse VM, but I also can deploy and mount it on any other OS on the same server. I have a lot of processing power, but I'd like to avoid training the AI by myself."},
{"Title": "Easier to get a NAS or just buy another desktop with lots of storage?", "Author": "u/El_Chupachichis", "Content": "I keep contemplating getting more storage, possibly a NAS.  But I'm not doing actual streaming, just collecting an ever larger amount of images, RAW and jpg (I'm an event photographer hobbyist). I would look at the NAS online and see perhaps a cheap 4 bay NAS, then look at the reviews and see a lot of complaints.  Seems like getting a reasonably reliable NAS would be more like getting a high end desktop. For those digital hoarders who don't have a lot of streamable data, do you prefer NAS or just a big desktop with a lot of drive slots, and maybe a software RAID?  I tend to be a cheapskate so historically it's always been \"buy another drive that's larger and copy stuff over\" but I really need to start thinking long term."},
{"Title": "Will youtube ad Injections break music downloads?", "Author": "u/Nerds_r_us45", "Content": "I like downloading some channels in bulk and idk if this will break my ability to hoard music easily or not."},
{"Title": "MEGATHREAD: Archiving the Capitol Hill Riots", "Author": "u/AdamLynch", "Content": "FINAL UPDATE as of January 31st 5:35PM EST: Thank you to everyone who shared content. The content being submitted now from what I'm seeing is duplicates of older content. I will thus no longer be updating this archive. The MEGA will remain untouched, so use that as you please, but that will likely die one day as there is a bandwidth/transfer limit. I will be uploading the content to Internet Archive, as well as other sources, but until then the torrent magnet that I will be seeding for a little while is listed below - my bandwidth isn't the best so please do seed if you can: Magnet: magnet:?xt=urn:btih:c8fc9979cc35f7062cd8715aaaff4da475d2fadc&dn=Trump%20protest%20Jan%2006%202021&tr=udp%3a%2f%2ftracker.torrent.eu.org%3a451%2fannounce&tr=udp%3a%2f%2fpublic.popcorn-tracker.org%3a6969%2fannounce&tr=http%3a%2f%2f104.28.1.30%3a8080%2fannounce&tr=http%3a%2f%2f104.28.16.69%2fannounce&tr=http%3a%2f%2f107.150.14.110%3a6969%2fannounce&tr=http%3a%2f%2f109.121.134.121%3a1337%2fannounce&tr=http%3a%2f%2f114.55.113.60%3a6969%2fannounce&tr=http%3a%2f%2f125.227.35.196%3a6969%2fannounce&tr=http%3a%2f%2f128.199.70.66%3a5944%2fannounce&tr=http%3a%2f%2f157.7.202.64%3a8080%2fannounce&tr=http%3a%2f%2f158.69.146.212%3a7777%2fannounce&tr=http%3a%2f%2f173.254.204.71%3a1096%2fannounce&tr=http%3a%2f%2f178.175.143.27%2fannounce&tr=http%3a%2f%2f178.33.73.26%3a2710%2fannounce&tr=http%3a%2f%2f182.176.139.129%3a6969%2fannounce&tr=http%3a%2f%2f185.5.97.139%3a8089%2fannounce&tr=http%3a%2f%2f188.165.253.109%3a1337%2fannounce&tr=http%3a%2f%2f194.106.216.222%2fannounce&tr=http%3a%2f%2f195.123.209.37%3a1337%2fannounce&tr=http%3a%2f%2f210.244.71.25%3a6969%2fannounce&tr=http%3a%2f%2f210.244.71.26%3a6969%2fannounce&tr=http%3a%2f%2f213.159.215.198%3a6970%2fannounce&tr=http%3a%2f%2f213.163.67.56%3a1337%2fannounce&tr=http%3a%2f%2f37.19.5.139%3a6969%2fannounce&tr=http%3a%2f%2f37.19.5.155%3a6881%2fannounce&tr=http%3a%2f%2f46.4.109.148%3a6969%2fannounce&tr=http%3a%2f%2f5.79.249.77%3a6969%2fannounce&tr=http%3a%2f%2f5.79.83.193%3a2710%2fannounce&tr=http%3a%2f%2f51.254.244.161%3a6969%2fannounce&tr=http%3a%2f%2f59.36.96.77%3a6969%2fannounce&tr=http%3a%2f%2f74.82.52.209%3a6969%2fannounce&tr=http%3a%2f%2f80.246.243.18%3a6969%2fannounce&tr=http%3a%2f%2f81.200.2.231%2fannounce&tr=http%3a%2f%2f85.17.19.180%2fannounce&tr=http%3a%2f%2f87.248.186.252%3a8080%2fannounce&tr=http%3a%2f%2f87.253.152.137%2fannounce&tr=http%3a%2f%2f91.216.110.47%2fannounce&tr=http%3a%2f%2f91.217.91.21%3a3218%2fannounce&tr=http%3a%2f%2f91.218.230.81%3a6969%2fannounce&tr=http%3a%2f%2f93.92.64.5%2fannounce&tr=http%3a%2f%2fatrack.pow7.com%2fannounce&tr=http%3a%2f%2fbt.henbt.com%3a2710%2fannounce&tr=http%3a%2f%2fbt.pusacg.org%3a8080%2fannounce&tr=http%3a%2f%2fbt2.careland.com.cn%3a6969%2fannounce&tr=http%3a%2f%2fexplodie.org%3a6969%2fannounce&tr=http%3a%2f%2fmgtracker.org%3a2710%2fannounce&tr=http%3a%2f%2fmgtracker.org%3a6969%2fannounce&tr=http%3a%2f%2fopen.acgtracker.com%3a1096%2fannounce&tr=http%3a%2f%2fopen.lolicon.eu%3a7777%2fannounce&tr=http%3a%2f%2fopen.touki.ru%2fannounce.php&tr=http%3a%2f%2fp4p.arenabg.ch%3a1337%2fannounce&tr=http%3a%2f%2fp4p.arenabg.com%3a1337%2fannounce&tr=http%3a%2f%2fpow7.com%3a80%2fannounce&tr=http%3a%2f%2fretracker.gorcomnet.ru%2fannounce&tr=http%3a%2f%2fretracker.krs-ix.ru%2fannounce&tr=http%3a%2f%2fretracker.krs-ix.ru%3a80%2fannounce&tr=http%3a%2f%2fsecure.pow7.com%2fannounce&tr=http%3a%2f%2ft1.pow7.com%2fannounce&tr=http%3a%2f%2ft2.pow7.com%2fannounce&tr=http%3a%2f%2fthetracker.org%3a80%2fannounce&tr=http%3a%2f%2ftorrent.gresille.org%2fannounce&tr=http%3a%2f%2ftorrentsmd.com%3a8080%2fannounce&tr=http%3a%2f%2ftracker.aletorrenty.pl%3a2710%2fannounce&tr=http%3a%2f%2ftracker.baravik.org%3a6970%2fannounce&tr=http%3a%2f%2ftracker.bittor.pw%3a1337%2fannounce&tr=http%3a%2f%2ftracker.bittorrent.am%2fannounce&tr=http%3a%2f%2ftracker.calculate.ru%3a6969%2fannounce&tr=http%3a%2f%2ftracker.dler.org%3a6969%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.com%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.com%3a80%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.nl%2fannounce&tr=http%3a%2f%2ftracker.dutchtracking.nl%3a80%2fannounce&tr=http%3a%2f%2ftracker.edoardocolombo.eu%3a6969%2fannounce&tr=http%3a%2f%2ftracker.ex.ua%2fannounce&tr=http%3a%2f%2ftracker.ex.ua%3a80%2fannounce&tr=http%3a%2f%2ftracker.filetracker.pl%3a8089%2fannounce&tr=http%3a%2f%2ftracker.flashtorrents.org%3a6969%2fannounce&tr=http%3a%2f%2ftracker.grepler.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker.internetwarriors.net%3a1337%2fannounce&tr=http%3a%2f%2ftracker.kicks-ass.net%2fannounce&tr=http%3a%2f%2ftracker.kicks-ass.net%3a80%2fannounce&tr=http%3a%2f%2ftracker.kuroy.me%3a5944%2fannounce&tr=http%3a%2f%2ftracker.mg64.net%3a6881%2fannounce&tr=http%3a%2f%2ftracker.opentrackr.org%3a1337%2fannounce&tr=http%3a%2f%2ftracker.skyts.net%3a6969%2fannounce&tr=http%3a%2f%2ftracker.tfile.me%2fannounce&tr=http%3a%2f%2ftracker.tiny-vps.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker.tvunderground.org.ru%3a3218%2fannounce&tr=http%3a%2f%2ftracker.yoshi210.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker1.wasabii.com.tw%3a6969%2fannounce&tr=http%3a%2f%2ftracker2.itzmx.com%3a6961%2fannounce&tr=http%3a%2f%2ftracker2.wasabii.com.tw%3a6969%2fannounce&tr=http%3a%2f%2fwww.wareztorrent.com%2fannounce&tr=http%3a%2f%2fwww.wareztorrent.com%3a80%2fannounce&tr=https%3a%2f%2f104.28.17.69%2fannounce&tr=https%3a%2f%2fwww.wareztorrent.com%2fannounce&tr=udp%3a%2f%2f107.150.14.110%3a6969%2fannounce&tr=udp%3a%2f%2f109.121.134.121%3a1337%2fannounce&tr=udp%3a%2f%2f114.55.113.60%3a6969%2fannounce&tr=udp%3a%2f%2f128.199.70.66%3a5944%2fannounce&tr=udp%3a%2f%2f151.80.120.114%3a2710%2fannounce&tr=udp%3a%2f%2f168.235.67.63%3a6969%2fannounce&tr=udp%3a%2f%2f178.33.73.26%3a2710%2fannounce&tr=udp%3a%2f%2f182.176.139.129%3a6969%2fannounce&tr=udp%3a%2f%2f185.5.97.139%3a8089%2fannounce&tr=udp%3a%2f%2f185.86.149.205%3a1337%2fannounce&tr=udp%3a%2f%2f188.165.253.109%3a1337%2fannounce&tr=udp%3a%2f%2f191.101.229.236%3a1337%2fannounce&tr=udp%3a%2f%2f194.106.216.222%3a80%2fannounce&tr=udp%3a%2f%2f195.123.209.37%3a1337%2fannounce&tr=udp%3a%2f%2f195.123.209.40%3a80%2fannounce&tr=udp%3a%2f%2f208.67.16.113%3a8000%2fannounce&tr=udp%3a%2f%2f213.163.67.56%3a1337%2fannounce&tr=udp%3a%2f%2f37.19.5.155%3a2710%2fannounce&tr=udp%3a%2f%2f46.4.109.148%3a6969%2fannounce&tr=udp%3a%2f%2f5.79.249.77%3a6969%2fannounce&tr=udp%3a%2f%2f5.79.83.193%3a6969%2fannounce&tr=udp%3a%2f%2f51.254.244.161%3a6969%2fannounce&tr=udp%3a%2f%2f62.138.0.158%3a6969%2fannounce&tr=udp%3a%2f%2f62.212.85.66%3a2710%2fannounce&tr=udp%3a%2f%2f74.82.52.209%3a6969%2fannounce&tr=udp%3a%2f%2f85.17.19.180%3a80%2fannounce&tr=udp%3a%2f%2f89.234.156.205%3a80%2fannounce&tr=udp%3a%2f%2f9.rarbg.com%3a2710%2fannounce&tr=udp%3a%2f%2f9.rarbg.me%3a2780%2fannounce&tr=udp%3a%2f%2f9.rarbg.to%3a2730%2fannounce&tr=udp%3a%2f%2f91.218.230.81%3a6969%2fannounce&tr=udp%3a%2f%2f94.23.183.33%3a6969%2fannounce&tr=udp%3a%2f%2fbt.xxx-tracker.com%3a2710%2fannounce&tr=udp%3a%2f%2feddie4.nl%3a6969%2fannounce&tr=udp%3a%2f%2fexplodie.org%3a6969%2fannounce&tr=udp%3a%2f%2fmgtracker.org%3a2710%2fannounce&tr=udp%3a%2f%2fp4p.arenabg.com%3a1337%2fannounce&tr=udp%3a%2f%2fshadowshq.eddie4.nl%3a6969%2fannounce&tr=udp%3a%2f%2fshadowshq.yi.org%3a6969%2fannounce&tr=udp%3a%2f%2ftorrent.gresille.org%3a80%2fannounce&tr=udp%3a%2f%2ftracker.aletorrenty.pl%3a2710%2fannounce&tr=udp%3a%2f%2ftracker.bittor.pw%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.coppersurfer.tk%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.eddie4.nl%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.ex.ua%3a80%2fannounce&tr=udp%3a%2f%2ftracker.filetracker.pl%3a8089%2fannounce&tr=udp%3a%2f%2ftracker.flashtorrents.org%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.grepler.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.ilibr.org%3a80%2fannounce&tr=udp%3a%2f%2ftracker.internetwarriors.net%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.kicks-ass.net%3a80%2fannounce&tr=udp%3a%2f%2ftracker.kuroy.me%3a5944%2fannounce&tr=udp%3a%2f%2ftracker.leechers-paradise.org%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.mg64.net%3a2710%2fannounce&tr=udp%3a%2f%2ftracker.mg64.net%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.opentrackr.org%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.piratepublic.com%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.sktorrent.net%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.skyts.net%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.yoshi210.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker2.indowebster.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker4.piratux.com%3a6969%2fannounce&tr=udp%3a%2f%2fzer0day.ch%3a1337%2fannounce&tr=udp%3a%2f%2fzer0day.to%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.cyberia.is%3a6969%2fannounce&tr=http%3a%2f%2fvps02.net.orel.ru%3a80%2fannounce&tr=https%3a%2f%2ftracker.nanoha.org%3a443%2fannounce&tr=http%3a%2f%2ftracker.files.fm%3a6969%2fannounce&tr=https%3a%2f%2ftracker.nitrix.me%3a443%2fannounce&tr=https%3a%2f%2ftracker.tamersunion.org%3a443%2fannounce&tr=udp%3a%2f%2faaa.army%3a8866%2fannounce&tr=https%3a%2f%2ftracker.imgoingto.icu%3a443%2fannounce&tr=udp%3a%2f%2fblokas.io%3a6969%2fannounce&tr=udp%3a%2f%2fdiscord.heihachi.pw%3a6969%2fannounce&tr=udp%3a%2f%2ffe.dealclub.de%3a6969%2fannounce&tr=udp%3a%2f%2fln.mtahost.co%3a6969%2fannounce&tr=udp%3a%2f%2fvibe.community%3a6969%2fannounce&tr=udp%3a%2f%2ftracker0.ufibox.com%3a6969%2fannounce&tr=udp%3a%2f%2fmail.realliferpg.de%3a6969%2fannounce&tr=udp%3a%2f%2fmovies.zsw.ca%3a6969%2fannounce&tr=udp%3a%2f%2fnagios.tks.sumy.ua%3a80%2fannounce&tr=udp%3a%2f%2f47.ip-51-68-199.eu%3a6969%2fannounce&tr=udp%3a%2f%2fcdn-1.gamecoast.org%3a6969%2fannounce&tr=udp%3a%2f%2faruacfilmes.com.br%3a6969%2fannounce&tr=udp%3a%2f%2fedu.uifr.ru%3a6969%2fannounce&tr=http%3a%2f%2frt.tace.ru%3a80%2fannounce&tr=udp%3a%2f%2fcode2chicken.nl%3a6969%2fannounce&tr=udp%3a%2f%2fus-tracker.publictracker.xyz%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.0x.tf%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.altrosky.nl%3a6969%2fannounce&tr=udp%3a%2f%2ftorrentclub.online%3a54123%2fannounce&tr=http%3a%2f%2f5rt.tace.ru%3a60889%2fannounce&tr=udp%3a%2f%2fapp.icon256.com%3a8000%2fannounce&tr=udp%3a%2f%2ftracker.sigterm.xyz%3a6969%2fannounce&tr=http%3a%2f%2ftracker.loadbt.com%3a6969%2fannounce&tr=http%3a%2f%2fipv4announce.sktorrent.eu%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.openbittorrent.com%3a80%2fannounce&tr=udp%3a%2f%2fwww.torrent.eu.org%3a451%2fannounce&tr=udp%3a%2f%2ftracker.dler.org%3a6969%2fannounce&tr=udp%3a%2f%2fexodus.desync.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker2.dler.org%3a80%2fannounce&tr=udp%3a%2f%2ftracker.shkinev.me%3a6969%2fannounce&tr=udp%3a%2f%2fstorage.groupees.com%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.v6speed.org%3a6969%2fannounce&tr=udp%3a%2f%2fdaveking.com%3a6969%2fannounce&tr=https%3a%2f%2ftracker.lilithraws.cf%3a443%2fannounce&tr=udp%3a%2f%2ftracker1.bt.moack.co.kr%3a80%2fannounce&tr=udp%3a%2f%2f3rt.tace.ru%3a60889%2fannounce&tr=udp%3a%2f%2fjohnrosen1.com%3a6969%2fannounce&tr=udp%3a%2f%2fretracker.lanta-net.ru%3a2710%2fannounce&tr=udp%3a%2f%2fopentor.org%3a2710%2fannounce&tr=udp%3a%2f%2ft2.leech.ie%3a1337%2fannounce&tr=https%3a%2f%2ftracker.foreverpirates.co%3a443%2fannounce&tr=http%3a%2f%2ftracker.vraphim.com%3a6969%2fannounce&tr=udp%3a%2f%2fopen.stealth.si%3a80%2fannounce&tr=udp%3a%2f%2ftracker.uw0.xyz%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.army%3a6969%2fannounce&tr=udp%3a%2f%2fmts.tvbit.co%3a6969%2fannounce&tr=https%3a%2f%2ftracker.coalition.space%3a443%2fannounce&tr=http%3a%2f%2ftracker-cdn.moeking.me%3a2095%2fannounce&tr=udp%3a%2f%2fline-net.ru%3a6969%2fannounce&tr=udp%3a%2f%2fperu.subventas.com%3a53%2fannounce&tr=udp%3a%2f%2fbt1.archive.org%3a6969%2fannounce&tr=udp%3a%2f%2fengplus.ru%3a6969%2fannounce&tr=udp%3a%2f%2fvalakas.rollo.dnsabr.com%3a2710%2fannounce&tr=udp%3a%2f%2fbt2.archive.org%3a6969%2fannounce&tr=udp%3a%2f%2fipv4.tracker.harry.lu%3a80%2fannounce&tr=udp%3a%2f%2ft1.leech.ie%3a1337%2fannounce&tr=http%3a%2f%2fbt.okmp3.ru%3a2710%2fannounce&tr=http%3a%2f%2fcloud.nyap2p.com%3a8080%2fannounce&tr=http%3a%2f%2ft.overflow.biz%3a6969%2fannounce&tr=udp%3a%2f%2ft3.leech.ie%3a1337%2fannounce&tr=udp%3a%2f%2ftracker.tiny-vps.com%3a6969%2fannounce&tr=http%3a%2f%2ftracker.bt4g.com%3a2095%2fannounce&tr=http%3a%2f%2ft.nyaatracker.com%3a80%2fannounce&tr=udp%3a%2f%2fudp-tracker.shittyurl.org%3a6969%2fannounce&tr=https%3a%2f%2f1337.abcvg.info%3a443%2fannounce&tr=https%3a%2f%2fw.wwwww.wtf%3a443%2fannounce&tr=udp%3a%2f%2fbt2.3kb.xyz%3a6969%2fannounce&tr=udp%3a%2f%2ftracker.ds.is%3a6969%2fannounce&tr=udp%3a%2f%2fopentracker.i2p.rocks%3a6969%2fannounce&tr=udp%3a%2f%2fcdn-2.gamecoast.org%3a6969%2fannounce&tr=udp%3a%2f%2fretracker.netbynet.ru%3a2710%2fannounce&tr=udp%3a%2f%2fteamspeak.value-wolf.org%3a6969%2fannounce&tr=udp%3a%2f%2fcutiegirl.ru%3a6969%2fannounce&tr=http%3a%2f%2fh4.trakx.nibba.trade%3a80%2fannounce Hash (for verification of authenticity etc): c8fc9979cc35f7062cd8715aaaff4da475d2fadc Size: 1,013.12GiB Original post below Archiving videos before potential removal from various websites... Send or comment links of videos you need downloaded. Currently going through POV livestreams/replays. NOTE: livestreams/POV are of the utmost importance. AKA Twitch/dlive/Facebook Live, etc. If you find any of these POV angles, please tag me directly in your comment, or PM me. These generally get taken down VERY fast by the livestream website. UPDATE: Thank you to everyone who shared links (and continue to do so). I am noticing that a lot of the content is now duplicates, or variations (crops, lower quality, etc) of the same content. So I have put all the content I have on MEGA. If I have replied to your comment then the content for sure is in this torrent. MEGA: https://mega.nz/folder/30MlkQib#RDOaGzmtFEHkxSYBaJSzVA (this is the prefered way of downloading) (This is sitting in at ~350GB as of Jan 10 3:00 PM EST. Still adding content) UPDATE 2: Link should be working - MEGA contacted me and reinstated the account (and gave premium so I could upload more). I will be uploading more content that I find to the mega account. Still going through the comments, and the 900+ messages I have. Keep posting comments and I will upload them to the MEGA folder. UPDATE 3: \"Bellingcat\" has created a really efficient way to submit media via a Google Spreadsheet. It's not connected to my archive, but I hope to have a merged final copy in the end. UPDATE 4: IF YOU WANT TO UPLOAD A FILE DIRECTLY TO ME: https://mega.nz/megadrop/fgve0WRa880 (no account registration needed) BACKUPS: Recommended backup: u/tweedge : tweedge commits to making sure this mirror does not fall behind 12h behind, though he'll do his best to keep it within 6h Other backups based on the original MEGA from Jan 06 6:30PM - some might've updated, but no idea if/when; check each link, it should say. Or you can message the user: MAGNET from u/SneakyPieBrown as of Jan 08 2021 : magnet:?xt=urn:btih:fc33c9146c81660ee087dbda756746a978c7c104&dn=Trump%20protest%20Jan-08-2021&tr=udp%3a%2f%2ftracker.openbittorrent.com%3a80 u/firstgrow : hosting direct downloads as well u/nuzzles_u_uwu : Is hosting as well u/tweedge : made a direct download link on s3 u/kenkoda : posted a torrent. u/Deifer : Link u/benediktkr : https://mirrors.deadops.de/capitol2021 and https://mirrors.deadops.de/capitol2021.zip See a familiar face in the archive? https://tips.fbi.gov/digitalmedia/aad18481a3e8f02"},
{"Title": "Justin Roiland, co-creator of Rick and Morty, discovers that Dropbox uses content scanners through the deletion of all his data stored on their servers", "Author": "u/_G0D_M0DE_", "Content": "No content"},
{"Title": "yall might appreciate this", "Author": "u/ian9921", "Content": "No content"},
{"Title": "I just built a collapse-ready laptop. What are some must haves to put on it?", "Author": "u/evanMeaney", "Content": "No content"},
{"Title": "Rescue Mission for Sci-Hub and Open Science: We are the library.", "Author": "u/shrine", "Content": "EFF hears the call: \"It’s Time to Fight for Open Access\" EFF reports: Activists Mobilize to Fight Censorship and Save Open Science \"Continuing the long tradition of internet hacktivism ... redditors are mobilizing to create an uncensorable back-up of Sci-Hub\" The EFF stands with Sci-Hub in the fight for Open Science, a fight for the human right to benefit and share in human scientific advancement. My wholehearted thanks for every seeder who takes part in this rescue mission, and every person who raises their voice in support of Sci-Hub's vision for Open Science. Rescue Mission Links Quick start to rescuing Sci-Hub : Download 1 random torrent (100GB) from the scimag index of torrents with fewer than 12 seeders , open the .torrent file using a BitTorrent client, then leave your client open to upload (seed) the articles to others. You're now part of an un-censorable library archive! Initial success update: The entire Sci-Hub collection has at least 3 seeders: Let's get it to 5. Let's get it to 7! Let’s get it to 10! Let’s get it to 12! Contribute to open source Sci-Hub projects: freereadorg/awesome-libgen Join r/scihub to stay up to date Note: We have no affiliation with Sci-Hub This effort is completely unaffiliated from Sci-Hub, no one is in touch with Sci-Hub, and I don't speak for Sci-Hub in any form. Always refer to sci-hub.do for the latest from Sci-Hub directly. This is a data preservation effort for just the articles, and does not help Sci-Hub directly.  Sci-Hub is not in any further imminent danger than it always has been, and is not at greater risk of being shut-down than before. A Rescue Mission for Sci-Hub and Open Science Elsevier and the USDOJ have declared war against Sci-Hub and open science. The era of Sci-Hub and Alexandra standing alone in this fight must end. We have to take a stand with her. On May 7th, Sci-Hub's Alexandra Elbakyan revealed that the FBI has been wiretapping her accounts for over 2 years. This news comes after Twitter silenced the official Sci_Hub twitter account because Indian academics were organizing on it against Elsevier. Sci-Hub itself is currently frozen and has not downloaded any new articles since December 2020. This rescue mission is focused on seeding the article collection in order to prepare for a potential Sci-Hub shutdown. Alexandra Elbakyan of Sci-Hub, bookwarrior of Library Genesis , Aaron Swartz , and countless unnamed others have fought to free science from the grips of for-profit publishers. Today, they do it working in hiding, alone, without acknowledgment, in fear of imprisonment, and even now wiretapped by the FBI. They sacrifice everything for one vision: Open Science. Why do they do it? They do it so that humble scholars on the other side of the planet can practice medicine, create science, fight for democracy, teach, and learn. People like Alexandra Elbakyan would give up their personal freedom for that one goal: to free knowledge. For that, Elsevier Corp (RELX, market cap: 50 billion) wants to silence her, wants to see her in prison, and wants to shut Sci-Hub down. It's time we sent Elsevier and the USDOJ a clearer message about the fate of Sci-Hub and open science: we are the library, we do not get silenced, we do not shut down our computers, and we are many. Rescue Mission for Sci-Hub If you have been following the story, then you know that this is not our first rescue mission. We protected the Library Genesis book collection We unlocked over 5,000 COVID-19 research articles We successfully petitioned publishers to unlock their COVID-19 paywalls bookwarrior, the founder of Library Genesis, took his library onto the de-centralized and un-censorable IPFS web Next? Make Sci-Hub un-censorable too. Rescue Target A handful of Library Genesis seeders are currently seeding the Sci-Hub torrents. There are 850 scihub torrents , each containing 100,000 scientific articles, to a total of 85 million scientific articles: 77TB. This is the complete Sci-Hub database. We need to protect this. Rescue Team Wave 1: We need 85 datahoarders to store and seed 1TB of articles each, 10 torrents in total. Download 10 random torrents from the scimag index of < 12 seeders , then load the torrents onto your client and seed for as long as you can. The articles are coded by DOI and in zip files. Wave 2: Reach out to 10 good friends to ask them to grab just 1 random torrent (100GB). That's 850 seeders. We are now the library. Final Wave: Development for an open source Sci-Hub. freereadorg/awesome-libgen is a collection of open source achievements based on the Sci-Hub and Library Genesis databases. Open source de-centralization of Sci-Hub is the ultimate goal here, and this begins with the data, but it is going to take years of developer sweat to carry these libraries into the future. Heartfelt thanks to the r/datahoarder and r/seedboxes communities, seedbox.io and NFOrce for your support for previous missions and your love for science."},
{"Title": "Data transfer to new Lustre storage overwhelms campus network", "Author": "u/e_spider", "Content": "No content"},
{"Title": "Whoops", "Author": "u/MidnightLink", "Content": "No content"},
{"Title": "A funny exchange", "Author": "Unknown author", "Content": "No content"},
{"Title": "One woman's quest to \"never delete anything\" allowed internet archivists to find long-lost Minecraft Alpha 1.1.1.", "Author": "u/BrikenEnglz", "Content": "No content"},
{"Title": "Amazon delivery driver with my new HD", "Author": "u/fancy_pantser", "Content": "No content"},
{"Title": "Apple sued for terminating account with $25,000 worth of apps and videos", "Author": "u/usernamechosen999", "Content": "No content"},
{"Title": "Some of the drives used to store the data to to compile the first picture ever of a black hole.", "Author": "u/the_best_moshe", "Content": "No content"},
{"Title": "Archivists Are Preserving Capitol Hill Riot Livestreams Before They’re Deleted", "Author": "u/fairyrocker91", "Content": "No content"},
{"Title": "Twitter to purge accounts that have had no activity at all for several years", "Author": "u/NXGZ", "Content": "No content"},
{"Title": "I can dream", "Author": "u/gammajayy", "Content": "No content"},
{"Title": "This is your regular reminder that Comcast is still a dumpster fire: Comcast to impose home internet data cap of 1.2TB in more than a dozen US states next year", "Author": "u/Snoot_Boopins", "Content": "No content"},
{"Title": "\"If you visit CERN in Geneva, you can buy 1 Terabyte of Large Hadron Collider data from the souvenir shop\"... there goes my kid's college funds", "Author": "Unknown author", "Content": "No content"},
{"Title": "yahoo answers is shutting down", "Author": "u/Fazlul101", "Content": "No content"},
{"Title": "internet archive is being sued", "Author": "u/sersoniko", "Content": "No content"},
{"Title": "Forklift accident", "Author": "u/Enkelie", "Content": "No content"},
{"Title": "Need help in archiving a second coppy of the famitracker website and forums", "Author": "u/jreina2002", "Content": "Hello all. Last year I had requested of a website to be archived, called as http://famitracker.com/ When that site had gone down a year ago it came back up, and I wanted to preserve the site and its topics as well as music. It turns out that they had some initiative in doing so, but the people at the famitracker.org Discord server also had things going on in real life so they were unable to help archive at this time. I would like to ask if you can please help me? Not all of the famitracker site and forums were preserved apparently, and now we have a second shot at this! They're some things you should know though. First of all we need to archive at a speed that's safe for the site. It musn't be too fast otherwise the site might go down, but I also have a question. Is it possible that it can be made into an archive that's readable by those wanting to look at it as in not on archive.org?"},
{"Title": "Official Giveaway: June 2024 Seagate IronWolf Pro 16TB Hard Drive Giveaway", "Author": "u/Seagate_Surfer", "Content": "Hi r/DataHoarder crowd! We love your sub and would like to rev up another giveaway with the permission of the mod team. The prize is: one 16TB IronWolf Pro Hard Disk Drive How to enter: Just reply to this post once with a top-level comment response on the following topic: What kind of loyalty program matters to you for a company? Is drive capacity, price point, excellent customer service, etc. the highest priority for you? Please include the phrases RunWithIronWolf and Seagate in your comment. Selection process/rules One entry per person. Using alt accounts will result in a ban. New accounts created after this post went live are not eligible. Entries are open until June 27, 2024 at 23:59 UTC. We will use a random raffler utility to filter out top level comments (that is, top-level replies to this post, and not to another comment, and not on any cross-posts). The tool will remove duplicate usernames, sort the list, and grab the randomly chosen username, at which point the winner will be contacted within a day or so of the giveaway ending. Winners will have 48 hrs to get us their physical address and contact details for shipping (no PO boxes). Any person who does not reply in time loses their spot and everyone moves up a tier. For example: the 1st place person does not respond, so the 2nd place person gets contacted. Seagate will use the information strictly for shipping purposes only and will ship the drive directly. We reserve the right to edit this post including this process and these rules without notice. This is reddit, after all. Geographic restrictions: Our policy is for our forums and Reddit giveaways to be global where local shipping and/or giveaway restrictions/current world events don’t prevent us, however we are basing the below list of eligible counties from previous giveaways, as some counties have unique restrictions (e.g. the obvious shipping restrictions to Russia and Belarus currently) US Canada (will require a basic skills-based question if winner is chosen by law) Brazil South America United Kingdom Germany France Iberia Australia New Zealand Korea India Malaysia Singapore China"}
]